[
  {
    "title": "US sides with Russia in UN resolutions on invasion of Ukraine",
    "url": "https://www.bbc.com/news/articles/c7435pnle0go",
    "formatted_content": "The US has twice sided with Russia in votes at the United Nations to mark the third anniversary of the Russian invasion of Ukraine, highlighting the Trump administration's change of stance on the war.\n\nFirst, the US opposed a European-drafted resolution condemning Moscow's actions and supporting Ukraine's territorial integrity - voting the same way as Russia and countries including North Korea and Belarus at the UN General Assembly (UNGA) in New York.\n\nThen the US drafted and voted for a resolution at the UN Security Council which called for an end to the conflict, but contained no criticism of Russia.\n\nThe Security Council passed the resolution, but two key US allies, the UK and France, abstained after their attempts to amend the wording were vetoed.\n\nThe UN resolutions were tabled as French President Emmanuel Macron visited President Donald Trump at the White House in an attempt to address their sharp differences over the war.\n\nOn Thursday, British Prime Minister Sir Keir Starmer will likewise visit the new American leader.\n\nTrump's White House has upended the transatlantic alliance, currying favour with Moscow and casting doubt on America's long-term commitment to European security.\n\nThat rift was laid bare on the floor of the 193-member UNGA on Monday as US diplomats pushed their limited resolution mourning the loss of life during the \"Russia-Ukraine conflict\" and calling for a swift end to it.\n\nEuropean diplomats tabled a more detailed text, blaming Russia for its full-scale invasion, and supporting Ukraine's sovereignty and territorial integrity.\n\n\"We need to reconfirm that the aggression should be condemned and discredited, not rewarded,\" said Ukrainian Deputy Foreign Minister Mariana Betsa.\n\nUNGA members backed the European resolution by 93 votes but, extraordinarily, the US did not abstain but actually voted against it, along with Russia, Israel, North Korea, Sudan, Belarus, Hungary and 11 other states, with 65 abstentions.\n\nThe UNGA also passed the US resolution but only after it was amended to include language supporting Ukraine, which led to the US abstaining.\n\nRepublican Senator John Curtis said he was \"deeply troubled\" by the vote \"which put us on the same side as Russia and North Korea\".\n\n\"These are not our friends. This posture is a dramatic shift from American ideals of freedom and democracy,\" he wrote on X.\n\nThe vote was \"contrary to our long-standing support of democracy\", said former US House of Representatives Speaker Nancy Pelosi.\n\nUkraine's former minister of economy, Tymofiy Mylovanov, said the choice to side with Russia was deliberate.\n\n\"This is no longer just rhetoric or political theatre,\" he said.\n\nAt the much more powerful 15-member UN Security Council, the unamended US resolution - which called for an end to the conflict but contained no criticism of Russia - was passed by 10 votes, with the UK, France, Denmark, Greece and Slovenia abstaining.\n\nAmerica's acting envoy to the UN, Dorothy Camille Shea, described the US resolution as a \"simple historic statement... that looks forward, not backwards. A resolution focused on one simple idea: ending the war\".\n\nRarely has the US been so at odds with its supposed European allies.\n\nSince Russia invaded Ukraine three years ago, the Security Council has been deadlocked by the power of Russia, one of its five permanent members, to veto any resolution there.\n\nFor this reason the UNGA has been the main forum for debating the war. But its resolutions are not legally binding for member states, unlike those of the Security Council.\n\nFollow the twists and turns of Trump's second presidential term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here."
  },
  {
    "title": "Why did Putin’s Russia invade Ukraine and does he want to get rid of Zelensky?",
    "url": "https://www.bbc.com/news/articles/cj0q964851po",
    "formatted_content": "When Russian President Vladimir Putin ordered up to 200,000 soldiers into Ukraine, his aim was to sweep into the capital, Kyiv, in a matter of days.\n\nHe wanted to overthrow the pro-Western government and return Ukraine to Russia's sphere of influence.\n\nPutin failed. But more than three years on, a fifth of Ukrainian territory is in Russian hands, and the US - until recently Ukraine's strongest ally - has held direct talks with Russia over ending the war.\n\nA joint US-Ukrainian proposal to pause fighting for 30 days has yet to be agreed by Russia.\n\nWhy did Putin invade Ukraine?\n\nAs Putin launched the biggest European invasion since the end of World War Two, he gave a fiery speech on TV declaring his goal was to \"demilitarise and denazify\" Ukraine.\n\nRussia has repeatedly painted modern Ukraine as a Nazi state, in a crass distortion of history.\n\nPutin had already seized Ukraine's Crimean peninsula eight years earlier, after a revolution that ousted Ukraine's pro-Russian president and replaced him with a more pro-Western government.\n\nPutin then prompted a lower-level war in Ukraine's eastern Donbas region, with pro-Russian proxy forces occupying territory and setting up rebel states supported by Moscow.\n\nBut the 2022 invasion was on a different scale.\n\nPutin had just recognised the rebel states as independent. Then, as the invasion began, he said the people there - many of whom are Russian speakers - needed protection from the Kyiv \"regime\".\n\nA day later, Putin called on Ukraine's military to \"take power into your own hands\" and target the \"gangs of drug addicts and neo-Nazis\" running the government.\n\nPutin then added another objective - to ensure Ukraine stayed neutral. He accused the Western defensive alliance, Nato, of trying to gain a foothold in Ukraine to bring its troops closer to Russia's borders.\n\nThe Russian leader has long questioned Ukraine's right to exist, claiming that \"modern Ukraine was entirely created by Russia\" after the communist revolution in 1917.\n\nIn a long-winded 2021 essay he even suggested \"Russians and Ukrainians were one people\" dating back to the late 9th Century. Last year he told US TV talk show host Tucker Carlson that Ukraine was an \"artificial state\".\n\nThose comments have led many to believe that the goal of the invasion was in effect to erase the state of Ukraine.\n\nRussia's state-run Ria news agency explained that \"denazification is inevitably also de-Ukrainisation\" - seemingly tying the idea of erasing Ukraine to the stated goal of the invasion.\n\nUkrainian culture and identity have in fact existed for centuries independently of Russia.\n\nFact-checking Putin's 'nonsense' history\n\nZelensky - from comedian to wartime leader\n\nDoes Putin want to get rid of Zelensky?\n\nPutin has long sought to get rid of Ukraine's elected pro-Western president, and Zelensky was apparently a target from the very start of the war.\n\nRussian troops made two attempts to storm the presidential compound soon after the invasion, according to Zelensky's adviser, and Ukraine's elected leader said they wanted him dead.\n\n\"The enemy has designated me as target number one; my family is target number two.\n\n\" They want to destroy Ukraine politically by destroying the head of state.\"\n\nZelensky said later that Putin had initially tried to replace him with the wealthy head of a pro-Russian party, Viktor Medvedchuk, who was accused of treason in Ukraine and is now in Russia.\n\nEven now, three years on, Putin refuses direct peace talks with Zelensky \"because of his illegitimacy\" - a false narrative that has been repeated by President Trump.\n\nAs evidence Putin cites the postponement of Ukraine's March 2024 presidential election, although it is because of Russia's war that Ukraine is under martial law and elections are barred under the constitution.\n\nPutin's own re-election in 2024 is highly questionable, as Russia's opposition leaders are either in exile or dead.\n\nWas Nato expansion to blame for the war?\n\nPutin has for years complained about Nato's eastward expansion as a security threat, and sees any possibility of Ukraine joining the alliance as a major red line.\n\nBefore Russia's 2022 invasion he demanded that Nato remove multinational deployments from the Central and Eastern European states that joined the Western alliance after 1997.\n\nBut it was Russia who launched military action in Eastern Europe, when it invaded Georgia in 2008 and then Crimea in 2014.\n\nAfter the Crimea invasion, Nato established a continuous presence on its eastern flank - closest to Russia.\n\nNato has always stressed the whole purpose of the alliance is to defend territories \"with no aggressive intentions\". Sweden and Finland have joined Nato in the past two years precisely because of the perceived Russian threat.\n\nIt is part of Ukraine's constitution to join the European Union and Nato, but there was no real prospect of this when the full-scale war began.\n\nZelensky said as much two weeks into the invasion: \"Nato is not prepared to accept Ukraine.\"\n\nHe has since said he would consider resigning in exchange for Nato membership, but Trump says Kyiv should \"forget about\" joining the Western alliance.\n\nPutin has accused Nato of participating in the war, because its member states have increasingly sent Ukraine military hardware, including tanks and fighter jets, air defence systems, missile systems, artillery and drones.\n\nNato has provided security assistance and training to Ukraine, but it insists that does not make it a party to the war.\n\nPutin's grievance against Nato dates back to 1990, when he claims the West promised not to expand \"an inch to the East\".\n\nHowever that was before the Soviet Union collapsed and it was based on a limited commitment made to then Soviet President Mikhail Gorbachev.\n\nGorbachev said \"the topic of Nato expansion was never discussed\" at the time.\n\nRead more: What is Nato?\n\nDo Putin's claims on Nazis and genocide stack up?\n\nAt the start of the 2022 invasion, Putin vowed to protect people in occupied areas of eastern Ukraine from eight years of Ukrainian \"bullying and genocide, during the war in the east.\n\nMore than 14,000 people died on both sides of the front line between 2014-2022, but Russian claims of Ukrainian Nazis committing genocide in the occupied regions never added up, and no international body has spoken of genocide. Germany's chancellor called the allegation \"ridiculous\".\n\nThe Russian taunts of Nazis in charge in Kyiv are also not correct.\n\nModern Ukraine has no far-right parties in parliament - they failed to get enough votes in the 2019 elections. On top of that, Zelensky is Jewish and many of his relatives were murdered by the Nazis in World War Two.\n\nPutin condemns him as a \"disgrace to the Jewish people\", but the US Holocaust Memorial Museum rejects his claims outright, saying he \"misrepresented and misappropriated Holocaust history\".\n\nPutin himself was accused of war crimes by the International Criminal Court in 2024, although that has been rejected by the Kremlin.\n\nWhen did Russia invade Ukraine?\n\nRussia's attempt to stop Ukraine leaving its sphere of influence goes back years, and its initial invasion began in 2014 when pro-Russian president Viktor Yanukovych was ousted after months of mass demonstrations.\n\nYanukovych had abandoned an EU deal under Putin's pressure, prompting protests that ended when snipers shot dead dozens of demonstrators. Yanukovych soon fled to Russia.\n\nPutin quickly seized Ukraine's Crimean peninsula and Russian proxies took up arms against the government, occupying parts of the eastern Luhansk and Donetsk regions.\n\nTwo attempts to stop the war came to nothing.\n\nThey were known as the Minsk agreements and were brokered by France, Germany and Russia itself. They reduced the scale of violence, but Zelensky has called them a trap that created a frozen conflict on Russia's terms.\n\nBoth sides accused each other of violations, and the Kremlin said ultimately the failed accords were a precursor to Moscow's full-scale invasion.\n\nThe Ukrainian leader has warned the Trump administration not to trust Putin: \"He broke the ceasefire, he killed our people.\"\n\nHow Trump-Zelensky talks collapsed\n\nWhat minerals does Ukraine have?\n\nTracking the war in maps\n\nWho is winning the war?\n\nAfter three years of offensives and counter-offensives, Russian and Ukrainian forces are in a war of attrition on an active front line of more than 1,000km (629 miles).\n\nNeither side has any realistic prospect of winning this war.\n\nRussia annexed four regions in eastern and southern Ukraine after sham referendums in 2022, and yet it can really only claim to have full control of one of them, Luhansk.\n\nUkrainian forces were able to liberate large areas of the north and parts of the south in 2022, but more recent counter-offensives have not had the same success.\n\nThey still control a small part of Russia's Kursk region after launching an offensive in August 2024, but have lost control of all major settlements there. Ukrainian troops have also lost ground in the east.\n\nMuch of Russia's firepower has been turned towards the Donetsk region, as towns and villages are destroyed in a slow and grinding advance.\n\nThe war is taking its toll on Russia's economy, with high interest rates and inflation and defence spending this year of at least 33% of the federal budget.\n\nUkraine has lost a big part of its economic wealth to Russian occupation and destruction in its industrial east. Growth has been hit by attacks on its energy infrastructure.\n\nAlthough inflation and interest rates are high, Ukraine has secured Western aid to cover its budget deficit.\n\nHow many people have died in the Ukraine war?\n\nTens of thousands of people have died since Putin sent in the troops in 2022.\n\nUkraine's president has spoken of 43,000 Ukrainian military deaths, but open source site ualosses.org suggests the number is above 70,000.\n\nMore than 12,000 civilians have lost their lives in Ukraine, according to the UN.\n\nRussia rarely admits to military losses, but BBC analysis estimates that Russian deaths could range from 146,194 to 211,169.\n\nThe war has forced 6.9 million Ukrainians to seek refuge abroad, and a further 3.7 million to flee their homes inside Ukraine.\n\nAt the start, Putin did not even call it war but a \"special military operation\". Eventually in 2024 he accepted it was, but claimed it was instigated by Kyiv or its \"Western handlers\".\n\nWhat are the historical ties between Ukraine and Russia?\n\nPutin appears to believe that Ukraine should remain in Russia's sphere of influence because of the historical links between the two countries.\n\nFrom 1922-91 Ukraine was part of the Soviet Union and many Ukrainians speak Russian especially in the east, including Volodymyr Zelensky who is a native speaker.\n\nMany Russians view Crimea as their own. It was annexed by Catherine the Great in 1783 and handed to Ukraine by Soviet leader Khrushchev in 1954. Ten years earlier, his predecessor Stalin had deported Crimea's Tatar population, so the majority population was ethnic Russian.\n\nSince 1991 Ukraine has been an independent state. It abandoned its nuclear weapons in 1994 in return for guaranteed security from Russia, the UK and US which Moscow failed to respect.\n\nSince the war, many Ukrainians have turned their back on Russian, and Zelensky himself avoids using the language in public."
  },
  {
    "title": "Ukraine election rumours: Is Zelensky mulling a summer poll?",
    "url": "https://www.bbc.com/news/articles/cp8je3l5n1wo",
    "formatted_content": "As Ukrainian cities are bombed almost nightly by Russia, the idea of holding elections here might seem fanciful.\n\nBut in the streets and offices of the capital, Kyiv, the prospect of the country going to the polls is once again being discussed.\n\nElection rumours have come and gone in the three long years of Russia's full-scale war.\n\nEach time they have been dismissed by government, opposition and public alike, arguing unity of effort against the Russian invader must come first.\n\nA presidential election due in 2024 was suspended in line with martial law, which was introduced in Ukraine following Russia's full-scale invasion two years earlier.\n\nBut that hasn't stopped the Kremlin from claiming President Volodymyr Zelensky is an illegitimate leader and demanding new elections as a condition of a ceasefire deal – a talking point which has been repeated by President Trump.\n\nNow there has been a fresh flurry of speculation that Zelensky might just be thinking again as ceasefire talks proceed, and some sources speaking to the BBC suggest there are reasons to think elections could go ahead later this year.\n\nThe president's potential closest rival, Valerii Zaluzhnyi, former commander in chief of Ukraine's army, has felt the need to deny rumours about his intentions.\n\n\"My answer to this has not changed,\" he told the RBC-Ukraine news agency. \"While the war continues, we all need to work to save the country, not think about elections. I don't comment on any rumours.\"\n\nThat the publicity-shy Zaluzhnyi, currently Ukraine's ambassador in London, felt the need to issue a statement was striking in itself.\n\nThe head of Ukraine's Central Election Commission, Oleh Didenko, also chose to speak publicly about the speculation.\n\nHe told the Ukrainska Pravda news website the law would have to be changed before any elections could take place. He said current rules stated that parliamentary elections must be held 60 days after the lifting of martial law, and 90 days for presidential elections.\n\nBut more time would be needed because of the war and that would require legal changes.\n\nThe Economist newspaper claimed Zelensky held a meeting last week to discuss an election and instructed staff to prepare for a vote once the United States had forced Russia into accepting a ceasefire, potentially as early as Easter.\n\nThis report was denied by several government sources.\n\n\"There is fake information there,\" one presidential source told BBC News Ukrainian. \"There was no such meeting and there was no such instruction.\"\n\nThe government source said the main focus was achieving peace and there was little hope of the war ending by Easter.\n\nSo in the face of so many public denials, why do some still think an election might be in the offing?\n\nFirst, some sources note Zelensky's support in the polls has picked up since he was harangued by Donald Trump and Vice-President JD Vance in the White House.\n\nA poll by the Kyiv International Institute of Sociology (KIIS) in March suggested the number of Ukrainians who trusted Zelensky was up a couple of points on the previous month at 69%.\n\nDiplomats say the president might think now was his best chance of winning a second term rather than wait until political divisions emerge after the war.\n\nSecond, by winning a second term, Zelensky would call Russia's bluff and strengthen his hand in any long-term peace negotiations. Only last week President Vladimir Putin said the United Nations should take over Ukraine and organise a \"democratic presidential election\". His assumption – perhaps mistaken - is that Zelensky would be replaced.\n\nThird, martial law must be renewed by parliamentary vote in early May. Zelensky could use that timetable to announce martial law would be allowed to lapse with elections held later in the summer.\n\nFourth, the Americans are convinced elections are coming. Steve Witkoff, President Trump's special envoy, told the Tucker Carlson podcast on March 21: \"They've agreed to it. There will be elections in Ukraine.\"\n\nZelensky could use this pressure from the US – echoing Russian narratives – as a pretext, telling voters he had no choice but to hold elections.\n\nFifth, some Ukrainian sources believe logistical obstacles to elections can be overcome.\n\nMillions of citizens are displaced overseas, on the front line and in occupied territories. The answer to that, some say, is to allow people to vote using a smart phone app called Diia. This contains people's core documents such as passport, identity card and drivers' licence.\n\nUsing Diia, some argue, would allow people to vote quickly, cheaply and safely without having to travel to a polling booth overseas or in the trenches. They point out Ukrainians have used it successfully to vote in the Eurovision Song Contest. They also note President Zelensky gave every Ukrainian almost £20 as a winter allowance last December, with many registering for it using Diia.\n\nBut there remain many arguments against elections.\n\nUsing Diia would require new legislation that might struggle to get through parliament. Diia could be vulnerable to cyber-attack and technical failure. Western governments may not consider it trustworthy; Russia certainly would not.\n\nEven if Diia were used, identifying who could vote would still take time with incomplete and out-of-date registers.\n\nLifting martial law during a temporary ceasefire could create unexpected consequences – including the flight of hundreds of thousands of soldiers from the front line – just as Russia prepared a counterattack. Russia could strike queues of voters at polling stations.\n\nAny elections, however quickly held, would allow war-time unity to be replaced by political rows. An election would allow Russia to deploy digital and other propaganda to try to shape the result.\n\nHolding an election may also be seen as accepting Russian arguments that Volodymyr Zelensky's leadership is illegitimate because of the suspended elections last year.\n\nPerhaps the strongest argument against elections is that Ukrainians themselves do not want them. That same March poll by the KIIS found about 78% of people opposed holding elections even after a complete settlement of the war."
  },
  {
    "title": "Putin begins biggest Russian military call-up in years",
    "url": "https://www.bbc.com/news/articles/c36718p52eyo",
    "formatted_content": "President Vladimir Putin has called up 160,000 men aged 18-30, Russia's highest number of conscripts since 2011, as the country moves to expand the size of its military.\n\nThe spring call-up for a year's military service came several months after Putin said Russia should increase the overall size of its military to almost 2.39 million and its number of active servicemen to 1.5 million.\n\nThat is a rise of 180,000 over the coming three years.\n\nVice Adm Vladimir Tsimlyansky said the new conscripts would not be sent to fight in Ukraine for what Russia calls its \"special military operation\".\n\nHowever, there have been reports of conscripts being killed in fighting in Russia's border regions and they were sent to fight in Ukraine in the early months of the full-scale war.\n\nThe current draft, which takes place between April and July, comes despite US attempts to forge a ceasefire in the war.\n\nThere was no let-up in the violence on Tuesday, with Ukraine saying that a Russian attack on a power facility in the southern city of Kherson had left 45,000 people without electricity.\n\nRussia also claimed to have captured another Ukrainian village, at Rozlyiv in the Donetsk region.\n\nRussia calls up conscripts in the spring and autumn but the latest draft of 160,000 young men is 10,000 higher than the same period in 2024.\n\nSince the start of last year, the pool of young men available for the draft has been increased by raising the maximum age from 27 to 30.\n\nAs well as call-up notices delivered by post, young men will receive notifications on the state services website Gosuslugi.\n\nQuite apart from its twice-yearly draft, Russia has also called up large numbers of men as contract soldiers and recruited thousands of soldiers from North Korea.\n\nMoscow has had to respond to extensive losses in Ukraine, with more than 100,000 verified by the BBC and Mediazona as soldiers killed in Ukraine.\n\nThe true number could be more than double.\n\nPutin has scaled up the size of the military three times since he ordered troops to capture Ukraine in February 2022.\n\nRussia's defence ministry linked the December 2023 increase in the size of the military to \"growing threats\" from both the war in Ukraine and the \"ongoing expansion of Nato\".\n\nNato has expanded to include Finland and Sweden, as a direct result of Russia's invasion of Ukraine.\n\nFinland has Nato's longest border with Russia, at 1,343km (834 miles) and Prime Minister Petteri Orpo said on Tuesday that his country would join other states neighbouring Russia in pulling out of the Ottawa convention banning anti-personnel mines.\n\nPoland and the Baltic states made similar decisions two weeks ago because of the military threat from Russia.\n\nOrpo said the decision to resume using anti-personnel mines was based on military advice, and that the people of Finland had nothing to worry about.\n\nThe government in Helsinki also said defence spending would be increased to 3% of economic output (GDP), up from 2.4% last year."
  },
  {
    "title": "Russia-Ukraine war: List of key events – day 1,101 | Russia-Ukraine war News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/1/russia-ukraine-war-list-of-key-events-day-1101",
    "formatted_content": "Here is the situation on Saturday, March 1:\n\n### Fighting\n\n- Three people have been killed in a Ukrainian attack on a Russian-occupied part of Kherson region in southern Ukraine, Russian-installed governor Vladimir Saldo said. Five other people were injured of varying degrees of severity, Saldo said.\n- One person was killed and another injured after a drone attack triggered fires in a private home and a business facility in the Black Sea port of Odesa, which is a frequent Russian target in southern Ukraine.\n- Ukraine’s air defences destroyed 103 of 154 drones launched by Russia in an overnight strike, Kyiv’s air force said. The other 51 drones were “locationally lost”, it said, likely as a result of electronic jamming.\n- Russian drones struck a medical facility and other targets in Ukraine’s second-largest city, Kharkiv, injuring at least seven people, officials said.\n- Kharkiv regional governor Oleh Syniehubov said civilian areas in three central districts of the city were hit and at least 50 people were forced to evacuate from a medical facility that was hit in the strike.\n- Russia’s Defence Ministry said its forces had taken control of the settlements of Burlatske and Skudne in Ukraine’s eastern Donetsk region, state-run news agency TASS reported.\n- Russian infantry are storming the Ukrainian border from the Russian region of Kursk, near areas of the region that are controlled by Ukrainian forces, Kyiv said. For the moment the offensive has been contained, it added.\n\n### Politics and diplomacy\n\n- An Oval Office meeting between United States President Donald Trump and his Ukrainian counterpart Volodymyr Zelenskyy devolved into a shouting match on Friday, as Trump threatened Zelenskyy, telling him: “You’re either going to make a deal or we’re out.”\n- World leaders overwhelmingly expressed their support for Zelenskyy after his meeting with Trump in Washington, DC, ended abruptly with the two engaging in a heated exchange over Russia’s war against Kyiv.\n- US Secretary of State Marco Rubio has called on Zelenskyy to apologise for clashing with Trump, and “for wasting our time for a meeting that was going to end the way it did”.\n- Zelenskyy said his relations with the US can still be repaired, after Trump shouted at him at the White House and accused him of refusing to make peace with Russia.\n- Trump said Zelenskyy “overplayed his hand” during their extraordinary Oval Office clash, accusing his visitor of wanting to drag out conflict with Russia. Trump added that he wants “a ceasefire now”.\n- Russia has announced it is sending a new ambassador, Alexander Darchiyev, to Washington, the latest sign of a thaw between the two countries as they try to mend their damaged relations and seek an end to the war in Ukraine.\n- Former Russian President Dmitry Medvedev said Russia is ready for flexibility in talks on Ukraine, but only in accordance with the Russian constitution and realities on the ground, state news agency RIA Novosti reported. He also said Russia was ready to discuss a settlement of the crisis, but only with those “who are ready to communicate”.\n- Russian President Vladimir Putin held a meeting with senior North Korean official Ri Hi Yong in Moscow and expressed his gratitude for Pyongyang’s active support of Kremlin, North Korea’s state news agency reported. The development comes amid reports that North Korea reportedly deployed at least 1,000 more troops to fight in Ukraine, on top of the12,000 deployed last year.\n- The International Monetary Fund and Ukraine reached a deal on a loan programme review that will unlock about $400m in much-needed funds more than three years after Russia’s invasion.\n- Preparations are under way for United Kingdom Prime Minister Keir Starmer’s meeting with a dozen European leaders on Sunday to “drive forward” action on Ukraine and security. Zelenskyy is among those expected to attend the meeting.\n- Norway’s Prime Minister Jonas Gahr Stoere announced through the public broadcaster NRK that he will soon ask parliament to increase financial backing for Ukraine. Late last year, Norway’s parliament had agreed to spend equivalent to $3.12bn on military and civilian support for 2025, part of the $13.77bn aid from 2023 to 2030."
  },
  {
    "title": "Russia’s Putin says North Korea, BRICS should join Ukraine ceasefire talks | Russia-Ukraine war News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/28/russias-putin-says-north-korea-brics-should-join-ukraine-ceasefire-talks",
    "formatted_content": "Russian President Vladimir Putin said that Ukraine could be placed under a “temporary administration” as part of a peace process that could include help from North Korea and other Moscow allies, according to Russian state media.\nSpeaking to a group of servicemen in Russia’s northern port of Murmansk, Putin laid out several provisions for a peace process to end the three-year war launched by Moscow in February 2022, according to Russia’s state news agency, TASS.\nAmong Putin’s many suggestions was a call for new elections in Ukraine and the “signing of key accords” once the country is under international administration, TASS said.\n“In principle, of course, a temporary administration could be introduced in Ukraine under the auspices of the UN, the United States, European countries and our partners,” Putin was quoted as saying.\n“This would be in order to hold democratic elections and bring to power a capable government enjoying the trust of the people and then to start talks with them about a peace treaty,” Putin said.\n“We are for resolving all these issues by peaceful means,” he said. “Yet, with removing the original causes that triggered the current situation,” he added.\nPutin also said other countries should be involved in the peace process beyond the US and Russia, including Moscow’s treaty ally Pyongyang.\n“This is not only the United States but also the People’s Republic of China, India, Brazil, South Africa, all BRICS countries,” Putin said.\n“And many others, for example, including the Democratic People’s Republic of Korea,” he said, using North Korea’s official name.\nPyongyang has sent more than 3,000 new troops to join Russian forces fighting in Ukraine, according to South Korea’s military, topping the 11,000 sent last year, among which casualties are reported to have been catastrophic from the fighting with Ukraine’s army.\nPutin also said he was ready to work with Europe, as well, although it was “acting inconsistently, constantly trying to fool us”.\n“But it’s OK, we have gotten used to it already. I hope we will make no mistakes based on excessive trust to our so-called partners,” he said, according to TASS.\nPraise was reserved for US President Donald Trump, who the Russian leader described as “sincerely wishing for the end of this conflict”.\nPutin’s comments follow separate negotiations in Saudi Arabia’s Riyadh this week between Russian, Ukrainian and US officials aimed at securing a temporary ceasefire.\nAccording to the US, Kyiv and Moscow agreed to halt military strikes on vessels in the Black Sea, but in the days since, they have both accused each other of not taking the peace talks seriously.\nFollowing the deal, Ukraine accused Russia of launching an overnight drone attack on the city of Mykolaiv, which Ukrainian President Volodymyr Zelenskyy described as a “clear signal to the whole world that Moscow is not going to pursue real peace”.\nRussia separately accused Ukraine of carrying out a drone attack on a gas storage facility and a power installation in Russian-held territory, in contravention of an agreement to not attack each other’s power facilities.\nRussian media said a second round of talks is due to resume in Riyadh in mid-April."
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,128 | Russia-Ukraine war News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/28/russia-ukraine-war-list-of-key-events-day-1128",
    "formatted_content": "Here is the roundup of key events as of Friday, March 28.\n\n## Fighting\n\n- Kyiv’s air force said it shot down 42 of the 85 Russian drones launched at Ukraine in an overnight attack, including a Russian Iskander-M ballistic missile attack. More than 20 people were injured in the attacks, with residential buildings and storage facilities left damaged as well.\n- Russia’s FSB security service accused Ukrainian spy agencies of trying to recruit Russian citizens to collect military intelligence under the guise of being RAND Corp employees – a United States-based think tank.\n- Russia has handed over five children to Ukraine amid Qatar’s mediation efforts to return children separated from their families due to the ongoing war.\n- After visiting Ukraine’s northeastern Sumy region, Kyiv’s top general Oleksandr Syrskii said Russian forces were intensifying their attacks in the area, but that the Ukrainian military was conducting defence and assault operations to prevent the army from advancing into Ukraine.\n- Russia’s Ministry of Defence accused Ukraine of attacking energy facilities with drones and artillery in the Russian border region of Bryansk, Kursk, and the Moscow-annexed Crimea, despite a mutually agreed moratorium between Ukraine and Russia on such strikes.\n- Ukraine’s army denied the allegations, and a spokesperson from Kyiv’s Ministry of Foreign Affairs said neither Ukraine nor Russia had attacked each other’s energy facilities since March 25.\n- Russian shelling killed two people and partially disrupted the power supply to southern Ukraine’s Kherson, The Associated Press news agency reports, citing a local official.\n\n## Ceasefire\n\n- French Foreign Minister Jean-Noel Barrot, during a visit to China, said Beijing and Paris should coordinate in promoting peace in Ukraine and that China could play a role in convincing Russia to come to the table in good faith.\n- The United Kingdom’s Prime Minister Keith Starmer branded Russian President Vladimir Putin’s promises as “hollow” regarding a ceasefire with Ukraine and accused Putin of playing games with the agreed naval ceasefire in the Black Sea.\n- Putin suggested that as part of the peace process, Ukraine be placed under the temporary “administration” of the United Nations and other countries until elections are held.\n- Kremlin Foreign Ministry spokeswoman Maria Zakharova accused France and the UK of planning a “military intervention in Ukraine” disguised as a peacekeeping mission. She warned such attempts could lead to a military clash between Russia and NATO.\n- Some 30 leaders of the “coalition of the willing” countries met with Ukrainian President Volodymyr Zelenskyy in Paris to discuss strengthening Kyiv’s position and assessing how the coalition could be involved if a peace deal is struck with Russia.\n- The summit discussed deploying European soldiers to Ukraine, although some countries were more keen than others. The countries also agreed it was not the time to relieve Russia of sanctions, but to intensify them further.\n- President Zelenskyy warned the meeting of “dangerous signals” from Saudi Arabia regarding the possible lifting of Russian sanctions.\n- French President Macron said that London and Paris were working on sending “assurance troops” to Ukraine after a potential future peace deal, even if the idea was not approved by all European countries.\n- At the event, Czech Prime Minister Petr Fiala said his country’s initiative to supply ammunition to Ukraine in 2025 would match last year’s supply. Last year, the Czech government provided Ukraine with 1.5 million artillery rounds, including 500,000 units of 155-millimetre shells, the Czech Defence Ministry said.\n\n## Politics and Diplomacy\n\n- South Korea’s military said that North Korea has sent some 3,000 more soldiers to Russia this year, while continuing to supply the Kremlin with missiles, artillery and ammunition to help Moscow in its war against Kyiv.\n- Russia’s Deputy Foreign Minister Sergei Ryabkov said Moscow and Washington are just in the early days of a long and difficult process to restore ties and that it would be premature to draw “far-reaching conclusions” about Russia-US relations so soon.\n- According to Russian state news agency TASS, Ryabkov also said it is too early for Russia to reopen strategic nuclear stability talks with the US.\n- Zelenskyy accused the US of “constantly” changing the terms of the proposed minerals deal signed with his country. However, he said he did not want the US to think Kyiv was against the deal."
  },
  {
    "title": "Ukraine’s women wage war on Russia as mothers, breadwinners and soldiers | News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/31/ukraines-women-wage-war-on-russia-as-mothers-breadwinners-and-soldiers",
    "formatted_content": "Last summer, Kateryna Zarembo gave up an academic career in political science to volunteer as a paramedic on Ukraine’s front lines.\nShe served in rotations lasting two or four weeks, allowing her time to raise her four children aged three to 12. Weeks after United States President Donald Trump’s inauguration, she decided to enlist.\n“I think what Donald Trump is doing right now is not just retreating from Europe. It is actually, possibly harming Ukraine in the battle against Russia. It is actually creating an autocracy in real time,” she said.\nIt was, for Zarembo, a “reminder of our absolutely, existentially crucial self-reliance”.\n“I was thinking, the future of Ukraine is in the hands of Ukraine’s army, and that’s why I have to be part of the professional community, not just a volunteer,” she told Al Jazeera.\nZarembo’s Hospitallers Medical Battalion, which gives the wounded their first pre-hospital treatment a few kilometres from the line of contact, and evacuates them, consists mostly of women and is an example of how they are playing a growing role in Ukraine’s defence.\nWomen in Ukraine’s 900,000-strong armed forces have climbed from 52,000 at the start of Russia’s full-scale invasion, more than three years ago, to more than 70,000 today.\nMore than 20,000 are in combat roles, and 5,500 are fighting in the trenches.\n“We don’t have compulsory conscription for women. All joined voluntarily for different reasons,” parliamentarian Yevheniia Kravchuk told Al Jazeera. “Some come from military families. I know one who stepped in after her father was killed and others do it for a brother killed, for revenge.”\nZarembo’s family demonstrates how the war is gradually consuming all of Ukrainian society.\nHer husband is now a military technology contractor to the government.\nHer children understand there is always the danger a Russian drone could slip past electronic jammers to where Zarembo treats wounded soldiers.\n“Those who are smaller, the three- and five-year-olds, they just cling to my legs, and don’t want to hear about [my] going,” she said. “And the bigger ones who understand more, they worry and they say that they will miss me, and also kind of protest in their own way.”\nThe Orobets household’s perspective on the future is similarly transformed.\nLesya Orobets’ husband is fighting on the front lines, leaving her to run the family engineering business.\n“His salary we donated to his regiment, to his cause,” she explained to Al Jazeera.\nDuring a leave of absence a few months ago, the parents gathered their two teenage daughters around the kitchen table.\n“We were discussing their future professions, and we came up with the suggestion that besides a civilian profession everyone should choose for themselves, they also need to have some military skills, depending on their talents and their interest,” Orobets said.\n“It looks like the future decade would probably be the decade of wars. And in order to be able to protect your country and yourself, you have to be useful no matter the gender.”\nBoth girls have been learning how to shoot from an early age. The eldest is thinking of becoming an aerospace engineer.\nA decade ago, she would not have been able to do that.\nOfficial records show that when Russia annexed Crimea and sent troops into eastern Ukraine in 2014, women played only supporting roles.\n“In 2014 … women who wanted to take combat positions as snipers and [operating] grenade launchers could not officially hold these positions, so they were put down as cooks and medics but were actually doing the combat role,” said Kravchuk, the parliamentarian. “They called themselves ‘the invisible battalion’. It took years to change that.”\nIn 2017, women were made eligible for combat roles and all ranks of the military, elevating them above menial tasks that carried the lowest pay, rank and status.\n“That was not just opening new opportunities for women, but naming them by … posts they were actually fulfilling,” said Orobets.\nDays before Russia’s full-scale invasion began, the parliament, Verkhovna Rada, expanded the list of professions whose female employees had to register with the armed forces for possible conscription. A thousand women enlisted immediately.\nToday, women serve as snipers, drone operators, fighter pilots, and artillery operators, in special operations and in air defence. Some 1,500 have received medals. Five have received the highest honour, the Hero of Ukraine medal.\nThe recognition has led to changing perceptions of women’s roles.\nOn November 17, Nataliya Grabarchuk became an overnight hero when, on her first day as an anti-aircraft gunner, she destroyed a Russian cruise missile using a Man-Portable Air Defence System (MANPADS).\nOrobets founded The Price of Freedom, an NGO that designed Sky Shield, a proposed air defence umbrella for Ukraine enlisting Ukrainian and European air forces.\nWomen’s growing role in intelligence, national security and defence has also been accompanied by their growing role in governance, said Olena Tregub, the head of Ukraine’s Anticorruption Commission.\nShe rattled off a list of transparency bodies headed by women – including the Military Ombudsman, the anticorruption task force within the Ministry of Defence, and the Ministry of Strategic Industries responsible for defence production.\n“All these women came during war,” Tregub said, and were helping direct resources where they needed to go.\nWomen also became the visible international advocates for weapons and financial aid at the request of former commander in chief Valerii Zaluzhnyi, because conscription for them was voluntary and they were allowed to leave the country, said Tregub.\nWomen have also shouldered a growing burden in keeping the economy afloat.\nThe government pays to re-qualify women in a list of professions like truck drivers, tractor drivers, trolley drivers, and anything connected to construction such as electrical and plumbing work, said Kravchuk.\nLast year, women qualified for 61 percent of loans to open small and medium-sized enterprises in Ukraine, and established 59 percent of them.\nWomen’s advance in all these roles is connected to the perception that all of society is at stake.\n“We fight against our children being deported to Russia and being raised as Russians, and we fight against our women being raped and killed. And of course, against everyone being killed,” said Zarembo, referring respectively to Ukrainian allegations of the forcible transfer of children to Russia without familial consent and of Moscow’s forces committing sexual assault and other war crimes.\n“It’s not about [re-establishing the] borders of 1991 … If Ukraine stops fighting, it means there is no Ukraine left any more.”"
  },
  {
    "title": "Trump says Ukraine started the war that's killing its citizens. What are the facts? | AP News",
    "url": "https://apnews.com/article/ukraine-russia-trump-war-zelenskyy-putin-7fe8c0c80b4e93e3bc079c621a44e8bb",
    "formatted_content": "## Ukraine ‘should have never started it’\n\n## Ukraine should hold elections\n\n## Zelenskyy’s support at rock bottom?\n\n## Millions of deaths\n\n## Missing U.S. aid?\n\n## WHAT TRUMP SAID:\n\n## THE FACTS:\n\nKYIV, Ukraine (AP) — President Donald Trump this week falsely blamed Ukraine for starting the war that has cost tens of thousands of Ukrainian lives, causing outrage and alarm in a country that has spent nearly three years fighting back a much larger Russian military.\n\nTrump called Ukrainian President Volodymyr Zelenskyy “ a dictator without elections” and claimed his support among voters was near rock-bottom.\n\nZelenskyy said Wednesday that the disinformation is coming from Russia, and some of what Trump has said does echo Russia’s own narrative of the conflict.\n\nHere’s a look at some of Trump’s statements:\n\nUkraine’s President Volodymyr Zelensky gives a press conference in Kyiv, Wednesday, Feb. 19, 2025. (Tetiana Dzhafarova/Pool Photo via AP)\n\nUkraine’s President Volodymyr Zelensky gives a press conference in Kyiv, Wednesday, Feb. 19, 2025. (Tetiana Dzhafarova/Pool Photo via AP)\n\nRescuers and volunteers are working at Ohmatdyt Children’s Hospital that was strongly damaged during a Russian missile strike in Kyiv, Ukraine, on July 08, 2024, amid the Russian invasion. Russia is massively attacking Ukraine with missiles on July 08. (Photo by Maxym Marusenko/NurPhoto via AP)\n\nRescuers and volunteers are working at Ohmatdyt Children’s Hospital that was strongly damaged during a Russian missile strike in Kyiv, Ukraine, on July 08, 2024, amid the Russian invasion. Russia is massively attacking Ukraine with missiles on July 08. (Photo by Maxym Marusenko/NurPhoto via AP)\n\nWHAT TRUMP SAID: “You’ve been there for three years. You should have ended it.... You should have never started it. You could have made a deal.”\n\nTHE FACTS: Russia’s army crossed the border on Feb. 24, 2022, in an all-out invasion that Putin sought to justify by falsely saying it was needed to protect Russian-speaking civilians in eastern Ukraine and prevent the country from joining NATO.\n\nBut Russia’s aggression against Ukraine didn’t start then. In 2014, Russian President Vladimir Putin saw signs that Ukraine was pulling away from Russia’s sphere of influence, seeking alliances with western European nations.\n\nPutin illegally annexed the Crimean Peninsula and started an armed aggression in the eastern Ukrainian region of Donbas that grew into a long-running conflict that left thousands dead.\n\nThat conflict simmered until 2022, when Putin ordered what he called military exercises along Ukraine’s borders. He told the world that the roughly 150,000 soldiers that he had amassed would not be used to invade Ukraine. But in the early hours of Feb. 24, Russia launched widespread airstrikes and soldiers began pouring over the border.\n\nWHAT TRUMP SAID: “We have a situation where we haven’t had elections in Ukraine, where we have martial law,” Trump said in Mar-a-Lago, adding on Wednesday in a post on social media: “A Dictator without Elections, Zelenskyy better move fast or he is not going to have a Country left.”\n\nTHE FACTS: Zelenskyy was elected to a five-year term in 2019, and the next presidential elections had been scheduled for spring 2024. But Ukrainian law prohibits parliamentary or presidential elections during a state of martial law, so Zelenskyy has remained in office. He has said he believes elections will be held in Ukraine after martial law is lifted. The country would need to amend the law if it decided to hold a vote.\n\nThere are numerous factors that, according to Ukraine’s government, “would render it literally impossible to ensure a fair electoral process in the circumstances of a total war.”\n\nAccording to the United Nations’ refugee agency, some 6.9 million Ukrainian refugees have been registered worldwide since February 2022. Of those, millions remain outside the country due to the war. It would be nearly impossible for all of those who have been displaced to participate in an election, potentially robbing millions of their right to vote.\n\nFurthermore, around 800,000 soldiers are currently serving in the Ukrainian Armed Forces as they struggle to contain Russian advances. An election would necessitate pulling soldiers off the front lines to vote, weakening Ukraine’s military position. Additionally, those fighting would be unable to run for office, a right that is guaranteed to them by Ukrainian law.\n\nMany Ukrainians are living in areas under Russian occupation, essentially precluding their participation in any electoral process. And since Russia continues to regularly strike both military and civilian targets across the country, packing millions of citizens into crowded polling places could create additional danger.\n\nWHAT TRUMP SAID: “The leader in Ukraine, I mean, I hate to say it, but he’s down at 4% approval rating.”\n\nTHE FACTS: Zelenskyy “retains a fairly high level of public trust” — about 57 percent - according to a report released Wednesday by the Kyiv International Institute of Sociology.\n\nSpeaking in Kyiv on Wednesday, Zelenskyy said the number given by Trump, for which the president cited no sources, was “disinformation” that originated in Russia, and that the president “unfortunately lives in this disinformation space.”\n\nZelenskyy said he will ask pollsters in the coming weeks to conduct surveys on the public’s trust in him and share the results with the Trump administration.\n\nOleksii Yukov’s team members offload the bodies of Russian soldiers they’ve collected from the frontline in the Sloviansk region, Ukraine, Tuesday, Oct. 24, 2023. Yukov and his team retrieve bodies from the frontline to barter for Ukrainian bodies in periodic exchanges of war dead. (AP Photo/Bram Janssen)\n\nOleksii Yukov’s team members offload the bodies of Russian soldiers they’ve collected from the frontline in the Sloviansk region, Ukraine, Tuesday, Oct. 24, 2023. Yukov and his team retrieve bodies from the frontline to barter for Ukrainian bodies in periodic exchanges of war dead. (AP Photo/Bram Janssen)\n\nWHAT TRUMP SAID: “When you see what’s taken place in Ukraine with millions of people killed, including the soldiers, millions of people killed, a big percentage of their cities knocked down to the ground, I don’t know how anybody even lives there.”\n\nTHE FACTS: No estimates by any reputable analysis place deaths near the millions.\n\nWhile exact figures of the number of deaths are unknown, Zelenskyy said earlier this month that over 46,000 Ukrainian soldiers had been killed since the start of the full-scale war in February 2022. He has also said that “tens of thousands of civilians” had been killed in occupied areas of Ukraine, but that no exact figures would be available until the war was over. The most recent data from the Russian Defense Ministry, published in January 2023, pointed to just over 6,000 military deaths, although reports from U.S. and U.K. officials put that number significantly higher.\n\n“President Zelenskyy said last week that he doesn’t know where half of the money is that we gave him. Well, we gave them, I believe, $350 billion.”\n\nAccording to a U.S interagency oversight group that tracks aid to Ukraine, the U.S. Congress has appropriated around $183 billion in assistance to Kyiv since the start of Russia’s invasion on Feb. 24, 2022 — a little more than half of Trump’s claim of $350 billion.\n\nIn an interview with The Associated Press on Feb. 1, Zelenskyy said some $70 billion worth of military aid had been delivered to Ukraine, and that another $6 billion had come in the form of things like training programs, humanitarian relief and economic and infrastructure recovery.\n\nAs for the rest of the assistance approved by the U.S. Congress, Zelenskyy said it never reached Ukraine. “I don’t know where all this money is,” he said.\n\nZelenskyy’s statement led to a flurry of spurious claims in some news media, amplified by Trump and Elon Musk, that some $100 billion of U.S. assistance had disappeared somewhere in Ukraine.\n\nBut crucially, aid appropriations aren’t necessarily spent in the country they target. Much of the Ukraine aid approved by Congress is spent in the U.S. to boost the domestic defense industry by replacing old equipment given to Ukraine. It’s also used to supply Kyiv with new U.S.-manufactured weaponry.\n\nAccording to a paper from the Center for Strategic and International Studies, a Washington-based bipartisan, nonprofit policy research organization, other funds have financed a surge of U.S. troops into allied countries in Europe in response to Russia’s invasion. Still others have gone to assisting Ukrainian refugees or enforcing sanctions against Russia — all uses that would never see funding cross over Ukraine’s borders.\n\nTrump’s own envoy for Russia and Ukraine, Keith Kellogg, said in an interview with broadcaster Newsmax in early February that U.S. officials keep careful tabs on how and where aid appropriations are used."
  },
  {
    "title": "US refuses to blame Russia for Ukraine war, splitting with European allies in UN votes | AP News",
    "url": "https://apnews.com/article/un-russia-ukraine-war-resolution-trump-zelenskyy-cde221e5850196776525403e788c272c",
    "formatted_content": "## ___\n\nUNITED NATIONS (AP) — In a dramatic shift in transatlantic relations under President Donald Trump, the United States split with its European allies by refusing to blame Russia for its invasion of Ukraine in votes on three U.N. resolutions Monday seeking an end to the three-year war.\n\nThe growing divide follows Trump’s decision to open direct negotiations with Russia on ending the war, dismaying Ukraine and its European supporters by excluding them from the preliminary talks last week.\n\nIn the U.N. General Assembly, the U.S. joined Russia in voting against a Europe-backed Ukrainian resolution that calls out Moscow’s aggression and demands an immediate withdrawal of Russian troops.\n\nThe U.S. then abstained from voting on its own competing resolution after Europeans. led by France, succeeded in amending it to make clear Russia was the aggressor. The voting was taking place on the third anniversary of Russia’s invasion and as Trump was hosting French President Emmanuel Macron in Washington.\n\nIt was a major setback for the Trump administration in the 193-member world body, whose resolutions are not legally binding but are seen as a barometer of world opinion.\n\nThe U.S. then pushed for a vote on its original draft in the more powerful U.N. Security Council, where resolutions are legally binding and it has veto power along with Russia, China, Britain and France. The vote in the 15-member council was 10-0 with five European countries abstaining – Britain, France, Denmark, Greece and Slovenia.\n\nThe dueling resolutions also reflect the tensions that have emerged between the U.S. and Ukraine. In escalating rhetoric, Trump has called Ukrainian President Volodymyr Zelenskyy a “dictator” for not holding elections during wartime, when much of Ukraine is under Russian occupation, its soldiers are on the frontlines and the country is under martial law.\n\nTrump also has falsely accused Kyiv of starting the war and warned that he “better move fast” to negotiate an end to the conflict or risk not having a nation to lead. Zelenskyy responded by saying Trump was living in a Russian-made “disinformation space.”\n\nIn a whirlwind of diplomacy, Trump’s meeting with Macron will be followed by a visit on Thursday from British Prime Minister Keir Starmer, key U.S. allies who were in lockstep with Washington on Ukraine just over a month ago. They now find themselves on opposite sides on the best pathway for the UN to call for an end to the war.\n\nThe General Assembly voted 93-18 with 65 abstentions to approve the Ukrainian resolution. The result showed some diminished support for Ukraine, because previous assembly votes saw more than 140 nations condemn Russia’s aggression and demand an immediate withdrawal.\n\nThe assembly then turned to the U.S.-drafted resolution, which acknowledges “the tragic loss of life throughout the Russia-Ukraine conflict” and “implores a swift end to the conflict and further urges a lasting peace between Ukraine and Russia,” but never mentions Moscow’s aggression.\n\nIn a surprise move, France proposed three amendments, which add that the conflict was the result of a “full-scale invasion of Ukraine by the Russian Federation.” The amendments reaffirm the assembly’s commitment to Ukraine’s sovereignty, independence, unity and territorial integrity, and call for peace that respects the U.N. Charter.\n\nRussia proposed an amendment calling for “root causes” of the conflict to be addressed.\n\nAll the amendments were approved and the resolution passed 93-8 with 73 abstentions, with Ukraine voting “yes,” the U.S. abstaining, and Russia voting “no.”\n\nBoth assembly resolutions were supported by U.S. allies in Asia, including Japan, South Korea, Australia and New Zealand, its neighbors Canada and Mexico and European countries, with the exception of Hungary.\n\nUkrainian Deputy Foreign Minister Mariana Betsa said her country is exercising its “inherent right to self-defense” following Russia’s invasion, which violates the U.N. Charter’s requirement that countries respect the sovereignty and territorial integrity of other nations.\n\n“As we mark three years of this devastation — Russia’s full invasion against Ukraine — we call on all nations to stand firm and to take … the side of the Charter, the side of humanity and the side of just and lasting peace, peace through strength,” she said.\n\nTrump has often stated his commitment to bringing “peace through strength.”\n\nBritain’s U.N. Ambassador Barbara Woodward warned the council, “If Russia is allowed to win, we will live in a world where might is right, where borders can be redrawn by force, where aggressors think they can act with impunity.”\n\nDenmark’s Lotte Machon, a deputy foreign minister, stressed that in peace negotiations, “nothing about Ukraine without Ukraine, nothing about European security without Europe.”\n\nU.S. deputy ambassador Dorothy Shea, meanwhile, said multiple previous U.N. resolutions condemning Russia and demanding the withdrawal of Russian troops “have failed to stop the war,” which “has now dragged on for far too long and at far too terrible a cost to the people in Ukraine and Russia and beyond.”\n\n“What we need is a resolution marking the commitment from all U.N. member states to bring a durable end to the war,” Shea said before the vote.\n\nIn the Security Council, Russia used its veto to prevent European amendments to the U.S. resolution, which is legally blinding but essentially toothless. It only operative paragraph “Implores a swift end to the conflict and further urges a lasting peace between Ukraine and Russia.”\n\nShea called it “a first step, but a crucial one,” saying it “puts us on the path to peace.”\n\nThe General Assembly has become the most important U.N. body on Ukraine because the Security Council has been paralyzed by Russia’s veto power. It has approved half a dozen resolutions since Russian forces stormed across the border on Feb. 24, 2022.\n\nThe Ukrainian resolution adopted Monday recalls the need to implement the previous resolutions, singling out the demand that Russia “immediately, completely and unconditionally withdraw all of its military forces from the territory of Ukraine.”\n\nThe resolution reaffirms the assembly’s commitment to Ukraine’s sovereignty and also “that no territorial acquisition resulting from the threat or use of force shall be recognized as legal.”\n\nIt calls for “a de-escalation, an early cessation of hostilities and a peaceful resolution of the war against Ukraine” and it reiterates “the urgent need to end the war this year.”\n\nAP Diplomatic Writer Matthew Lee in Washington contributed to this report."
  },
  {
    "title": "Chinese official visits Moscow as Russia and Ukraine discuss Trump's proposal to end war | AP News",
    "url": "https://apnews.com/article/china-russia-ukraine-war-trump-europe-dcec45198b64234f3a71c8ce805c0065",
    "formatted_content": "BEIJING (AP) — Chinese Foreign Minister Wang Yi traveled to Moscow on Monday for talks with his counterpart, Sergei Lavrov, as Russia and Ukraine discuss U.S. President Donald Trump’s proposal to end the 3-year-old war.\n\nWang is scheduled to meet with Lavrov on Tuesday, days after Ukraine and Russia agreed in principle to a limited ceasefire after Trump spoke with the two countries’ leaders. It remains to be seen when such a truce might take effect, how long it might last and what targets would be off-limits.\n\nTrump lashed out at both Vladimir Putin and Volodymyr Zelenskyy on Sunday, expressing frustration with the Russian and Ukrainian leaders. Although Trump insisted to reporters that “we’re making a lot of progress,” he acknowledged that “there’s tremendous hatred” between the two men. He said he was “angry, pissed off” that Putin questioned Zelenskyy’s credibility.\n\nChinese Foreign Ministry spokesperson Guo Jiakun, in comments consistent with China’s position, emphasized Beijing’s assertions of neutrality in the Ukraine conflict.\n\n“We always believe that dialogue and negotiation are the only viable way out of the crisis. China’s cooperation with Russia does not target a third party and should not be affected by any third party,” Guo told reporters at a daily briefing.\n\nChina did not mention Ukraine in its announcement of Wang’s trip, saying only that the two countries “continue to deepen back-to-back strategic coordination and expand practical cooperation across various fields,” as well as “upholding the basic norms governing international relations.”\n\n“The Chinese side is ready to take this visit as an opportunity to work with the Russian side... on international and regional issues of common concern,” a Foreign Ministry spokesperson was quoted as saying.\n\nChina has provided strong diplomatic support for Russia in the more than three years since it launched a full-scale invasion of its neighbor, along with an economic lifeline through the trade in energy and consumer goods. However, it has not knowingly provided Russia with weapons or military expertise and has put forward a vague peace plan that was swiftly dismissed by most observers.\n\nMeanwhile, North Korean leader Kim Jong Un expressed his unwavering support for Russia’s war in Ukraine during a meeting with a top Russian security official in Pyongyang on Friday. That came after South Korean intelligence assessment in late February that North Korea had likely sent additional troops to Russia after its forces suffered heavy casualties fighting Ukrainian forces."
  },
  {
    "title": "A Kremlin official says Russia sees efforts to end Ukraine war as a drawn-out process | AP News",
    "url": "https://apnews.com/article/russia-ukraine-war-trump-truce-putin-zelenskyy-9eb7e46ca4bd7a970b0837e94745f6ba",
    "formatted_content": "## ___\n\nRussia views efforts to end its three-year war with Ukraine as “a drawn-out process,” a Kremlin spokesman said Monday, after U.S. President Donald Trump expressed frustration with the two countries’ leaders as he tries to bring about a truce.\n\n“We are working to implement some ideas in connection with the Ukrainian settlement. This work is ongoing,” Dmitry Peskov said in a conference call with reporters.\n\n“There is nothing concrete yet that we could and should announce. This is a drawn-out process because of the difficulty of its substance,” the Kremlin spokesman said when asked about Trump’s anger at Russian President Vladimir Putin’s comments dismissing Ukrainian President Volodymyr Zelenskyy’s legitimacy to negotiate a deal.\n\nRussia has effectively rejected a U.S. proposal for a full and immediate 30-day halt in the fighting. The feasibility of a partial ceasefire on the Black Sea, used by both countries to transport shipments of grain and other cargo, was cast into doubt after Kremlin negotiators imposed far-reaching conditions.\n\nAP Washington correspondent Sagar Meghani reports Russia describes efforts to end its war with Ukraine as a ‘drawn-out process’ after criticism from President Trump.\n\nTrump promised during last year’s U.S. election campaign that he would bring Europe’s biggest conflict since World War II to a swift conclusion.\n\nPeskov didn’t directly address Trump’s criticism of Putin on Sunday, when he said he was “angry, pissed off” that Putin had questioned Zelenskyy’s credibility as leader.\n\nBut the spokesman said that Putin “remains absolutely open to contacts” with the U.S. president and was ready to speak to him.\n\nBoth countries are preparing for a spring-summer campaign on the battlefield, analysts and Ukrainian and Western officials say.\n\nPutin on Monday ordered a regular bi-annual call-up intended to draft 160,000 conscripts for an one-year tour of compulsory military service. Russian authorities say that the troops deployed to Ukraine only include volunteers who signed contracts with the military and conscripts aren’t sent to the frontline. Some draftees, however, fought and were taken prisoners when the Ukrainian military launched an incursion into Russia’s Kursk region in August.\n\nZelenskyy said late Sunday that there has been no reduction in Russia’s attacks as it drives on with its invasion of Ukraine that began in February 2022.\n\n“The geography and brutality of Russian strikes, not just occasionally, but literally every day and night, show that Putin couldn’t care less about diplomacy,” Zelenskyy said in his daily address.\n\n“And almost every day, in response to this proposal, there are Russian drones, bombs, artillery shelling, and ballistic strikes,” he said.\n\nHe urged further international pressure on Moscow to compel Russia to negotiate, including new sanctions.\n\nThe European Union’s foreign policy chief Kaja Kallas picked up on that theme at a meeting of some of the bloc’s top diplomats in Madrid on Monday.\n\n“Russia is playing games and not really wanting peace,” Kallas told reporters ahead of the meeting, which was due to discuss the war. “So our question is, how can we put more pressure on Russia.”\n\nTrump said he would consider imposing further sanctions on Russia, which already faces steep financial penalties, and using tariffs to undermine its oil exports.\n\nKharkiv, Ukraine’s second-largest city, came under another Russian drone attack overnight, injuring three people, the Ukrainian Interior Ministry said Monday.\n\nRussia also fired two ballistic missiles and 131 Shahed and decoy drones, the Ukrainian air force said.\n\nMeanwhile, Russia’s Defense Ministry said air defenses shot down 66 Ukrainian drones early Monday over three Russian regions.\n\n“The continuing attacks by the Ukrainian armed forces on Russia’s energy facilities show the complete lack of respect for any obligations related to the settlement of the conflict in Ukraine by the Kyiv regime,” the ministry said in a statement.\n\nFollow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"
  },
  {
    "title": "Ukraine hasn't held elections since Russia's full-scale invasion. Here's why. | AP News",
    "url": "https://apnews.com/article/ukraine-elections-timing-war-zelenskyy-critics-f4f810d810ffc3cf4c81b241bbd76dac",
    "formatted_content": "## Why haven’t there been elections in Ukraine?\n\n## What has Zelenskyy said about elections in the future?\n\n## Who are Zelenskyy’s key political rivals?\n\nKYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy would have had to face a reelection campaign in the spring of 2024 if it had not been for Russia’s full-scale invasion. Now, the question of the legitimacy of his rule is being weaponized by Russia.\n\nU.S. President Donald Trump also called Zelenskyy a “dictator without elections,” echoing Russian propaganda, but later appeared to rescind the comment by denying he said it.\n\nIt is not the first time Western officials have expressed concern about Zelenskyy’s tenure as president especially under martial law when his office has consolidated control of government policy to sustain and direct the war effort. Western officials have also privately expressed their preference for elections to take place in the last year, before Trump assumed office, according to lawmakers who maintain contacts with their European counterparts.\n\nZelenskyy has declined to hold polls until a ceasefire is declared in line with Ukrainian law and his Ukrainians largely support that decision.\n\nHere is a look at why Ukraine has not been able to hold elections after the full-scale invasion:\n\nPutin’s invasion of Ukraine triggered martial law in the country, which effectively postponed presidential and parliamentary elections. Facing an existential war, with a fifth of the country under occupation and millions of Ukrainians evacuated to third countries, holding polls was simply not logistically feasible.\n\nUkraine’s natural election period for its parliament was slated for October 2023 and Zelenskyy’s five-year term was up in May 2024.\n\nMartial law is established in the Ukrainian constitution and another law states elections can’t be held when martial law is in place, which has been the case since the February 2022 invasion.\n\nZelenskyy’s position is that elections will take place once there is a ceasefire with Russia, at which point martial law will be lifted.\n\nRussia, meanwhile, has used his remaining in power after his expired term as a tool to cast him as an illegitimate leader of Ukraine.\n\nZelenskyy has also said he would step down as president if Ukraine was granted NATO membership.\n\nHolding elections while the war is ongoing would be counterproductive and weaken Ukraine at a critical juncture, Zelenskyy has said. It would be difficult to find a way for Ukrainian soldiers engaged in pitched battles to cast a vote, as well as the many millions of Ukrainians living abroad because of the war. Then there is the question of Ukrainians living in occupied Russian territory.\n\nTo back the president, Ukraine’s parliament passed a resolution affirming the legitimacy of Zelenskyy as president and reiterated elections are not possible until after the war ends.\n\nHolding elections in the middle of a war would also sow division in Ukrainian society at a time when the country should be united against Russia, Zelenskyy has also said.\n\nThe one potential candidate widely expected to beat Zelenskyy in polls were he to run is former Army chief Valery Zaluzhny, the current Ukrainian ambassador to Britain.\n\nPetro Poroshenko is a key political rival of Zelenskyy’s and the leader of the largest opposition party. He is unlikely to run again, analysts said, but his backing of a particular candidate would be consequential for elections."
  }
]