[
  {
    "title": "Decoding the Ukraine ceasefire plan line-by-line",
    "url": "https://www.bbc.com/news/articles/c5y42125239o",
    "formatted_content": "Hours of talks in Saudi Arabia on Tuesday ended with a joint US-Ukraine statement backing an American-proposed 30-day ceasefire in the war with Russia.\n\nTrump administration officials see this as a major breakthrough towards the foreign policy goals of a leader who campaigned on a promise to end the war.\n\nFor Ukraine, the joint announcement amounts to a critical reprieve for President Volodymyr Zelensky after a humiliating attack in the Oval Office a fortnight ago by Trump and Vice-President JD Vance.\n\nFor Moscow, it shifts the onus to them, while the war itself intensifies.\n\nBut so far only one side in the war - the one dependent on the Americans - has signed up. And the proposal is only eight paragraphs long, with meagre details beyond the desire to rapidly press ahead.\n\nSo does it make a ceasefire plausible? And if so, can it end the war after Russia's full-scale invasion three years ago in a just and sustainable way, and on terms that keep the region and the world safe?\n\nStatement: \"Ukraine expressed readiness to accept the U.S. proposal to enact an immediate, interim 30-day ceasefire, which can be extended by mutual agreement of the parties, and which is subject to acceptance and concurrent implementation by the Russian Federation. The United States will communicate to Russia that Russian reciprocity is the key to achieving peace.\"\n\nAnalysis: The key word here is \"immediate,\" which doesn't leave any doubt: Trump wants the guns to fall silent now. His sense of urgency, however, has often led to concerns in Europe.\n\nMany fear that rushing the desired outcome without first working out the terms takes the military pressure off Moscow as the invading power and could lead to a truce being exploited.\n\nThey argue it empowers the occupying force.\n\nThe fear is of ultimately leading Ukraine into an effective surrender. The theory is that Russia - the bigger, more populous and militarily more self-sufficient power - could use a truce without first establishing concessions to consolidate its forces, string out a negotiation process and wait to see what happens politically for Trump during his term while it holds on to everything it seized; and even then try to take more ground, building on its current occupation and potentially using a fracture in the Western alliance to threaten more of Europe.\n\nThe process of negotiating terms before a ceasefire in conflicts can be important to ensure the sides convert current military threats into meaningful strategic gains.\n\nZelensky has previously tried to persuade the Americans that Russian President Vladimir Putin cannot be trusted, evidenced by the fact he broke the European-backed Minsk agreements after seizing Ukrainian territory in 2014.\n\nTrump dismisses these concerns, saying there will be security for Ukraine, but without saying how this will be assured. He has said Putin will be deterred and is in a difficult position with \"no choice\" but to make a deal for reasons that \"only I know\".\n\nRubio said on Tuesday the US delegation had substantive discussions with the Ukrainians on a permanent end to the war, including \"what type of guarantees they're going to have for their long-term security and prosperity\", but again didn't elaborate.\n\nStatement: \"The United States will immediately lift the pause on intelligence sharing and resume security assistance to Ukraine.\"\n\nAnalysis: This is the big win for Zelensky in this agreement and sees US weapons supplies being delivered at a rate of around $2bn (£1.5bn)-worth a month, restored.\n\nCritically, it also means Washington will once again share its intelligence data and satellite pictures with Kyiv, which helps it target Russian positions. The White House said it suspended this aid because it felt Zelensky wasn't \"committed\" to Trump's peace plan.\n\nThe Ukrainian leader had tried to voice his concerns based on some of the reasons above when he was ejected from the Oval Office. His reservations are likely being set aside while he welcomes the agreement in this form - a necessary price to pay to restore US security assistance.\n\nStatement: \"Both delegations agreed to name their negotiating teams and immediately begin negotiations toward an enduring peace that provides for Ukraine's long-term security. The United States committed to discussing these specific proposals with representatives from Russia. The Ukrainian delegation reiterated that European partners shall be involved in the peace process.\"\n\nAnalysis: This paragraph is confusing because it's unclear whether it refers to negotiations between Ukraine and the US on establishing any security guarantees for Ukraine, or if it refers to negotiations between Ukraine and Russia to permanently end the war once a ceasefire is under way.\n\nIf it is the former, it appears to suggest that Washington and Kyiv will hammer out any decisions on how to back up Ukraine's security and deter Russian breaches of a truce, and the US will then discuss these with Moscow.\n\nBut it is all a far cry from the kind of security guarantee Zelensky ultimately wanted, which was membership of Nato, which Trump has said won't happen - a major long-term concession to Moscow's demands.\n\nThe paragraph also contains a vague and lukewarm reference to the idea of European peacekeepers, which have been pitched by the UK and France, with the line attributed only to the Ukrainian delegation.\n\nIt's notable that the US appears not to be putting its name to this part after Moscow categorically rejected the idea.\n\nStatement: \"…both countries' presidents agreed to conclude as soon as possible a comprehensive agreement for developing Ukraine's critical mineral resources to expand Ukraine's economy and guarantee Ukraine's long-term prosperity and security.\"\n\nAnalysis: This was the agreement that never got signed after Zelensky was told to leave the White House last month.\n\nIt would give the US a future stake in some of Ukraine's state-owned mineral deposits, as well as oil and gas revenues.\n\nTrump sees it as an effective security guarantee for Ukraine, arguing it would deter Russian re-invasion because American companies would be on the ground.\n\nOpponents point out this is meaningless because US economic presence in Ukraine didn't deter Putin in 2014 or 2022.\n\nStatement: \"The Ukrainian delegation reiterated the Ukrainian people's strong gratitude to President Trump…\"\n\nAnalysis: This is a key line that might help explain Zelenky's rehabilitation in the eyes of the White House.\n\nVance had castigated him in the Oval Office for not thanking Trump, even though the Ukrainian leader has thanked the US dozens of times for its military support.\n\nNow Trump has an official Ukrainian thank you, on a piece of paper meant to make peace."
  },
  {
    "title": "Vladimir Putin sets out conditions for Ukraine ceasefire",
    "url": "https://www.bbc.com/news/articles/cp8l00l4rejo",
    "formatted_content": "Vladimir Putin has said he agrees with the idea of a ceasefire in Ukraine, but that \"questions\" remain about the nature of a truce - as he set out a number of tough conditions for peace.\n\nThe Russian president was responding to a plan for a 30-day ceasefire, which Ukraine agreed to earlier this week following talks with the US.\n\nUkrainian President Volodymyr Zelensky described Putin's response to the plan as \"manipulative\" and called for more sanctions on Russia.\n\nMeanwhile, the US placed further sanctions on Russian oil, gas and banking sectors.\n\nRussian officials said Putin was expected to hold talks on the ceasefire on Thursday evening with US President Donald Trump's special envoy Steve Witkoff, who had flown to Moscow earlier that day.\n\nIt is not clear whether that meeting actually took place. On Friday, Russia's state media quoted the air traffic monitor Flightradar as saying the plane believed to be carrying Witkoff had left Moscow.\n\nMoscow and Washington have not commented on the issue.\n\nLate on Thursday and overnight, both Russia and Ukraine reported new enemy drone attacks.\n\nUkraine said seven people - including children - were injured in the north-eastern city of Kharkiv.\n\nRussia reported a large fire at an oil facility in the southern city of Tuapse.\n\nSpeaking at a news conference in Moscow on Thursday, Putin said of the ceasefire proposal: \"The idea is right - and we support it - but there are questions that we need to discuss.\"\n\nA ceasefire should lead to \"an enduring peace and remove the root causes of this crisis\", Putin said.\n\n\"We need to negotiate with our American colleagues and partners,\" he said. \"Maybe I'll have a call with Donald Trump.\"\n\nPutin added: \"It will be good for the Ukrainian side to achieve a 30-day ceasefire.\n\n\"We are in favour of it, but there are nuances.\"\n\nOne of the areas of contention is Russia's western Kursk region, Putin said, where Ukraine launched a military incursion last August and captured some territory.\n\nHe claimed Russia was fully back in control of Kursk, and said Ukrainian troops there \"have been isolated\".\n\n\"They are trying to leave, but we are in control. Their equipment has been abandoned,\" Putin said.\n\n\"There are two options for Ukrainians in Kursk - surrender or die.\"\n\nUkraine's top commander Oleksandr Syrskyi said a day earlier that Ukrainian troops would hold defensive positions in the Kursk region \"as long as it is expedient and necessary\" despite \"increased\" pressure from Russian forces.\n\nAt Thursday's press conference, Putin also outlined some of his questions over how a ceasefire would work. He asked: \"How will those 30 days be used? For Ukraine to mobilise? Rearm? Train people? Or none of that? Then a question - how will that be controlled?\n\n\"Who will give the order to end the fighting? At what cost? Who decides who has broken any possible ceasefire, over 2,000km? All those questions need meticulous work from both sides. Who polices it?\"\n\nPutin \"doesn't say no directly\", Zelensky said in his nightly video address, but \"in practice, he's preparing a rejection\".\n\nHe added: \"Putin, of course, is afraid to tell President Trump directly that he wants to continue this war, wants to kill Ukrainians.\"\n\nThe Russian leader had set so many pre-conditions \"that nothing will work out at all\", Zelensky said.\n\nAfter Putin's remarks and Zelensky's response, there is now a clear divide between both sides' positions.\n\nUkraine wants a two-stage process: a quick ceasefire and then talks about a longer-term settlement.\n\nRussia believes you cannot separate the two processes and all the issues should be decided in a single deal. Both sides seem content to argue their differences.\n\nUkraine believes it can put pressure on Russia, painting it as a reluctant peacemaker, playing for time. Russia, equally, believes it has a chance now to raise its fundamental concerns, about Nato expansion and Ukraine's sovereignty.\n\nBut this presents a problem for Donald Trump. He has made it clear he wants a quick result, ending the fighting in days.\n\nAnd right now, Putin does not appear to want to play ball.\n\nSpeaking at the White House following Putin's remarks, Trump said he would \"love\" to meet the Russian leader and that he hoped Russia would \"do the right thing\" and agree to the proposed 30-day truce.\n\n\"We'd like to see a ceasefire from Russia,\" he said.\n\nSpeaking earlier at a meeting in the Oval Office with Nato Secretary General Mark Rutte, Trump told reporters he had already discussed specifics with Ukraine.\n\n\"We've been discussing with Ukraine land and pieces of land that would be kept and lost, and all of the other elements of a final agreement,\" Trump said.\n\n\"A lot of the details of a final agreement have actually been discussed.\"\n\nOn the subject of Ukraine joining the Nato military alliance, Trump said \"everybody knows what the answer to that is\".\n\nThe fresh sanctions on Russian oil and gas came as the Trump administration further restricted access to US payment systems, making it harder for other countries to buy Russian oil.\n\nEarlier in the day, Kremlin aide Yuri Ushakov rejected the ceasefire proposal put forward by the US.\n\nOn Wednesday, the Kremlin released a video it said showed Putin visiting Russia's Kursk region, symbolically dressed in military fatigues. Russia later said it recaptured the key town of Sudzha.\n\nRussia launched a full-scale invasion in February 2022, and now controls about 20% of Ukrainian territory.\n\nMore than 95,000 people fighting for Russia's military have been killed in the war, according to data analysed so far and confirmed by the BBC. The actual death toll is believed to be much higher.\n\nRussia's military has not publicly revealed its battlefield casualties since September 2022, when it said 5,937 soldiers had been killed.\n\nUkraine last updated its casualty figures in December 2024, when Zelensky acknowledged 43,000 Ukrainian deaths among soldiers and officers. Western analysts believe this figure to be underestimated."
  },
  {
    "title": "Israel-Gaza conflict: Ceasefire plan back on table",
    "url": "https://www.bbc.com/news/articles/c4g9x0kd4gro",
    "formatted_content": "The Palestinian militant group Hamas says it supports resuming a ceasefire in the Gaza Strip through a proposal put forward by mediators which would see five more hostages released to Israel in exchange for a 50-day truce.\n\nKhalil al-Hayya, the most senior Hamas leader outside Gaza, said the group had approved a draft deal sent by Egyptian and Qatari mediators.\n\nIsraeli Prime Minister Benjamin Netanyahu's office said it had also received the plan, and submitted a \"counter-proposal to the mediators in full co-ordination with the United States\".\n\nIf agreed to, the new limited ceasefire agreement could coincide with the Muslim holiday of Eid al-Fitr which begins on Sunday.\n\nOn Saturday, Netanyahu's office said he had held consultations on the ceasefire proposal from the mediators.\n\nIt said the Israeli counter-offer had been agreed with the US, but did not provide further details.The US has not publicly commented on the issue.\n\nIt comes as Israeli forces launched a ground operation in Rafah and continued air strikes across Gaza Strip after a ceasefire which had come into force on 19 January ended earlier this month. Both sides had been unable to agree to a second phase of the deal after the first ended.\n\nDuring the first phase, Hamas had released 33 hostages. The Iran-backed group is thought to still be holding 59 hostages, although not all are believed to be alive.\n\nHamas had previously insisted on sticking to the original deal - with negotiations to start on a second phase that envisaged the release of all the remaining hostages in return for a complete withdrawal of Israeli forces in Gaza and an end to the war. But those negotiations never started.\n\nIsrael and the US instead proposed that the first phase of the ceasefire - which expired a month ago - should be extended, with no clear guarantee that the war would end.\n\nIsrael accused Hamas of rejecting the extension and on 18 March resumed its military strikes on Gaza.\n\nMore than 900 people across the territory have been killed by Israeli air strikes since then, the Hamas-run health ministry has said.\n\nMeanwhile, the relatives of the remaining hostages have accused Netanyahu of putting hostage lives in danger by breaking the ceasefire.\n\nOne of those hostages, Elkana Bohbot, was shown in a new video posted by Hamas in which he begs for his release.\n\nThe war was triggered when Hamas attacked southern Israel on 7 October 2023, killing about 1,200 people and taking 251 back to Gaza as captives.\n\nIsrael responded with a massive military offensive, which killed more than 50,000 Palestinians, Gaza's Hamas-run health ministry says."
  },
  {
    "title": "Donald Trump 'very angry' with Vladimir Putin over ceasefire negotiations",
    "url": "https://www.bbc.com/news/articles/c20x7z36d56o",
    "formatted_content": "Donald Trump has said he is \"very angry\" and \"pissed off\" with Russian President Vladimir Putin after weeks of attempting to negotiate a ceasefire in Ukraine.\n\nIn an NBC News interview, the US president criticised Putin for attacking Ukrainian President Volodymyr Zelensky's credibility, and threatened to impose a 50% tariff on countries buying Russian oil if he did not agree to a ceasefire.\n\nLast week, Putin suggested the possibility of a UN-run government in Ukraine to organise new elections and then begin peace talks.\n\nTrump's comments mark a change in tone towards Putin. Over the past six weeks, Trump has publicly harangued Zelensky and demanded numerous concessions from Ukraine's president.\n\nOn Sunday, he accused Zelensky of \"trying to back out of\" a deal to share Ukraine's rare minerals with the US and warned of \"big, big problems\" head should that be the case.\n\nIn turn, Trump has flattered Putin and largely given in to the Russian president's demands.\n\nEuropean leaders had worried that Trump was cosying up to Putin.\n\nBut Trump's comments on Sunday appeared to be a departure from that dynamic.\n\nIt is the first time the US has seriously threatened Russia with consequences for dragging its feet in ceasefire negotiations, which would seem to put the diplomatic ball back in Moscow's court.\n\nNBC News reported that, in a 10-minute phone interview, Trump said he was very angry and \"pissed off\" when Putin criticised the credibility of Zelensky's leadership, although the president has himself called Ukraine's leader a dictator and demanded that he hold elections.\n\n\"You could say that I was very angry, pissed off, when... Putin started getting into Zelensky's credibility, because that's not going in the right location,\" Trump said.\n\n\"New leadership means you're not gonna have a deal for a long time,\" he added.\n\nWhen speaking about Putin, Trump said that the Kremlin knew of his anger, but noted that he had \"a very good relationship\" with the Russian leader and \"the anger dissipates quickly... if he does the right thing\".\n\nIf Russia does not follow through with a ceasefire, Trump threatened to target its economy further if he thought it was Putin's fault.\n\n\"If Russia and I are unable to make a deal on stopping the bloodshed in Ukraine, and if I think it was Russia's fault - which it might not be... I am going to put secondary tariffs... on all oil coming out of Russia,\" he said.\n\n\"There will be a 25% tariff on oil and other products sold in the United States, secondary tariffs,\" Trump said, noting that the tariffs on Russia would come in a month without a ceasefire deal.\n\nSecondary tariffs are sanctions on countries that do business with another country. They could constitute up to 50% on goods entering the US from countries still buying oil from Russia. The biggest such buyers by a long margin are China and India.\n\nZelensky wrote on social media following the interview that \"Russia continues looking for excuses to drag this war out even further\".\n\nHe said that \"Putin is playing the same game he has since 2014\", when Russia unilaterally annexed the Crimean peninsula.\n\n\"This is dangerous for everyone - and there should be an appropriate response from the United States, Europe, and all our global partners who seek peace.\"\n\nLater, Trump said he thought Zelensky was trying to renegotiate the US-Ukraine minerals deal.\n\n\"If he does that he's got some problems,\" he told reporters on board Air Force One.\n\nZelensky previously said he was ready to sign the agreement.\n\nIt was expected to be signed in February but was derailed by the pair's explosive meeting at the White House.\n\nTrump suggested on Sunday that Zelensky wanted to change the deal to get better security guarantees.\n\n\"He wants to be a member of Nato. Well, he was never going to be a member of Nato. He understands that.\"\n\nAlso during the flight, Trump appeared to soften his remarks about Putin.\n\n\"I don't think he's going to go back on his word,\" he told reporters on his flight back to Washington.\n\n\"I've known him for a long time. We've always gotten along well.\"\n\nThe US president said he would speak to Putin later in the week.\n\nMoscow says the current Ukrainian authorities are illegitimate as President Zelensky has stayed in power beyond the end of his term and is therefore not a valid negotiating partner.\n\nBut Zelensky has stayed because elections have been put on hold, legally by martial law and practically by the chaos of war.\n\nIt would be almost impossible to hold a valid election with more than five million Ukrainian citizens displaced overseas and many hundreds of thousands away from home fighting on the front line.\n\nRussia launched a full-scale invasion of its neighbour, Ukraine, in February 2022. It currently controls about 20% of Ukrainian territory.\n\nMore than 100,000 people fighting for Russia's military have now died as the war in Ukraine enters the fourth year, according to data analysed by BBC Russian, independent media group Mediazona and volunteers who have been counting deaths since the war began.\n\nUkraine last updated its casualty figures in December 2024, when President Volodymyr Zelensky acknowledged 43,000 Ukrainian deaths among soldiers and officers. Western analysts believe this figure to be an under-estimate.\n\nAlso in the NBC interview on Sunday, Trump said he was \"not joking\" when he said he would not rule out seeking a third term in the White House, despite it being prohibited by the US Constitution.\n\n\"A lot of people want me to do it,\" Trump said. \"But, I mean, I basically tell them we have a long way to go.\"\n\nDuring the call with NBC, he also again threatened to bomb Iran if it did not agree to a nuclear deal. Trump earlier this month sent a letter to the regime demanding negotiations.\n\n\"It will be bombing the likes of which they have never seen before,\" he said, noting he would also impose secondary tariffs.\n\nOn Sunday, Iran's president Masoud Pezeshkian said the country would not enter into direct negotiations with Washington concerning their nuclear programme, but indirect talks were possible.\n\n\"We don't avoid talks; it's the breach of promises that has caused issues for us so far,\" he said. \"They must prove that they can build trust.\""
  },
  {
    "title": "What are Putin’s conditions for a ceasefire in Ukraine? | Conflict News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/14/what-are-putins-conditions-for-a-ceasefire-in-ukraine",
    "formatted_content": "Russian President Vladimir Putin said on Thursday that Moscow was in favour of the principle of a ceasefire in the war against Ukraine, as proposed by the Donald Trump administration in the United States, but raised questions he said the Kremlin needed answers to before it could commit to a truce.\nHe said Russia needed to discuss these questions and the terms of a peace proposal with the US.\nHis comments, the first on the proposed ceasefire, drew criticism from Ukraine and a muted response from Trump, who has oscillated between expressing confidence in Putin’s commitment to a peace deal and threatening Russia with new sanctions if it does not agree to a ceasefire.\nHere is what Putin said, the conditions he laid out for Moscow to back a ceasefire, and how the US and Ukraine have reacted to his recent statement:\n\n## What is the US-Ukraine ceasefire deal?\n\nOn Tuesday, teams representing Washington and Kyiv met in Saudi Arabia’s Jeddah to negotiate terms for peace in Ukraine.\nAfter this meeting, the two countries released a joint statement, proposing an “immediate, interim” 30-day ceasefire on the war front.\nThe statement placed emphasis on “the exchange of prisoners of war, the release of civilian detainees, and the return of forcibly transferred Ukrainian children” during the ceasefire period.\nThe document did not mention sanctions on Russia or security guarantees for Ukraine, but it did mention that Ukraine’s European allies would be “involved in the peace process”.\nThe document also did not specify what would happen with the Ukrainian soldiers in Russia’s Kursk.\n\n## What did Putin say about the ceasefire?\n\nNothing, for almost two days.\nThen, on Thursday, at a news conference alongside Belarusian President Alexander Lukashenko, Putin responded to the ceasefire proposal.\nHe said the idea of a ceasefire was “correct” and Russia supported it, in principle. “We agree with the proposals to cease hostilities,” he told reporters in Moscow.\nBut, he added, “there are issues that we need to discuss, and I think that we need to talk about it with our American colleagues and partners, and, perhaps, have a call with President Trump and discuss it with him.”\n\n## What ‘issues’ does Putin want resolved before a ceasefire?\n\nThe Russian president outlined three questions and suggested that resolving them in a manner satisfactory to Moscow would be preconditions for the Kremlin to accept a ceasefire.\n\n### How will the Kursk incursion play out?\n\nThe first question Putin posed pertains to Ukrainian troops in the Russian region of Kursk.\nIn August last year, the Ukrainian army launched a surprise incursion into Kursk, seizing territory.\nWhile the Russian army has now reclaimed 1,100 square km (425 square miles) of Kursk – almost the whole area that Ukrainian forces had grabbed – Kyiv’s troops are still present.\n“Will all those who are there come out without a fight? Or will the Ukrainian leadership order them to lay down arms and surrender?” Putin questioned.\n\n### Will Ukraine mobilise troops and receive new weapons during the ceasefire?\n\nPutin also suggested that a 30-day ceasefire could be used by Ukraine to mobilise new forces at a time when its troops are facing setbacks not just in Kursk but also in eastern Ukraine, where Russia has made slow, grinding gains in recent months.\nDuring the news conference, Putin said “Russian troops are advancing in almost all areas of the front… So how will these 30 days be used? For forced mobilisation to continue in Ukraine, for weapons to be delivered there, for the newly-mobilised units to be trained? … How can we and how will we be guaranteed that nothing like that will happen? How will control be organised?”\nYuri Ushakov, Putin’s foreign policy adviser, also said on Thursday that the 30-day pause in fighting would only help Ukrainian troops regroup, deeming the ceasefire a “temporary respite” for the Ukrainian army.\nIn recent months, Ukraine has suffered manpower shortages. In January, Ukrainian troops retreated from Kurakhove, a town in Ukraine’s Donetsk region, when Russian troops claimed control.\n\n### Who will verify the ceasefire?\n\nPutin also questioned how the ceasefire would be monitored and who would ensure that both parties are following the agreement.\n“We proceed from the fact that this cessation should be such that it would lead to long-term peace and eliminate the original causes of this crisis,” he said.\n“Who will give orders to stop hostilities? … Who will determine where and who has violated a possible ceasefire agreement for 2,000 kilometres (1,243 miles)?”\n\n## How has the US reacted?\n\nPutin’s comments came shortly after US President Donald Trump’s special envoy Steve Witkoff arrived in Russia to meet with Putin and other Russian officials. Although Witkoff is officially Trump’s Middle East envoy, he has also been involved in Russia relations.\nLast month, he became the first high-level US official to travel to Russia since its 2022 invasion of Ukraine. During this visit, he secured the release of Marc Fogel, an imprisoned American, in exchange for the US releasing imprisoned Russian Alexander Vinnik. Witkoff was also part of the US team during negotiations with Russian officials in Saudi Arabia.\nOn Thursday, at the beginning of a meeting with NATO Secretary-General Mark Rutte, Trump said that Putin had released “a very promising statement, but it wasn’t complete”.\n“Now we’re going to see whether or not Russia’s there. And if they’re not, it’ll be a very disappointing moment for the world.”\nAlso on Thursday, US Treasury Secretary Scott Bessent told CNBC that Trump is “willing to apply maximum pressure on both sides”, including sanctions on Russia.\nSince the beginning of the war in February 2022, the US and its allies have imposed at least 21,692 sanctions on Russia, targeting individuals, media organisations, the military sector, energy sector, aviation, shipbuilding and telecommunications, among other sectors.\nLast week, the US temporarily suspended military aid and intelligence sharing to Ukraine, after a White House meeting between Trump and Ukrainian President Volodymyr Zelenskyy spiralled into acrimony.\nThe aid and intelligence sharing were restored after the US and Ukraine jointly agreed on the 30-day ceasefire agreement in Jeddah.\n\n## How has Ukraine reacted?\n\nIn his nightly address posted on X on Thursday, Zelenskyy said that Putin is “preparing to reject” the ceasefire proposal.\n“Putin is afraid to tell President Trump directly that he wants to continue this war and keep killing Ukrainians,” said Zelenskyy.\nMarina Miron, a post-doctoral researcher at the defence studies department of King’s College London, said it would make sense for Russia to stall on a decision about the ceasefire.\n“Until the ceasefire is implemented and everybody is on the same page, time will pass, which will probably give the Russians the necessary time to at least get Kursk back so that it removes any potential negotiating bonuses for Ukraine,” Miron told Al Jazeera on Wednesday.\nIn his address, Zelenskyy added: “Now is the time to increase pressure on him [Putin]. Sanctions must be applied – ones that will work.” The Ukrainian leader said his country is willing to continue working with its US and European partners to further the peace process.\n\n## Could the US and Ukraine accept Russia’s peace terms?\n\nIt’s unclear. But some experts believe that Trump’s track record suggests that the US could try to accommodate Putin’s concerns. If that happens, Ukraine might have no choice but to accept this.\n“If past performance is any guide, [Russia’s] demands will be backed by the US,” Keir Giles, a senior consulting fellow at the London-based Chatham House think tank, told Al Jazeera on Wednesday.\n“I think that the Trump administration has shown to Ukraine very clearly that Ukraine is not going to dictate the rules after the debacle in the Oval Office,” Miron added."
  },
  {
    "title": "Five in Ukraine killed in drone strikes as Russia claims advances on ground | Russia-Ukraine war News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/29/four-in-ukraine-killed-in-drone-strike-as-russia-claims-advances-on-ground",
    "formatted_content": "A Russian drone attack has killed at least four people and wounded 21 in the eastern Ukrainian city of Dnipro, damaging high-rise buildings and triggering fires in a hotel and homes, the regional governor said, as Moscow claims to have made gains on the ground elsewhere.\nLate Saturday, the mayor of Ukraine’s second-largest city, Kharkiv, said at least one person was killed in a Russian drone attack. At least nine people were injured.\nIn Dnipro, the governor of the surrounding Dnipropetrovsk region, Sergiy Lysaksaid, “The massive attack caused large-scale destruction and fires. A hotel and restaurant complex, 11 private houses, garages, and a service station were on fire,” he said, adding that high-rises and cars were also damaged.\nPictures and videos posted online showed flames and large plumes of smoke wafting skyward. Others showed the shattered interior of a building, the badly damaged upper floors of a high-rise apartment block and streets strewn with smashed glass and building materials.\nOn Saturday, during his evening address to the nation, Ukraine’s President Volodymyr Zelenskyy said, “For too long now, America’s proposal for an unconditional ceasefire has been on the table without an adequate response from Russia … There could already be a ceasefire if there was real pressure on Russia.”\n\n## Russia claims gains on the ground\n\nOn Saturday, Russian forces said they had captured the settlement of Panteleimonivka in Ukraine’s eastern Donetsk region and Scherbaky in Ukraine’s Zaporizhia region, areas already under partial Russian occupation, according to the Interfax news agency, which cited the Russian Ministry of Defence. Russian forces also captured the settlement of Veselivka in Ukraine’s northeastern Sumy region, according to the Russian state-run TASS.\nIn the meantime, Russia’s Defence Ministry accused Ukraine of attacking its energy facilities in the past 24 hours. The ministry said Ukraine attacked power grids in the Belgorod region several times, leaving about 9,000 residents without a power supply.\nBoth Russia and Ukraine have stepped up their aerial attacks as US President Donald Trump pushes both countries to agree to a ceasefire after more than three years of ruinous war.\nMoscow is preparing to launch a new military offensive in the coming spring to maximise the pressure on Kyiv and strengthen the Kremlin’s negotiating position in ceasefire talks, Ukrainian government and military analysts have said.\nOn Friday, Russian President Vladimir Putin called for a “transitional administration” to be put in place in Ukraine and promised his army would “finish off” Ukrainian troops.\nZelenskyy dismissed Putin’s call for a UN-run administration as the Russian leader’s latest ploy to delay a peace deal.\n“Russia is making a mockery of peacekeeping efforts around the world. It is dragging out the war and sowing terror because it still feels no real pressure,” he said.\nThe United States, however, is continuing to try to negotiate a ceasefire in the Black Sea and to end strikes targeting energy infrastructure in both nations.\nWhile both have agreed to these truces in principle, their implementation remains unclear, and Russia and Ukraine continue to trade accusations that the other is seeking to derail them."
  },
  {
    "title": "Trump ‘angry’ with Putin and threatens tariffs on Russian oil over Ukraine | Russia-Ukraine war News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/30/trump-angry-with-putin-and-threatens-tariffs-on-russian-oil-over-ukraine",
    "formatted_content": "United States President Donald Trump has said he is “p***** off” at his Russian counterpart, Vladimir Putin, and has threatened to impose secondary sanctions on Russian oil if Moscow does not agree to a ceasefire to end its war in Ukraine.\n“If Russia and I are unable to make a deal on stopping the bloodshed in Ukraine, and if I think it was Russian’s fault – which it might not be – but if I think it was Russia’s fault, I am going to put secondary tariffs on all oil coming out of Russia,” Trump said in an interview with NBC on Sunday.\nTrump said that the 25 percent tariffs could happen at any moment, adding that he plans to speak with Putin this week.\nAccording to the report, Trump was “angry and p***** off” when the Russian president started questioning Ukrainian President Volodymyr Zelenskyy’s legitimacy and discussed the prospect of a new leadership in Ukraine.\nOn Thursday, Putin suggested that a temporary administration under the supervision of the United Nations should be introduced in Ukraine – a proposal swiftly rejected by UN Secretary-General Antonio Guterres.\nRussian officials have repeatedly discredited Zelenskyy’s legitimacy as president, noting that no elections had been held since his term expired.\nA vote has not been scheduled in Ukraine because the country’s constitution mandates that elections cannot be held under martial law, which has been in place since the start of Russia’s full-scale invasion of its neighbouring country three years ago.\nThere was no immediate reaction from Moscow to Trump’s comments.\nRussia has called Western sanctions “illegal” and designed for the West to take economic advantage in its rivalry with Russia.\nTrump’s latest remarks followed a day of meetings and golf with Finnish President Alexander Stubb over the weekend.\nStubb’s office said he told Trump that a deadline needs to be set for establishing a Russia-Ukraine ceasefire to make it happen, and suggested April 20, since Trump would have been in office then for three months.\nUS officials have been separately pushing Kyiv to accept a critical minerals agreement, a summary of which suggested that the US was demanding all of Ukraine’s natural resources income for years.\nZelenskyy has said Kyiv’s lawyers needed to review the draft before he could say more about the offer.\nSpeaking on board Air Force One later on Sunday, Trump accused the Ukrainian leader of attempting to back out of the deal.\n“If he does that, he’s got some problems, big, big problems,” Trump told reporters.\n“He wants to be a member of NATO, but he’s never going to be a member of NATO. He understands that.”\nTrump’s threat of “secondary tariffs” on Russian oil came less than a week after his administration imposed a 25 percent tariff on US imports from any country buying oil or gas from Venezuela.\nA similar tariff on US imports from countries that buy Russian oil could hit China and India, two of Moscow’s biggest customers, particularly hard.\nIn his NBC interview, Trump said Putin knows he is angry with him, but added that he had “a very good relationship with him” and “the anger dissipates quickly … if he does the right thing”."
  },
  {
    "title": "Why is Trump ‘very angry’ with Putin and who will secondary tariffs hurt? | Donald Trump News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/31/why-is-trump-very-angry-with-putin-and-who-will-secondary-tariffs-hurt",
    "formatted_content": "United States President Donald Trump said on Sunday that he was “p***** off” at his Russian counterpart, Vladimir Putin, and would slap additional financial penalties on the sale of Russian oil if he did not agree to a ceasefire in Ukraine.\nThe comments marked a sharp change in tone from Trump, who has been open to peace negotiations with Moscow since his second term began in January.\nHere is more about what happened, what Trump’s threat could involve, and why this is significant for Putin’s war on Ukraine, and for countries that buy Russian oil.\n\n## What did Trump say about Putin?\n\nDuring an interview with NBC on Sunday, Trump said he was “very angry” and “p***** off” over Putin questioning the legitimacy of Ukrainian President Volodymyr Zelenskyy.\nTrump argued that any move seeking to replace Zelenskyy as the leader of Ukraine would inevitably delay the prospects of a ceasefire.\nHowever, Trump did add that Putin knew he was angry with him. He said he and Putin had “a very good relationship” and “the anger dissipates quickly … if he does the right thing”.\n\n## What had Putin said about Zelenskyy?\n\nPutin said Zelenskyy lacked the legitimacy to sign a peace agreement.\nThe Russian leader has frequently claimed that the Ukrainian government is illegitimate, ever since the 2014 overthrow of Moscow-leaning President Viktor Yanukovych, whom the Kremlin claims had US backing.\nPutin suggested on Thursday that a temporary administration be established in Ukraine under the supervision of the United Nations. This proposal was rejected by UN Secretary-General Antonio Guterres.\nZelenskyy was sworn in as the president of Ukraine in 2019 for a five-year term. The war broke out following Russia’s full-scale invasion of Ukraine in February 2022. While Ukraine was supposed to have presidential elections in 2024, the country has been under martial law due to the war, and its constitution does not allow it to hold elections under martial law conditions.\nThough Trump has now criticised Putin for questioning Zelenskyy’s legitimacy as Ukraine’s president, the American leader did the same not long ago.\nIn February, amid tensions with the Ukrainian leader, Trump described Zelenskyy as “ A Dictator without Elections ” in a post on his Truth Social platform.\n\n## What is the state of diplomatic efforts to end the Ukraine war?\n\nDuring his presidential election campaign, Trump promised that he would bring the Ukraine war to a prompt halt.\nSince his inauguration, US negotiating teams have separately met Russian and Ukrainian teams multiple times in Saudi Arabia to discuss peace terms. Trump has also separately spoken to Putin and Zelenskyy since then.\nThe three sides agreed on March 25 to stop using military force in the Black Sea. They also agreed to pause attacks on energy infrastructure in Russia and Ukraine for 30 days. However, both sides have accused each other of violating this and attacking energy facilities.\nUkraine and the US had agreed to a 30-day complete ceasefire on land and sea, which is pending Russia’s approval. Putin has not signed this proposal, citing reservations that Ukraine might use the period to rearm itself — including with supplies of cutting-edge Western weapons — and mobilise more soldiers at a time when it faces a manpower shortage.\n\n## What has Trump threatened — and will it work?\n\nTrump has threatened “secondary tariffs” on Russian oil if he deems Moscow responsible for not reaching a ceasefire agreement.\n“If Russia and I are unable to make a deal on stopping the bloodshed in Ukraine, and if I think it was Russia’s fault – which it might not be – but if I think it was Russia’s fault, I am going to put secondary tariffs on all oil coming out of Russia,” said Trump during the NBC interview.\n“That would be that if you buy oil from Russia, you can’t do business in the United States. There will be a 25 percent tariff on all oil, a 25 to 50-point tariff on all oil.”\nKeir Giles, a senior consulting fellow at the London-based Chatham House think tank, told Al Jazeera that it is unclear whether these threats would place pressure on Russia.\n“We have seen sporadic threats by Trump to impose some kind of economic pressure on Russia but they never last long,” said Giles, adding it would be a “radical departure” from his past approach towards the war if Trump were to impose pressure on Moscow, rather than on Kyiv.\n“We do not know if this threat is empty, but the previous ones have been, and Putin knows that,” Giles said.\n\n## What are secondary tariffs?\n\nBy “secondary tariffs” Trump appears to mean tariffs on imports from countries that buy Russian oil.\nThe US has long led campaigns of what are known as secondary sanctions — in which countries that trade with a sanctioned country also face sanctions. For instance, secondary sanctions are in place against the purchase of Iranian oil or heavy military equipment from Russia: countries, companies and individuals that engage in this trade are at risk of US sanctions.\nThe threat of secondary US sanctions is also why most global banks and financial institutions no longer participate in trade with Russia or Iran — they do not want to risk losing out on business in the US.\nBy contrast, secondary tariffs are relatively untested as a phenomenon. Last week, Trump also imposed a 25 percent secondary tariff on US imports from any country buying oil and gas from Venezuela.\n\n## Which countries could Trump’s secondary tariffs hurt?\n\nIf Trump imposes secondary tariffs on Russian oil, India and China could be hit particularly hard.\nIndia and China are the two biggest buyers of inexpensive Russian crude.\nRussian oil constituted 35 percent of India’s overall crude imports in 2024, while it made up 19 percent of China’s oil imports. Turkiye is also an importer of Russian oil — in 2023, as much as 58 percent of its refined petroleum imports came from Russia.\n\n## How much would secondary tariffs bleed China, India and Turkiye?\n\nIf Trump were to impose these tariffs, it is unclear whether they would be added to existing tariffs or if they would absorb other tariffs already in force.\nThe US is China’s single biggest export market. In 2024, China sold goods worth $463bn to the US. But Trump has already imposed 20 percent tariffs on all imports from China.\nIndia too counts the US as its biggest export market. Indian exports to the US stood at $91bn in 2024. However, Trump has repeatedly railed against India’s high tariffs on US imports.\nTurkiye is relatively less exposed. The US is its second-largest export market, after Germany, at $17bn in 2024.\nHowever, Trump has threatened reciprocal, tit-for-tat tariffs from April 2 against all US trading partners.\nAnd if Trump truly cracks down on countries that buy Russian oil, India in particular could find itself under Washington’s scrutiny. That is because India — which has 22 oil refineries, including the world’s largest in Jamnagar in the western state of Gujarat — has long been accused of buying subsidised Russian oil, refining it, and selling it to the West, effectively helping Moscow undercut Western sanctions.\nIn 2023, India exported $55.8bn worth of refined oil products such as petrol and diesel to countries including the US, the United Kingdom, France and Belgium that otherwise have strict sanctions on the import of Russian crude, according to data from the Observatory of Economic Complexity (OEC).\nFollowing Canada, India is the second largest exporter of refined oil to the US, making up 7.5 percent of US oil exports as of 2023, OEC data shows.\nBut India has long argued that by buying Russian oil, it has freed up crude from other sources, such as the Middle East and Africa, for Western nations to buy, keeping global oil prices under control. If oil from Russia — a leading producer — were no longer available to anyone, every nation would need to scramble for limited supplies of crude from elsewhere, driving up prices."
  },
  {
    "title": "US holds separate talks with Russians after meeting Ukrainians to discuss a potential ceasefire | AP News",
    "url": "https://apnews.com/article/russia-ukraine-war-riyadh-talks-saudi-arabia-330342dae25c139fc047275964d97757",
    "formatted_content": "## China rules out supplying peacekeeping forces\n\n## Ukrainian railways hit by cyberattack\n\n## ___\n\nDUBAI, United Arab Emirates (AP) — U.S. negotiators worked on a proposed partial ceasefire in the 3-year-old war in Ukraine on Monday, meeting representatives from Russia one day after holding separate talks with a team from Kyiv.\n\nIt has been a struggle to reach even a limited, 30-day ceasefire — which Moscow and Kyiv agreed to in principle last week -- with both sides continuing to attack each other with drones and missiles.\n\nOne major sticking point is what targets would be off-limits to strike, even after U.S. President Donald Trump spoke with the countries’ leaders, because the parties disagree.\n\nWhile the White House said “energy and infrastructure” would be covered, the Kremlin declared that the agreement referred more narrowly to “energy infrastructure.” Ukrainian President Volodymyr Zelenskyy has said he would also like to see infrastructure like railways and ports protected.\n\nIn this photo provided by the Ukrainian Emergency Service, firefighters put out the fire following a Russian attack in Donetsk region, Ukraine, Monday, March 24, 2025. (Ukrainian Emergency Service via AP)\n\nIn this photo provided by the Ukrainian Emergency Service, firefighters put out the fire following a Russian attack in Donetsk region, Ukraine, Monday, March 24, 2025. (Ukrainian Emergency Service via AP)\n\nTalks Monday in the Saudi capital of Riyadh were expected to address some of those differences, as well as a potential pause in attacks in the Black Sea to ensure the safety of commercial shipping. Russian state media reported late Monday local time that the talks had ended.\n\nAP correspondent Naeun Kim reports on US-Russia officials holding talks right now in Saudi Arabia on a possible ceasefire in Ukraine.\n\nIn an exchange with reporters at the White House, Trump said territorial lines and the potential for U.S. ownership of a key nuclear power plant in southern Ukraine have been part of the talks.\n\nLast week, Trump floated the idea of the U.S. taking control of the Zaporizhzhia Nuclear Power Plant. The six-reactor facility — one of the world’s largest — was seized by Russia early in the war.\n\nIn this photo provided by Ukraine’s 93rd Kholodnyi Yar Separate Mechanized Brigade press service, a soldier gets ready to fire FPV drones towards Russian positions in a shelter in Kramatorsk direction, Donetsk region, Ukraine, Saturday, March 22, 2025. (Iryna Rybakova/Ukraine’s 93rd Mechanized Brigade via AP)\n\nIn this photo provided by Ukraine’s 93rd Kholodnyi Yar Separate Mechanized Brigade press service, a soldier gets ready to fire FPV drones towards Russian positions in a shelter in Kramatorsk direction, Donetsk region, Ukraine, Saturday, March 22, 2025. (Iryna Rybakova/Ukraine’s 93rd Mechanized Brigade via AP)\n\n“Some people are saying the United States should own the power plant — work it that way because we have the expertise” to get the plant operating, Trump said. “Something like that would be fine with me.”\n\nSince falling under Russian control, the plant’s conditions have deteriorated. While its reactors have been shut down for years, they still require power and staff to maintain cooling systems and safety features. The facility is connected to Ukraine’s energy grid without producing electricity.\n\nU.S. and Russian representatives met in the morning in Riyadh, Russia’s state Tass and RIA-Novosti news agencies reported. The U.S. and Ukrainian teams met Sunday.\n\nSerhii Leshchenko, an adviser to the Ukrainian presidency, said the delegation remained in Riyadh on Monday and expected to meet again with the Americans. In his nightly address Monday, Zelenskyy said representatives from Ukraine and the U.S. will meet again, although he did not specify when.\n\nGrigory Karasin, head of the foreign affairs committee in the Russian parliament’s upper house and a participant in Monday’s talks, told the Interfax news agency the negotiations were going on in a “creative way” and that the U.S. and Russian delegations “understand each other’s views.”\n\nMeanwhile, both Russia and Ukraine continued to launch attacks across their borders.\n\nThe Russian Defense Ministry said Monday a Ukrainian drone attacked an oil pumping station in southern Russia that serves a pipeline carrying Kazakhstan’s Caspian Sea oil to the Russian port of Novorossiisk for export. It said the drone was downed before it could reach the pumping station.\n\nKremlin spokesman Dmitry Peskov said Monday the Russian military has been fulfilling President Vladimir Putin’s order to halt attacks on energy facilities for 30 days. He has accused Ukraine of derailing the partial ceasefire with attacks on Russia’s energy facilities, including a gas metering station in Sudzha in Russia’s Kursk region.\n\nUkraine’s military General Staff rejected Moscow’s accusations and blamed the Russian military for shelling the station, a claim Peskov called “absurd.”\n\nZelenskyy said Sunday evening that “since March 11, a proposal for an unconditional ceasefire has been on the table, and these attacks could have already stopped. But it is Russia that continues all this.”\n\nHe added that Ukraine’s partners — “the U.S., Europe, and others around the world” — should increase pressure on Russia “to stop this terror.”\n\nIn this image taken from a video distributed by Russian Defense Ministry Press Service on Monday, March 24, 2025, a Russian Army 2S5 howitzer Giatsint-S fires towards Ukrainian positions in Ukraine. (Russian Defense Ministry Press Service via AP)\n\nIn this image taken from a video distributed by Russian Defense Ministry Press Service on Monday, March 24, 2025, a Russian Army 2S5 howitzer Giatsint-S fires towards Ukrainian positions in Ukraine. (Russian Defense Ministry Press Service via AP)\n\nZelenskyy has emphasized that Ukraine is open to Trump’s proposal of a full, 30-day ceasefire. Putin has made a complete ceasefire conditional on a halt of arms supplies to Kyiv and a suspension of Ukraine’s military mobilization — demands rejected by Kyiv and its Western allies.\n\nSpeaking on “Fox News Sunday,” Trump’s special envoy Steve Witkoff said he expected “some real progress” at talks and that a pause in hostilities by both countries in the Black Sea would “naturally gravitate into a full-on shooting ceasefire.”\n\nAsked about reports speculating that China might send peacekeepers to Ukraine to enforce any peace deal, Chinese Foreign Ministry spokesperson Guo Jiakun responded Monday with an unequivocal no.\n\n“Let me stress that the report is completely false. China’s position on the Ukraine crisis is clear and consistent,” Guo said at a briefing.\n\nChina has provided Russia with trade earnings from oil and other natural resources, along with diplomatic backing, but has not given any weapons or sent any personnel. China is, however, on close terms with North Korea, which has sent troops to fight alongside the Russian army.\n\nA “massive targeted cyberattack” hit Ukrainian state railway operator Ukrzaliznytsia on Sunday, the company wrote on Telegram, adding that it was working to restore its systems on Monday. The company said the attack did not affect train movements or schedules but disrupted its online booking system.\n\n“The railway continues to operate despite physical attacks on the infrastructure, and even the most vile cyberattacks cannot stop it,” the company wrote.\n\nMeanwhile, Ukraine’s Special Operations Forces claimed Monday it destroyed four military helicopters in Russia’s Belgorod region with the use of U.S.-supplied HIMARS rocket systems. It published drone footage on its Telegram page of what it said was the attack.\n\nThe strikes occurred at a concealed “jumping-off point” for Russian aircraft used in surprise attacks on Ukrainian forces, the group said.\n\nA Russian missile struck the northern city of Sumy, across the border from Russia’s Kursk region, hitting residential buildings and a school, said regional head Volodymyr Artiukh. Children at the school were being evacuated at the time, and all were safe, he added.\n\nBut the regional prosecutor’s office said 65 people were injured, including 14 children.\n\nEarlier, Russia fired 99 attack and decoy drones into Ukraine overnight, according to Ukraine’s air force, of which 57 were shot down.\n\nNovikov reported from Kyiv, Ukraine. Associated Press writers Christopher Bodeen in Beijing and Aamer Madhani in Washington contributed."
  },
  {
    "title": "Russia and Ukraine accuse each other of breaking ceasefire terms protecting energy sites",
    "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-energy-ceasefire-90fb2c2ec1acb1d7728e59258c763989",
    "formatted_content": "## Conflicting statements emerge\n\n## Russia links the Black Sea deal to sanctions relief\n\n## Zelenskyy comments on foreign contingent\n\n## Russia launches drone attack on Zelenskyy’s hometown\n\n## ___\n\nKYIV, Ukraine (AP) — Russia and Ukraine have accused each other of breaking the terms of a tentative U.S-brokered deal to pause strikes on energy infrastructure, underscoring the challenges to negotiating a broader peace in the war in Ukraine.\n\nRussia’s Defense Ministry alleged that Ukrainian drone attacks hit an electric facility in the Bryansk region early Wednesday and a power grid facility in the Kursk region on Tuesday, leading to a power cut affecting thousands of people.\n\nIt said that the Ukrainian government “is doing everything to derail the Russian-U.S. agreements on the gradual settlement” of the war.\n\nUkraine’s General Staff denied the allegations, saying in a statement Wednesday that Russia’s claims were part of a broader disinformation campaign aimed at justifying continued hostilities.\n\nThe accusations came hours after Washington announced a tentative agreement with Ukraine and Russia to pause attacks on energy sites and ensure safe shipping in the Black Sea, following three days of separate talks in Saudi Arabia aimed at implementing a limited, 30-day ceasefire that Moscow and Kyiv agreed to in principle last week.\n\nHowever, conflicting statements emerged immediately after the talks on Tuesday. Both sides differed on the start time of halting strikes on energy sites and accused the other of violating the ceasefire.\n\nUkrainian President Volodymyr Zelenskyy said Tuesday Ukraine had agreed with U.S. negotiators in Riyadh “that a ceasefire for energy infrastructure can start today,” and expressed his country’s willingness to comply with the agreement while warning Russia would face “strong retaliation” if it attacked Ukrainian energy facilities.\n\nThe Kremlin declared that Russian hasn’t attacked any Ukrainian energy facilities since March 18 when Russian President Vladimir Putin agreed to halt the attacks for 30 days in a phone call with President Donald Trump. Kremlin spokesman Dmitry Peskov said Wednesday that Moscow will keep respecting the halt on strikes despite Ukrainian violations, saying that it marked a “good step forward thanks to the constructive relations with the American side.”\n\nUkrainian officials have contested the Kremlin claims.\n\n“They’ve been hitting our energy sites with bombs, attack drones, and FPV drones,” Zelenskyy’s communications adviser Dmytro Lytvyn said on X. “We’re not going into all the details, but there have already been eight confirmed hits on energy facilities. Every night our air defense forces shoot down nearly a hundred attack drones – and many of those drones were likely targeting other energy facilities.”\n\nOn Tuesday, the White House also announced that the sides had “agreed to ensure safe navigation, eliminate the use of force, and prevent the use of commercial vessels for military purposes in the Black Sea.”\n\nDetails of the prospective deal were not released, but it appeared to mark another attempt to ensure safe Black Sea shipping after a 2022 agreement that was brokered by the U.N. and Turkey but halted by Russia the next year.\n\nThe Kremlin warned Tuesday that a potential Black Sea deal could only be implemented after sanctions against the Russian Agricultural Bank and other financial organizations involved in food and fertilizer trade are lifted and their access to the SWIFT system of international payments is ensured.\n\nSpeaking during a visit to Paris on Wednesday, Zelenskyy accused Moscow of attempting to add extra conditions to what should be an “unconditional agreement.”\n\n“We expect the American side to ensure an unconditional ceasefire at sea,” Zelenskyy said. “Russia wants this war to continue. Russia is prolonging it. Pressure on Russia is needed for the war to genuinely end.”\n\nHe also argued that it’s too early for the United States to ease sanctions against Russia, stating that Ukraine continues discussions with international partners, including the United States, Asian countries and the European Union, to prepare new sanctions packages.\n\nThe White House said in Tuesday’s statement that the U.S. “will help restore Russia’s access to the world market for agricultural and fertilizer exports, lower maritime insurance costs, and enhance access to ports and payment systems for such transactions.”\n\nU.S. Secretary of State Marco Rubio said that “we’re going to evaluate” the Russian conditions, noting that some of them “include sanctions that are not ours, they belong to the European Union.”\n\nRubio said that after analyzing Moscow’s demands, “we’ll present that to the president, who will make a decision” about the next step.\n\n“I think everyone should be happy that the United States is engaged in a process of ending a war and bringing about peace,” Rubio said. “It’s not going to be easy. It won’t be simple. It’ll take some time. But at least we’re on that road and we’re talking about these things, and we’re going to test it and see what’s possible.”\n\nPeskov, the Kremlin spokesman, said that contacts between Russia and the U.S. “continue quite intensively,” and that authorities are “satisfied with how pragmatic, constructive and productive our dialogue is.”\n\nU.N. Secretary-General Antonio Guterres welcomes the Black Sea commitments, which “will be a crucial contribution to global food security and supply chains,” said U.N. spokesman Stephane Dujarric. Dujarric wouldn’t say whether the U.N. will be participating in monitoring the Black Sea agreement.\n\nSpeaking in Paris on Wednesday alongside French President Emmanuel Macron, Zelenskyy emphasized the importance of having a foreign contingent to monitor and control the situation, conduct joint exercises, and deter potential renewed Russian aggression.\n\n“No one wants to drag other countries into the war,” Zelenskyy said. “A contingent is very important for control”.\n\nHe noted the importance of diplomacy but noted, “Only diplomacy that is based on the strength of the country itself and all of its partners can be powerful.”\n\nMacron has talked about the possible deployment of European troops to Ukraine as part of security guarantees and has been driving the effort to form a “coalition of the willing” with U.K. Prime Minister Keir Starmer. Macron is set to host 31 delegations around the table Thursday morning at the presidential Elysee Palace.\n\nRussia has warned it will not accept any troops from NATO members as potential peacekeepers in Ukraine.\n\nKryvyi Rih, Zelenskyy’s hometown, came under the “most massive kamikaze drone attack since the beginning of the war” on Tuesday night, the city administration head, Oleksandr Vilkul, wrote on Telegram.\n\nAlthough no one was killed or injured, civilian infrastructure including warehouses, an administration building and a fire station was widely targeted, Vikul said. Multiple fires were sparked across the city, he said.\n\n“Everyone is alive, thank God. It’s truly a miracle. The destruction is significant,” Vilkul said.\n\nAssociated Press writers Matthew Lee in Washington, Edith M. Lederer at the United Nations and Dasha Litvinova in Tallinn, Estonia, contributed to this report."
  },
  {
    "title": "Things to know about the limited ceasefire between Russia and Ukraine brokered by the US | AP News",
    "url": "https://apnews.com/article/ukraine-russia-us-limited-ceasefire-4f1d4a835c52e8a37716ea21b32ccb0b",
    "formatted_content": "## The limited ceasefire began with a rocky start\n\n## Stopping fighting around Black Sea shipping routes\n\n## It’s unclear how the Black Sea deal would benefit Ukraine\n\n## Trading blame over halting of energy strikes\n\nKYIV, Ukraine (AP) — After three days of intense negotiations, the Trump administration, Ukraine and Russia agreed to a limited ceasefire in which the key details, including what was covered and how it will start, were disputed by the warring sides, indicating the road to a complete truce will be long and mired with contention.\n\nThe negotiations focused on easing Black Sea shipping and halting long-range strikes on energy infrastructure, relatively low-hanging fruit that both sides had experience in negotiating before the U.S. brokered indirect talks.\n\nWhile much is yet unknown, here is a breakdown of the key elements of the partial ceasefire and what is at stake in the coming weeks as talks continue.\n\nConflicting statements emerged immediately after the talks on Tuesday. Both sides differed on the start time of halting strikes on energy sites and accused the other of violating the ceasefire.\n\nRussia also conditioned its part in opening Black Sea shipping on the U.S. lifting sanctions, which Kyiv dismissed.\n\nRussian officials have greeted the results of the talks with optimism, and Ukrainian President Volodymyr Zelenskyy described it as a good start, though some Ukrainian officials have expressed discontent.\n\n“Something tells me this is more advantageous for the enemy,” Ukrainian lawmaker Yaroslav Zheleznyak told the Interfax Ukraine news agency.\n\nThe U.S. said Tuesday it had reached a tentative agreement with Ukraine and Russia to stop fighting and ensure safe navigation in the Black Sea in separate talks with the two sides.\n\nDetails of the deal were not released, including how or when it was to be implemented and monitored, but it appeared to mark another attempt to ensure safe Black Sea shipping after a 2022 agreement that was brokered by the U.N. and Turkey was halted by Russia one year later, in July 2023.\n\nRussia said the Black Sea deal announced Tuesday could only be implemented after sanctions against the Russian Agricultural Bank and other financial institutions involved in food and fertilizer trade were lifted and their access to the SWIFT system of international payments was ensured.\n\nZelenskyy said Moscow was lying about the terms of the agreement, despite the U.S. later saying it would help restore Russia’s access to the world market for agricultural and fertilizer exports.\n\nWhile the benefits to Russia are clear, Ukrainian officials questioned how the Black Sea deal announced Tuesday would profit them. It isn’t clear, for instance, if it would also halt attacks on Ukrainian ports.\n\n“Personally, I don’t think this will significantly boost our export capacity. Frankly speaking, thanks to Ukrainian naval drones, we have considerably expanded our capabilities in the Black Sea,” Ukrainian lawmaker Zhelezniak said.\n\nThat’s because Ukraine took matters into its own hands after Russia backed out in 2023 of the earlier deal to ensure safe Black Sea shipping. Ukraine carved out a trade route requiring ships to sail near the coast lines of Bulgaria and Romania, guided by the Ukrainian Navy. At the same time, Ukrainian forces launched a campaign of sea drone attacks to further push back Russia’s fleet.\n\n“Unfortunately,’' Zhelezniak said, the new deal “worsens our position in terms of influence in the Black Sea.”\n\nThe ceasefire also included a halt to long-range strikes on energy infrastructure, but sharp differences emerged immediately after Tuesday’s announcement over when the halt to fighting would begin.\n\nMoscow said the ceasefire had started on March 18 and accused Kyiv of violating the terms by striking energy sites inside Russia, a charge that Ukraine’s General Staff denied on Wednesday.\n\nThe Kremlin later posted a list of the types of facilities covered by the limited ceasefire.\n\nIt included refineries, oil and gas pipelines, oil storage facilities, including pump stations, power-generating and transmitting infrastructure, as well as power plants, substations, transformers, distribution switchgear, nuclear power plants and hydropower plant dams."
  },
  {
    "title": "Ukrainians expect Russia to launch a fresh offensive to strengthen its negotiating position",
    "url": "https://apnews.com/article/russia-ukraine-war-spring-fighting-offensive-ceasefire-talks-49ee814cc4a8416c444ab7deae42488c",
    "formatted_content": "## Kremlin forces keep pressing forward\n\n## Fighting intensifies on parts of the front line\n\n## Russia increases reconnaissance missions\n\n## Little progress reported at negotiating table\n\n## ___\n\nKYIV, Ukraine (AP) — Russian forces are preparing to launch a fresh military offensive in the coming weeks to maximize pressure on Ukraine and strengthen the Kremlin’s negotiating position in ceasefire talks, Ukrainian government and military analysts said.\n\nThe move could give Russian President Vladimir Putin every reason to delay discussions about pausing the fighting in favor of seeking more land, the Ukrainian officials said this week, renewing their country’s repeated arguments that Russia has no intention of engaging in meaningful dialogue to end the war.\n\nIn this photo taken on March 16, 2025 and provided by Ukraine’s 24th Mechanized Brigade press service, Ukrainian soldiers fire 120mm mortar towards Russian army positions near Chasiv Yar, Donetsk region, Ukraine, Sunday, March 16, 2025. (Oleg Petrasiuk/Ukraine’s 24th Mechanized Brigade via AP)\n\nIn this photo taken on March 16, 2025 and provided by Ukraine’s 24th Mechanized Brigade press service, Ukrainian soldiers fire 120mm mortar towards Russian army positions near Chasiv Yar, Donetsk region, Ukraine, Sunday, March 16, 2025. (Oleg Petrasiuk/Ukraine’s 24th Mechanized Brigade via AP)\n\nWith the spring fighting season drawing near, the Kremlin is eyeing a multi-pronged push across the 1,000-kilometer (621-mile) front line, according to the analysts and military commanders.\n\nCiting intelligence reports, Ukrainian President Volodymyr Zelenskyy said Russia is getting ready for new offensives in the northeast in the Sumy, Kharkiv and Zaporizizhia regions.\n\n“They’re dragging out the talks and trying to get the U.S. stuck in endless and pointless discussions about fake ‘conditions’ just to buy time and then try to grab more land,” Zelenskyy said Thursday in a visit to Paris.\n\nA resident watches as his neighbour cleans up the damaged apartment in a multi-storey house after a Russian night drone attack in Kyiv, Ukraine, Sunday, March 23, 2025. (AP Photo/Efrem Lukatsky)\n\nA resident watches as his neighbour cleans up the damaged apartment in a multi-storey house after a Russian night drone attack in Kyiv, Ukraine, Sunday, March 23, 2025. (AP Photo/Efrem Lukatsky)\n\nTwo G7 diplomatic officials in Kyiv agreed with that assessment. They spoke on condition of anonymity because they were not authorized to brief the press.\n\nRussia has effectively rejected a U.S. proposal for an immediate and full 30-day halt in the fighting, and the feasibility of a partial ceasefire on the Black Sea was thrown into doubt after Kremlin negotiators imposed far-reaching conditions.\n\nIn this photo provided by Ukraine’s 93rd Kholodnyi Yar Separate Mechanized Brigade press service, a soldier in a shelter gets ready to fire FPV drones towards Russian positions in a shelter in Kramatorsk direction, Donetsk region, Ukraine, Saturday, March 22, 2025. (Iryna Rybakova/Ukraine’s 93rd Mechanized Brigade via AP)\n\nIn this photo provided by Ukraine’s 93rd Kholodnyi Yar Separate Mechanized Brigade press service, a soldier in a shelter gets ready to fire FPV drones towards Russian positions in a shelter in Kramatorsk direction, Donetsk region, Ukraine, Saturday, March 22, 2025. (Iryna Rybakova/Ukraine’s 93rd Mechanized Brigade via AP)\n\nFour people died and 24 were injured Friday evening after Russian drones struck Dnipro in the country’s east, according to regional Gov. Serhii Lysak and Ukraine’s emergency service. At least eight more people were injured when a Russian ballistic missile struck nearby Kryvyi Rih, Zelenskyy’s hometown, Gov. Lysak reported.\n\nBattlefield success is clearly in Putin’s mind.\n\n“On the entire front line, the strategic initiative is completely in the hands of the Russian armed forces,” Putin said Thursday at a forum in the Arctic port of Murmansk. “Our troops, our guys are moving forward and liberating one territory after another, one settlement after another, every day.”\n\nUkrainian military commanders said Russia recently stepped up attacks to improve its tactical positions ahead of the expected broader offensive.\n\n“They need time until May, that’s all,” said Ukrainian military analyst Pavlo Narozhnyi, who works with soldiers and learns about intelligence from them.\n\nIn this photo provided by Ukraine’s 93rd Kholodnyi Yar Separate Mechanized Brigade press service, a view of Pokrovsk, the site of heavy battles with Russian troops, in the Donetsk region, Ukraine, Tuesday, March 25, 2025. (Iryna Rybakova/Ukraine’s 93rd Mechanized Brigade via AP)\n\nIn this photo provided by Ukraine’s 93rd Kholodnyi Yar Separate Mechanized Brigade press service, a view of Pokrovsk, the site of heavy battles with Russian troops, in the Donetsk region, Ukraine, Tuesday, March 25, 2025. (Iryna Rybakova/Ukraine’s 93rd Mechanized Brigade via AP)\n\nIn the north, Russian and North Korean soldiers have nearly deprived Kyiv of an essential bargaining chip by retaking most of Russia’s Kursk region, where Ukrainian soldiers staged a daring incursion last year. Battles have also escalated along the eastern front in Donetsk and Zaporizhzhia.\n\nA concern among some commanders is whether Russia might divert battle-hardened forces from Kursk to other parts of the east.\n\n“It will be hard. The forces from Kursk will come on a high from their wins there,” said a Ukrainian battalion commander in the Donetsk region, who spoke on condition of anonymity to describe his concerns.\n\n“They are preparing offensive actions on the front that should last from six to nine months, almost all of 2025,” said Ukrainian military analyst Oleksii Hetman, who has connections to the military’s general staff.\n\nIn this photo provided by the Ukrainian Emergency Service, firefighters put out the fire following a Russian attack in Kharkiv, Ukraine, Thursday, March 27, 2025. (Ukrainian Emergency Service via AP)\n\nIn this photo provided by the Ukrainian Emergency Service, firefighters put out the fire following a Russian attack in Kharkiv, Ukraine, Thursday, March 27, 2025. (Ukrainian Emergency Service via AP)\n\nRussia entered negotiations with a clear advantage in the war. Now, after recapturing 80% of its territory in the Kursk region ahead of talks, its forces have intensified their fighting across other parts of the front line.\n\n“The number of clashes on the front line is not decreasing,” Hetman said. “If they wanted to stop the war, their actions certainly don’t show it.”\n\nRussia ramped up reconnaissance missions to find and destroy firing positions, drone systems and other capabilities that could impede a future onslaught, two Ukrainian commanders said.\n\n“These can be all signs that an attack is being prepared in the near future,” Hetman said.\n\nThe Russian Defense Ministry on Saturday also claimed that its troops had taken a village in Ukraine’s Sumy region, across the border from Kursk. Zelenskyy earlier named the province as one of the targets for a Russian spring offensive. The Russian claim could not be independently verified, and Ukraine did not comment.\n\nFighting also intensified in the eastern city of Pokrovsk, one of Ukraine’s main defensive strongholds and a key logistics hub in the Donetsk region. Its capture would bring Russia closer to its stated aim of capturing the entire region.\n\n“The Russians were significantly exhausted over the past two months. During 10 days of March, they took a sort of pause,” military spokesman Maj. Viktor Trehubov said of the situation in Pokrovsk. In mid-March, the attack resumed. “This means the Russians have simply recovered.”\n\nPolice officers carry the body of a person killed by a Russian drone strike in a residential neighborhood in Zaporizhzhia, Ukraine, Friday, March 21, 2025. (AP Photo/Kateryna Klochko)\n\nPolice officers carry the body of a person killed by a Russian drone strike in a residential neighborhood in Zaporizhzhia, Ukraine, Friday, March 21, 2025. (AP Photo/Kateryna Klochko)\n\nA Ukrainian soldier with the call sign “Italian” said Russia was conducting intensive reconnaissance in his area of responsibility in the Pokrovsk region. Radio intercepts and intelligence show a buildup of forces in the area around Selidove, a city in the Pokrovsk region, and the creation of ammunition reserves, he said.\n\nThe buildup includes large armored vehicles, and the many new call signs overheard in radio transmissions suggest that fresh forces are coming in, he said.\n\nFarther south, a military blog run by Mikhail Zvinchuk, a former officer of the Russian Defense Ministry’s press section, noted last week that Russian troops recently unleashed a new offensive west of Orikhiv in the Zaporizhzhia region.\n\nThe offensive will allow Russian forces to move toward the city of Zaporizhzhia and “force the enemy to redeploy its troops from other sectors, leaving Robotyne and Mala Tokmachka badly protected,” the blog known as Rybar said, adding that the new offensive “could be the first step toward the liberation of the Zaporizhzhia region.”\n\nOn Friday, Vladyslav Voloshyn, a spokesman for the Southern Defense Forces of Ukraine, said the situation in the region is fraught after Russia amassed more forces to conduct assaults with small groups of infantry.\n\nRussian analysts project optimism that a future offensive will succeed.\n\n“Both sides are actively preparing for the spring-summer campaign,” Sergey Poletaev, a Moscow-based military analyst, wrote in a recent commentary. “There’s a growing sense that the Ukrainian forces may be struggling to prepare for it adequately.”\n\nIn this combination of file photos, President Donald Trump, left, and Ukraine’s President Volodymyr Zelenskyy, center, are seen at the Elysee Palace, Dec. 7, 2024 in Paris, and President Vladimir Putin, right, addresses a Technology Forum in Moscow, Russia, Feb. 21, 2025. (AP Photo/Aurelien Morissard, left and center, Pavel Bednyakov, right, File)\n\nIn this combination of file photos, President Donald Trump, left, and Ukraine’s President Volodymyr Zelenskyy, center, are seen at the Elysee Palace, Dec. 7, 2024 in Paris, and President Vladimir Putin, right, addresses a Technology Forum in Moscow, Russia, Feb. 21, 2025. (AP Photo/Aurelien Morissard, left and center, Pavel Bednyakov, right, File)\n\nMeanwhile at the negotiating table, Russian demands have curtailed the results of much-anticipated negotiations brokered by the U.S.\n\nEarlier this month, after Russia effectively turned down the U.S. proposal for a complete, monthlong halt in the fighting, Moscow tentatively agreed to a partial ceasefire on Black Sea shipping routes.\n\nBut that agreement was quickly cast into doubt by Russia’s insistence on far-reaching conditions that its state bank be reconnected to the SWIFT international payment system, something Kyiv and the EU rejected outright.\n\nAlong the front line, the reported ups and downs of the talks fuel frustration and worry.\n\n“No one believes in them,” said the Ukrainian soldier known as Italian, who spoke on the condition that he be identified only by his call sign in keeping with military protocol. “But there is still hope that the conflict will move in another direction. Everyone is waiting for some changes in the combat zone because it is not good for us now. We really don’t want to admit that.”\n\nAssociated Press journalists Volodymyr Yurchuk and Dmytro Zhyhinas contributed to this report."
  }
]