[
  {
    "title": "War in Ukraine: Key weeks ahead for Russia’s offensive in Ukraine",
    "url": "",
    "formatted_content": "Russia's summer offensive in Ukraine has begun, with forces pushing into the Kharkiv region. The goal is unclear, but options include creating a buffer zone, pushing deeper into Ukraine, or capturing the city of Kharkiv. Ukraine's military is outgunned and outnumbered, but has shown resilience in the past. The US and other Western countries are providing aid to Ukraine, but the outcome of the conflict remains uncertain."
  },
  {
    "title": "Fact-checking Donald Trump's claims about war in Ukraine",
    "url": "",
    "formatted_content": "US President Donald Trump made several claims about Ukraine and the war with Russia, including that President Volodymyr Zelensky is a 'dictator without elections' and that Ukraine's approval rating is 4%. Fact-checking reveals that these claims are largely false. Ukraine has been under martial law since the Russian invasion, and elections are suspended. Zelensky's approval rating has dropped, but it is still high. Trump's comments have been seized upon by Russian media, which has used them to undermine Zelensky's legitimacy."
  },
  {
    "title": "Zelensky willing to give up presidency in exchange for Ukraine Nato membership",
    "url": "",
    "formatted_content": "Ukrainian President Volodymyr Zelensky has said he is willing to give up his presidency in exchange for peace and Ukraine's membership in Nato. This comes after US President Donald Trump called Zelensky a 'dictator without elections'. Zelensky has also criticized Ukraine's exclusion from US-Russia talks, saying Trump is 'living in a disinformation space' governed by Moscow. The war in Ukraine will enter its fourth year on Monday, with diplomatic wrangling over a potential peace deal continuing."
  },
  {
    "title": "What are Putin's conditions for a ceasefire in Ukraine?",
    "url": "",
    "formatted_content": "Russian President Vladimir Putin has expressed support for a ceasefire in Ukraine, but has outlined several conditions that must be met before Moscow can agree to a truce. These conditions include resolving the status of Ukrainian troops in the Russian region of Kursk, preventing Ukraine from mobilizing new forces during the ceasefire, and ensuring that the ceasefire is monitored and enforced. The US and Ukraine have reacted cautiously to Putin's comments, with the US expressing willingness to engage in negotiations and Ukraine warning that Putin's conditions are unacceptable."
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,128",
    "url": "",
    "formatted_content": "The conflict between Russia and Ukraine continues, with both sides reporting attacks and casualties. Ukraine's air force has shot down 42 Russian drones, while Russia has accused Ukraine of launching attacks on energy facilities. The US and Ukraine have agreed to a partial ceasefire, but Russia has expressed concerns about the agreement. Meanwhile, the EU and US are at odds over the terms of the ceasefire, with the EU insisting that sanctions against Russia must remain in place."
  },
  {
    "title": "Russia suffers 'heavy losses' in east Ukraine amid shaky limited ceasefire",
    "url": "",
    "formatted_content": "Russia and Ukraine have agreed to a partial ceasefire, but the agreement is fragile and both sides are accusing each other of violating its terms. Russia has suffered heavy losses in eastern Ukraine, with Ukrainian forces reporting that they have killed or wounded hundreds of Russian soldiers. Meanwhile, the US and EU are at odds over the terms of the ceasefire, with the EU insisting that sanctions against Russia must remain in place."
  },
  {
    "title": "The UN's top court says it has jurisdiction in part of Ukraine's genocide case against Russia",
    "url": "",
    "formatted_content": "The International Court of Justice has jurisdiction to rule on a request by Ukraine for a declaration that Kyiv is not responsible for genocide, but not on other aspects of a Ukrainian case against Russia. The court will rule on whether Ukraine violated the genocide convention, which Russia claimed to justify its invasion. Ukraine hailed the ruling as a victory, while Russia denied any wrongdoing."
  },
  {
    "title": "Russia-Ukraine war: At least three killed after Moscow targets Kyiv with mass drone attack",
    "url": "",
    "formatted_content": "Russia launched a barrage of drones across Ukraine overnight, killing at least seven people, including a 5-year-old child. The attacks struck the capital, Kyiv, and several other regions. Ukrainian air defenses shot down 97 drones, while 25 others didn't reach targets due to Ukrainian countermeasures. The attacks came ahead of ceasefire negotiations in Saudi Arabia."
  },
  {
    "title": "US says it brokered deal to end fighting in the Black Sea in talks with Ukraine and Russia",
    "url": "",
    "formatted_content": "The United States said it had reached a tentative agreement for Ukraine and Russia to stop fighting and ensure safe navigation in the Black Sea. The deal is conditional on lifting some Western sanctions and restoring Russia's access to the world market for agricultural and fertilizer exports. Ukraine's President Volodymyr Zelenskyy praised the talks as a step towards a peaceful settlement, but warned that significant uncertainties remain."
  }
]