[
  {
    "title": "Donald Trump 'very angry' with Vladimir Putin over ceasefire negotiations",
    "url": "https://www.bbc.com/news/articles/c20x7z36d56o",
    "formatted_content": "Donald Trump has said he is \"very angry\" and \"pissed off\" with Russian President Vladimir Putin after weeks of attempting to negotiate a ceasefire in Ukraine.\n\nIn an NBC News interview, the US president criticised Putin for attacking Ukrainian President Volodymyr Zelensky's credibility, and threatened to impose a 50% tariff on countries buying Russian oil if he did not agree to a ceasefire.\n\nLast week, Putin suggested the possibility of a UN-run government in Ukraine to organise new elections and then begin peace talks.\n\nTrump's comments mark a change in tone towards Putin. Over the past six weeks, Trump has publicly harangued Zelensky and demanded numerous concessions from Ukraine's president.\n\nOn Sunday, he accused Zelensky of \"trying to back out of\" a deal to share Ukraine's rare minerals with the US and warned of \"big, big problems\" head should that be the case.\n\nIn turn, Trump has flattered Putin and largely given in to the Russian president's demands.\n\nEuropean leaders had worried that Trump was cosying up to Putin.\n\nBut Trump's comments on Sunday appeared to be a departure from that dynamic.\n\nIt is the first time the US has seriously threatened Russia with consequences for dragging its feet in ceasefire negotiations, which would seem to put the diplomatic ball back in Moscow's court.\n\nNBC News reported that, in a 10-minute phone interview, Trump said he was very angry and \"pissed off\" when Putin criticised the credibility of Zelensky's leadership, although the president has himself called Ukraine's leader a dictator and demanded that he hold elections.\n\n\"You could say that I was very angry, pissed off, when... Putin started getting into Zelensky's credibility, because that's not going in the right location,\" Trump said.\n\n\"New leadership means you're not gonna have a deal for a long time,\" he added.\n\nWhen speaking about Putin, Trump said that the Kremlin knew of his anger, but noted that he had \"a very good relationship\" with the Russian leader and \"the anger dissipates quickly... if he does the right thing\".\n\nIf Russia does not follow through with a ceasefire, Trump threatened to target its economy further if he thought it was Putin's fault.\n\n\"If Russia and I are unable to make a deal on stopping the bloodshed in Ukraine, and if I think it was Russia's fault - which it might not be... I am going to put secondary tariffs... on all oil coming out of Russia,\" he said.\n\n\"There will be a 25% tariff on oil and other products sold in the United States, secondary tariffs,\" Trump said, noting that the tariffs on Russia would come in a month without a ceasefire deal.\n\nSecondary tariffs are sanctions on countries that do business with another country. They could constitute up to 50% on goods entering the US from countries still buying oil from Russia. The biggest such buyers by a long margin are China and India.\n\nZelensky wrote on social media following the interview that \"Russia continues looking for excuses to drag this war out even further\".\n\nHe said that \"Putin is playing the same game he has since 2014\", when Russia unilaterally annexed the Crimean peninsula.\n\n\"This is dangerous for everyone - and there should be an appropriate response from the United States, Europe, and all our global partners who seek peace.\"\n\nLater, Trump said he thought Zelensky was trying to renegotiate the US-Ukraine minerals deal.\n\n\"If he does that he's got some problems,\" he told reporters on board Air Force One.\n\nZelensky previously said he was ready to sign the agreement.\n\nIt was expected to be signed in February but was derailed by the pair's explosive meeting at the White House.\n\nTrump suggested on Sunday that Zelensky wanted to change the deal to get better security guarantees.\n\n\"He wants to be a member of Nato. Well, he was never going to be a member of Nato. He understands that.\"\n\nAlso during the flight, Trump appeared to soften his remarks about Putin.\n\n\"I don't think he's going to go back on his word,\" he told reporters on his flight back to Washington.\n\n\"I've known him for a long time. We've always gotten along well.\"\n\nThe US president said he would speak to Putin later in the week.\n\nMoscow says the current Ukrainian authorities are illegitimate as President Zelensky has stayed in power beyond the end of his term and is therefore not a valid negotiating partner.\n\nBut Zelensky has stayed because elections have been put on hold, legally by martial law and practically by the chaos of war.\n\nIt would be almost impossible to hold a valid election with more than five million Ukrainian citizens displaced overseas and many hundreds of thousands away from home fighting on the front line.\n\nRussia launched a full-scale invasion of its neighbour, Ukraine, in February 2022. It currently controls about 20% of Ukrainian territory.\n\nMore than 100,000 people fighting for Russia's military have now died as the war in Ukraine enters the fourth year, according to data analysed by BBC Russian, independent media group Mediazona and volunteers who have been counting deaths since the war began.\n\nUkraine last updated its casualty figures in December 2024, when President Volodymyr Zelensky acknowledged 43,000 Ukrainian deaths among soldiers and officers. Western analysts believe this figure to be an under-estimate.\n\nAlso in the NBC interview on Sunday, Trump said he was \"not joking\" when he said he would not rule out seeking a third term in the White House, despite it being prohibited by the US Constitution.\n\n\"A lot of people want me to do it,\" Trump said. \"But, I mean, I basically tell them we have a long way to go.\"\n\nDuring the call with NBC, he also again threatened to bomb Iran if it did not agree to a nuclear deal. Trump earlier this month sent a letter to the regime demanding negotiations.\n\n\"It will be bombing the likes of which they have never seen before,\" he said, noting he would also impose secondary tariffs.\n\nOn Sunday, Iran's president Masoud Pezeshkian said the country would not enter into direct negotiations with Washington concerning their nuclear programme, but indirect talks were possible.\n\n\"We don't avoid talks; it's the breach of promises that has caused issues for us so far,\" he said. \"They must prove that they can build trust.\""
  },
  {
    "title": "Russia still 'working with US' after Trump says he is 'angry' with Putin",
    "url": "https://www.bbc.com/news/articles/czd31157m31o",
    "formatted_content": "Russia says it is still \"working with the US\" after President Trump said he was \"angry\" and \"pissed off\" with Vladimir Putin.\n\nIn its first response to Trump's criticism of the Russian president, the Kremlin tried to play down the tensions between the two leaders.\n\n\"We continue working with the US side, first of all, on building our relations,\" spokesman, Dmitry Peskov, said.\n\nHe said there were no plans for a call between Putin and Trump this week, but that Putin is open to one \"if necessary\".\n\nThe attempt to smooth things over came after Trump told NBC News on Sunday that he was angry with Putin for attacking Ukrainian President Volodymyr Zelensky's credibility, and threatened to impose a 50% tariff on countries buying Russian oil if Putin did not agree to a ceasefire.\n\nIt was a marked change of tone towards the Russian president.\n\nUS and Russian officials have been in talks for several weeks to try to reach a deal to end the war in Ukraine - during which Trump has often criticised Zelensky but not Putin.\n\nBut Trump's anger with Putin was sparked when the Russian president on Friday mooted the idea of an interim government in Ukraine under the support of the UN which could replace President Zelensky.\n\n\"You could say that I was very angry, pissed off, when... Putin started getting into Zelensky's credibility, because that's not going in the right location,\" Trump told NBC News.\n\n\"New leadership means you're not gonna have a deal for a long time,\" he added.\n\nIn his daily conference call on Monday with journalists, Peskov claimed some of what was said in the NBC interview was \"paraphrased.\"\n\nThe comments from Trump were reflected in parts of the Russian media.\n\nThe pro-Kremlin Russian newspaper, Moskovsky Komsomolets, published some rare criticism of the US president, saying Trump was not fulfilling his \"obligations\" to stop Ukraine striking Russian energy infrastructure.\n\n\"All agreements on the level of President Trump are only worth a few pennies on market day\" the newspaper concluded, while \"Moscow is prepared to make a deal with the US president.\""
  },
  {
    "title": "Trump updates: US president says Russia’s Putin wants Ukraine war ‘settled’ | Donald Trump News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/liveblog/2025/3/7/trump-live-us-president-says-sent-letter-to-iran-to-negotiate-nuclear-deal",
    "formatted_content": "This live page is now closed."
  },
  {
    "title": "Why is Trump ‘very angry’ with Putin and who will secondary tariffs hurt? | Donald Trump News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/31/why-is-trump-very-angry-with-putin-and-who-will-secondary-tariffs-hurt",
    "formatted_content": "United States President Donald Trump said on Sunday that he was “p***** off” at his Russian counterpart, Vladimir Putin, and would slap additional financial penalties on the sale of Russian oil if he did not agree to a ceasefire in Ukraine.\nThe comments marked a sharp change in tone from Trump, who has been open to peace negotiations with Moscow since his second term began in January.\nHere is more about what happened, what Trump’s threat could involve, and why this is significant for Putin’s war on Ukraine, and for countries that buy Russian oil.\n\n## What did Trump say about Putin?\n\nDuring an interview with NBC on Sunday, Trump said he was “very angry” and “p***** off” over Putin questioning the legitimacy of Ukrainian President Volodymyr Zelenskyy.\nTrump argued that any move seeking to replace Zelenskyy as the leader of Ukraine would inevitably delay the prospects of a ceasefire.\nHowever, Trump did add that Putin knew he was angry with him. He said he and Putin had “a very good relationship” and “the anger dissipates quickly … if he does the right thing”.\n\n## What had Putin said about Zelenskyy?\n\nPutin said Zelenskyy lacked the legitimacy to sign a peace agreement.\nThe Russian leader has frequently claimed that the Ukrainian government is illegitimate, ever since the 2014 overthrow of Moscow-leaning President Viktor Yanukovych, whom the Kremlin claims had US backing.\nPutin suggested on Thursday that a temporary administration be established in Ukraine under the supervision of the United Nations. This proposal was rejected by UN Secretary-General Antonio Guterres.\nZelenskyy was sworn in as the president of Ukraine in 2019 for a five-year term. The war broke out following Russia’s full-scale invasion of Ukraine in February 2022. While Ukraine was supposed to have presidential elections in 2024, the country has been under martial law due to the war, and its constitution does not allow it to hold elections under martial law conditions.\nThough Trump has now criticised Putin for questioning Zelenskyy’s legitimacy as Ukraine’s president, the American leader did the same not long ago.\nIn February, amid tensions with the Ukrainian leader, Trump described Zelenskyy as “ A Dictator without Elections ” in a post on his Truth Social platform.\n\n## What is the state of diplomatic efforts to end the Ukraine war?\n\nDuring his presidential election campaign, Trump promised that he would bring the Ukraine war to a prompt halt.\nSince his inauguration, US negotiating teams have separately met Russian and Ukrainian teams multiple times in Saudi Arabia to discuss peace terms. Trump has also separately spoken to Putin and Zelenskyy since then.\nThe three sides agreed on March 25 to stop using military force in the Black Sea. They also agreed to pause attacks on energy infrastructure in Russia and Ukraine for 30 days. However, both sides have accused each other of violating this and attacking energy facilities.\nUkraine and the US had agreed to a 30-day complete ceasefire on land and sea, which is pending Russia’s approval. Putin has not signed this proposal, citing reservations that Ukraine might use the period to rearm itself — including with supplies of cutting-edge Western weapons — and mobilise more soldiers at a time when it faces a manpower shortage.\n\n## What has Trump threatened — and will it work?\n\nTrump has threatened “secondary tariffs” on Russian oil if he deems Moscow responsible for not reaching a ceasefire agreement.\n“If Russia and I are unable to make a deal on stopping the bloodshed in Ukraine, and if I think it was Russia’s fault – which it might not be – but if I think it was Russia’s fault, I am going to put secondary tariffs on all oil coming out of Russia,” said Trump during the NBC interview.\n“That would be that if you buy oil from Russia, you can’t do business in the United States. There will be a 25 percent tariff on all oil, a 25 to 50-point tariff on all oil.”\nKeir Giles, a senior consulting fellow at the London-based Chatham House think tank, told Al Jazeera that it is unclear whether these threats would place pressure on Russia.\n“We have seen sporadic threats by Trump to impose some kind of economic pressure on Russia but they never last long,” said Giles, adding it would be a “radical departure” from his past approach towards the war if Trump were to impose pressure on Moscow, rather than on Kyiv.\n“We do not know if this threat is empty, but the previous ones have been, and Putin knows that,” Giles said.\n\n## What are secondary tariffs?\n\nBy “secondary tariffs” Trump appears to mean tariffs on imports from countries that buy Russian oil.\nThe US has long led campaigns of what are known as secondary sanctions — in which countries that trade with a sanctioned country also face sanctions. For instance, secondary sanctions are in place against the purchase of Iranian oil or heavy military equipment from Russia: countries, companies and individuals that engage in this trade are at risk of US sanctions.\nThe threat of secondary US sanctions is also why most global banks and financial institutions no longer participate in trade with Russia or Iran — they do not want to risk losing out on business in the US.\nBy contrast, secondary tariffs are relatively untested as a phenomenon. Last week, Trump also imposed a 25 percent secondary tariff on US imports from any country buying oil and gas from Venezuela.\n\n## Which countries could Trump’s secondary tariffs hurt?\n\nIf Trump imposes secondary tariffs on Russian oil, India and China could be hit particularly hard.\nIndia and China are the two biggest buyers of inexpensive Russian crude.\nRussian oil constituted 35 percent of India’s overall crude imports in 2024, while it made up 19 percent of China’s oil imports. Turkiye is also an importer of Russian oil — in 2023, as much as 58 percent of its refined petroleum imports came from Russia.\n\n## How much would secondary tariffs bleed China, India and Turkiye?\n\nIf Trump were to impose these tariffs, it is unclear whether they would be added to existing tariffs or if they would absorb other tariffs already in force.\nThe US is China’s single biggest export market. In 2024, China sold goods worth $463bn to the US. But Trump has already imposed 20 percent tariffs on all imports from China.\nIndia too counts the US as its biggest export market. Indian exports to the US stood at $91bn in 2024. However, Trump has repeatedly railed against India’s high tariffs on US imports.\nTurkiye is relatively less exposed. The US is its second-largest export market, after Germany, at $17bn in 2024.\nHowever, Trump has threatened reciprocal, tit-for-tat tariffs from April 2 against all US trading partners.\nAnd if Trump truly cracks down on countries that buy Russian oil, India in particular could find itself under Washington’s scrutiny. That is because India — which has 22 oil refineries, including the world’s largest in Jamnagar in the western state of Gujarat — has long been accused of buying subsidised Russian oil, refining it, and selling it to the West, effectively helping Moscow undercut Western sanctions.\nIn 2023, India exported $55.8bn worth of refined oil products such as petrol and diesel to countries including the US, the United Kingdom, France and Belgium that otherwise have strict sanctions on the import of Russian crude, according to data from the Observatory of Economic Complexity (OEC).\nFollowing Canada, India is the second largest exporter of refined oil to the US, making up 7.5 percent of US oil exports as of 2023, OEC data shows.\nBut India has long argued that by buying Russian oil, it has freed up crude from other sources, such as the Middle East and Africa, for Western nations to buy, keeping global oil prices under control. If oil from Russia — a leading producer — were no longer available to anyone, every nation would need to scramble for limited supplies of crude from elsewhere, driving up prices."
  },
  {
    "title": "Trump finds fault with both Putin and Zelenskyy as he tries to push for deal to end war in Ukraine",
    "url": "https://apnews.com/article/russia-ukraine-war-drones-kharkiv-offensive-1d2f793cc99798b0e491b9dde8e0cee0",
    "formatted_content": "## Russian drones hit Ukraine’s 2nd largest city Kharkiv\n\n## ___\n\nWASHINGTON (AP) — President Donald Trump lashed out at both Vladimir Putin and Volodymyr Zelenskyy on Sunday, expressing frustration with the Russian and Ukrainian leaders as he struggles to forge a truce to end the war.\n\nPresident Donald Trump arrives on Air Force One at Palm Beach International Airport, Friday, March 28, 2025, in West Palm Beach, Fla. (AP Photo/Manuel Balce Ceneta)\n\nPresident Donald Trump arrives on Air Force One at Palm Beach International Airport, Friday, March 28, 2025, in West Palm Beach, Fla. (AP Photo/Manuel Balce Ceneta)\n\nAlthough Trump insisted to reporters that “we’re making a lot of progress,” he acknowledged that “there’s tremendous hatred” between the two men, a fresh indication that negotiations may not produce the swift conclusion that he promised during the campaign.\n\nTrump began voicing his criticisms in an early morning interview with NBC News while he was at Mar-a-Lago, his private club in Florida. He said he was “angry, pissed off” that Putin questioned Zelenskyy’s credibility.\n\nThe Russian leader recently said that Zelenskyy lacks the legitimacy to sign a peace deal and suggested that Ukraine needed external governance.\n\nRussian President Vladimir Putin chairs the Security Council meeting via videoconference in Moscow, Russia, Friday, March 28, 2025. (Sergei Ilyin, Sputnik, Kremlin Pool Photo via AP)\n\nRussian President Vladimir Putin chairs the Security Council meeting via videoconference in Moscow, Russia, Friday, March 28, 2025. (Sergei Ilyin, Sputnik, Kremlin Pool Photo via AP)\n\nTrump said he would consider adding new sanctions on Russia, which already faces steep financial penalties, and using tariffs to undermine its oil exports.\n\nThe Republican president rarely criticizes Putin, and he’s previously attacked Zelenskyy’s credibility himself. For example, Trump has suggested that Ukraine caused the war that began with a Russian invasion three years ago, and he’s insisted that Zelenskyy should hold elections even though it’s illegal under Ukraine’s constitution to do so during martial law.\n\nOn his flight back to Washington on Sunday evening, Trump reiterated his annoyance toward Putin but somewhat softened his tone.\n\n“I don’t think he’s going to go back on his word,” he said. “I’ve known him for a long time. We’ve always gotten along well.”\n\nAsked when he wanted Russia to agree to a ceasefire, Trump said there was a “psychological deadline.”\n\n“If I think they’re tapping us along, I will not be happy about it,” he said.\n\nTrump soon pivoted to criticize Zelenskyy.\n\n“He’s trying to back out of the rare earth deal, ” Trump said, referring to negotiations over U.S. access to critical minerals in Ukraine. “And if he does that he’s got some problems. Big, big problems.”\n\nTrump and Zelenskyy were supposed to sign the deal when the Ukrainian leader visited the White House. However, their meeting ended with acrimony that played out in front of television cameras in the Oval Office.\n\nTrump suggested on Sunday that Zelenskyy wanted to “renegotiate the deal” to get better security guarantees.\n\n“He wants to be a member of NATO,” he said. “Well, he was never going to be a member of NATO. He understands that.”\n\nThe U.S. has been pushing for a comprehensive ceasefire deal between Russia and Ukraine to peacefully end their 3-year-old war.\n\nRussia has effectively rejected a U.S. proposal for an immediate and full 30-day halt in the fighting, and the feasibility of a partial ceasefire on the Black Sea was thrown into doubt after Kremlin negotiators imposed far-reaching conditions.\n\nTrump’s comments on Putin come after weeks of intense pressure on Ukraine to agree to a ceasefire.\n\nA man looks at a car destroyed in a Russian strike on Kharkiv, Ukraine, Saturday, March 29, 2025. (AP Photo/Andrii Marienko)\n\nA man looks at a car destroyed in a Russian strike on Kharkiv, Ukraine, Saturday, March 29, 2025. (AP Photo/Andrii Marienko)\n\nMeanwhile, Russian drones hit a military hospital, shopping center and apartment blocks in Ukraine’s second-largest city of Kharkiv, killing two people and wounding dozens.\n\nUkraine’s General Staff denounced the “deliberate, targeted shelling” of the military hospital late Saturday. Among the casualties were service members who were undergoing treatment, it said. Regional Gov. Oleh Syniehubov said those killed were a 67-year-old man and a 70-year-old woman.\n\nPolice officers look at a crater made by a drone near apartment houses following Russia’s night attack in Kharkiv, Ukraine, late Saturday, March 29, 2025. (AP Photo/Yevhen Titov)\n\nPolice officers look at a crater made by a drone near apartment houses following Russia’s night attack in Kharkiv, Ukraine, late Saturday, March 29, 2025. (AP Photo/Yevhen Titov)\n\nAccording to Ukrainian government and military analysts, Russian forces are preparing to launch a fresh military offensive in the coming weeks to maximize pressure on Kyiv and strengthen the Kremlin’s negotiating position in ceasefire talks.\n\nUkraine’s air force reported that Russia fired 111 exploding drones and decoys in the latest wave of attacks overnight into Sunday. It said 65 of them were intercepted and another 35 were lost, likely having been electronically jammed.\n\nZelenskyy said Sunday that over the past week “most regions of Ukraine” came under Russian attack. Writing on X, he said “1,310 Russian guided aerial bombs, over 1,000 attack drones — mostly ‘Shaheds’ — and nine missiles of various types, including ballistic ones” had been launched against Ukraine.\n\nUkrainian President Volodymyr Zelenskyy speaks during a briefing in Kyiv, Ukraine, Friday, March 28, 2025. (AP Photo/str)\n\nUkrainian President Volodymyr Zelenskyy speaks during a briefing in Kyiv, Ukraine, Friday, March 28, 2025. (AP Photo/str)\n\nZelenskyy also repeated his assertion that “Russia is dragging out the war,” echoing comments he made Thursday in Paris that Russia is prolonging ceasefire talks “just to buy time and then try to grab more land.”\n\nRussia’s Ministry of Defense, meanwhile, said its air defense systems shot down six Ukrainian drones. It also claimed Sunday that its troops had taken control of a village in Ukraine’s partly occupied Donetsk region. The Russian claim could not be independently verified, and Ukraine did not comment.\n\nWith reporting from Kyiv, Ukraine."
  },
  {
    "title": "Iran has rejected direct negotiations with the US in response to Trump's letter",
    "url": "https://apnews.com/article/iran-rejects-direct-negotiations-trump-letter-us-c414743a567c574b6f48f64a2e889f31",
    "formatted_content": "## Iran’s position hardens after Trump’s letter\n\n## Iran’s rejection is the latest in tensions over nuclear program\n\n## ___\n\nDUBAI, United Arab Emirates (AP) — Iran’s president said Sunday that the Islamic Republic rejected direct negotiations with the United States over its rapidly advancing nuclear program, offering Tehran’s first response to a letter that U.S. President Donald Trump sent to the country’s supreme leader.\n\nPresident Masoud Pezeshkian said that Iran’s response, delivered via the sultanate of Oman, left open the possibility of indirect negotiations with Washington. However, such talks have made no progress since Trump in his first term unilaterally withdrew the U.S. from Tehran’s nuclear deal with world powers in 2018.\n\nIn the years since, regional tensions have boiled over into attacks at sea and on land. Then came the Israel-Hamas war in the Gaza Strip, which saw Israel target militant group leaders across Iran’s self-described “Axis of Resistance.” Now, as the U.S. conducts intense airstrikes targeting the Iranian-backed Houthi rebels of Yemen, the risk of military action targeting Iran’s nuclear program remains on the table.\n\n“We don’t avoid talks; it’s the breach of promises that has caused issues for us so far,” Pezeshkian said in televised remarks during a Cabinet meeting. “They must prove that they can build trust.”\n\nThe U.S. State Department, responding to Pezeshkian, said that “President Trump has been clear: the United States cannot allow Iran to acquire a nuclear weapon.”\n\n“The president expressed his willingness to discuss a deal with Iran,” it added. “If the Iranian regime does not want a deal, the president is clear, he will pursue other options, which will be very bad for Iran.”\n\nTrump talked about dealing with Iran while flying from Florida to Washington on Sunday evening. “We’ll see if we can get something done,” he told reporters. “And if not, it’s going to be a bad situation.”\n\n“I would prefer a deal to the other alternative which I think everybody in this plane knows what that is, and that’s never going to be pretty,” he said.\n\nHaving Pezeshkian announce the decision shows just how much has changed in Iran, since his election a half-year ago after he campaigned on a promise to reengage with the West.\n\nSince Trump’s election and the resumption of his “maximum pressure” campaign on Tehran, Iran’s rial currency has gone into a freefall. Pezeshkian had left open discussions up until Iran’s 85-year-old Supreme Leader Ayatollah Ali Khamenei came down hard on Trump in February and warned talks “are not intelligent, wise or honorable” with his administration. The Iranian president then immediately toughened his own remarks on the U.S.\n\nMeanwhile, there have been mixed messages coming from Iran for weeks. Videos from Quds, or Jerusalem, Day demonstrations on Friday had people in the crowds instructing participants to only shout: “Death to Israel!” Typically, “Death to America” was also heard.\n\nA video of an underground missile base unveiled by Iran’s hard-line paramilitary Revolutionary Guard also showed its troops stepping on an Israeli flag painted on the ground — though there was no American flag as often seen in such propaganda videos.\n\nBut Press TV, the English-language arm of Iranian state television, published an article last week that included listing U.S. bases in the Middle East as possible targets of attack. The list included Camp Thunder Cove on Diego Garcia in the Indian Ocean, where the U.S. is basing stealth B-2 bombers likely being used in Yemen.\n\n“The Americans themselves know how vulnerable they are,” warned Iranian parliamentary speaker Mohammad Bagher Qalibaf on Friday. “If they violate Iran’s sovereignty, it will be like a spark in a gunpowder depot, setting the entire region ablaze. In such a scenario, their bases and their allies will not be safe.”\n\nHowever, Tehran’s two recent direct attacks on Israel with ballistic missiles and drones caused negligible damage, while Israel responded by destroying Iranian air defense systems.\n\nTrump’s letter arrived in Tehran on March 12. Though announcing that he wrote it in a television interview, Trump offered little detail on what he exactly told the supreme leader.\n\n“I’ve written them a letter saying, ‘I hope you’re going to negotiate because if we have to go in militarily, it’s going to be a terrible thing,’” Trump said in the interview.\n\nThe move recalled Trump’s letter-writing to North Korean leader Kim Jong Un in his first term, which led to face-to-face meetings, but no deals to limit Pyongyang’s atomic bombs and a missile program capable of reaching the continental U.S.\n\nThe last time that Trump tried to send a letter to Khamenei, through the late Japanese Prime Minister Shinzo Abe in 2019, the supreme leader mocked the effort.\n\nTrump’s letter came as both Israel and the United States have warned they will never let Iran acquire a nuclear weapon, leading to fears of a military confrontation as Tehran enriches uranium at near weapons-grade levels of 60% purity — something only done by atomic-armed nations.\n\nIran has long maintained its program is for peaceful purposes, even as its officials increasingly threaten to pursue the bomb. A report in February, however, by the Vienna-based International Atomic Energy Agency, the U.N.’s nuclear watchdog, said that Iran has accelerated its production of near weapons-grade uranium.\n\nIran’s reluctance to deal with Trump likely also takes root in his ordering the attack that killed Iranian Gen. Qassem Soleimani in a Baghdad drone strike in January 2020. The U.S. has said Iran plotted to assassinate Trump over that prior to his election this November, something Tehran denied though officials have threatened him.\n\nVahdat reported from Tehran, Iran. Associated Press writer Chris Megerian in Washington contributed."
  }
]