[
  {
    "title": "Blake Lively and Justin Baldoni: What you need to know",
    "url": "https://www.bbc.com/news/articles/cewxj0qw2p9o",
    "formatted_content": "From the moment Justin Baldoni announced in 2019 that he was adapting the best-selling book It Ends With Us into a film, there was a widespread frenzy.\n\nThere are few books in recent years that have become as big a cultural phenomenon as Colleen Hoover's novel - it has sold 20m copies and became an internet sensation on TikTok with more than one billion tags on the app.\n\nWhen Blake Lively, who rose to fame in the 2000s in Gossip Girl, was cast as the main character, fans became even more excited, describing her as the perfect choice to play Lily Bloom, a young woman who grew up witnessing domestic abuse and winds up in the same position years later.\n\nLily, a florist in Boston, navigates a complicated love triangle between her charming but abusive boyfriend Ryle Kincaid - played by Jane the Virgin's Justin Baldoni - and her compassionate first love, Atlas Corrigan (Brandon Sklenar).\n\nReleased last August, the film became a box office success bringing in more than $350m (£280m) globally.\n\nBut despite its financial success, everything wasn't running so smoothly behind the scenes. Rumours of a feud between Baldoni and Lively began swirling before the film was even released.\n\nIn December, Lively filed a legal complaint against her co-star, accusing him of sexual harassment and starting a smear campaign against her. Baldoni strongly denies that and has sued her in response.\n\nHere is the story so far:\n\nIt Ends With Us press tour\n\nFor a film about domestic abuse, the press tour for It Ends With Us was probably not what you would have expected. There were pink carpets, flowers galore and the promotion of Lively's new haircare brand and her husband's gin company.\n\nInstead of advocacy on the red carpet, Lively highlighted fashion and florals.\n\nAt the London premiere, press were told to keep questions \"fun and light-hearted\" with one event organiser telling me to \"steer away from questions on domestic abuse\".\n\nOne of her remarks made at the New York premiere - \"you are so much more than just a survivor or just a victim\" - sparked backlash on social media.\n\nDomestic abuse survivor Ashley Paige criticised Ms Lively's language and told the BBC that Lively was promoting the film like it's \"the sequel to Barbie\".\n\nLively was also criticised for her comments in another clumsy promotional tour video where she said: \"Grab your friends, wear your florals and head out to see it.\"\n\nJustin Baldoni's absence\n\nAlongside the press tour being described as \"tone-deaf\", people started asking questions about why the Lively and Baldoni weren't photographed on the red carpet together at the film's New York premiere.\n\nThe pair also did no interviews together during the press tour and at the London premiere, which Baldoni didn't attend, I was warned by Lively's team to not \"ask any questions about Justin\".\n\nInternet sleuths also spotted that cast members including Lively and author Hoover did not follow Baldoni on social media.\n\nNeither Lively or Baldoni addressed rumours of a feud during the press tour and the only reference to each other was Baldoni telling Today that his co-star was a \"dynamic creative\".\n\n\"She had her hands in every part of this production, and everything she touched made [it] better,\" he said about the 37-year-old.\n\n'Smear campaign'\n\nDuring the film's press tour, Baldoni hired a crisis manager, Melissa Nathan, whose previous clients include Johnny Depp and Drake.\n\nShortly after the press tour, Lively faced a barrage of criticism on social media relating to her comments on that tour as well as from old interviews.\n\nOne of the interviews to resurface was one shared by a Norwegian journalist, Kjersti Flaa, who posted a video on YouTube of her interviewing Lively in 2016. It was titled \"The Blake Lively interview that made me want to quit my job.\"\n\nFlaa has since said she had \"nothing to do with Justin Baldoni and his smear campaign\".\n\nActor Brandon Sklenar, who plays Atlas in the film, defended Lively and said in a post on Instagram that people had been \"vilifying\" the women involved in the film online.\n\nHe said it was \"disheartening to see the amount of negativity being projected\" and that someone close to him who had experienced a relationship similar to Lily's had credited the film with \"saving her life\".\n\nLegal complaint\n\nFour months after the film's launch, Lively filed a legal complaint against Mr Baldoni in which she accused him of sexual harassment.\n\nThe complaint also listed Wayfarer Studios, Mr Baldoni's production company which produced It Ends With Us, as a defendant.\n\nThe legal filing accuses Mr Baldoni and Wayfarer CEO Jamey Heath of \"repeated sexual harassment and other disturbing behaviour\". Some other female cast and crew had also spoken up about their conduct, the filing alleges.\n\nIt also alleges that Ms Lively, Mr Baldoni and other people involved in the development of the film attended a meeting in January to address \"the hostile work environment\" on set. Her husband, actor Ryan Reynolds, attended the meeting alongside her, according to the complaint.\n\nAt the meeting, attendees agreed to a list of demands, including Mr Baldoni and Mr Heath making \"no more descriptions of their own genitalia\", requiring an intimacy coordinator on set at all times when Ms Lively was in scenes with Mr Baldoni and no \"friends\" of the producers and directors being on set during scenes when Ms Lively was in a state of nudity.\n\nThe list of demands also implied that Mr Baldoni had asked Ms Lively's trainer how much she weighed and alleged that Mr Baldoni and Mr Heath had spoken about their \"pornography addiction\" to Ms Lively.\n\nPlan to 'destroy' reputation\n\nIn the filing, Ms Lively also alleges that Mr Baldoni and his team attacked her public image after the meeting.\n\nShe accuses him of orchestrating a plan to \"destroy\" her reputation in the press and online, including hiring a crisis manager who led a \"sophisticated, coordinated, and well-financed retaliation plan\" against her and used a \"digital army\" to post social media content that seemed authentic.\n\n\"To safeguard against the risk of Ms Lively ever revealing the truth about Mr Baldoni, the Baldoni-Wayfarer team created, planted, amplified, and boosted content designed to eviscerate Ms Lively's credibility,\" her team wrote in the filing.\n\nIt adds: \"They engaged in the same techniques to bolster Mr Baldoni's credibility and suppress any negative content about him.\"\n\nIn the filing, Ms Lively says that this had led to \"substantial harm\" that affected \"all aspects\" of her life.\n\nMr Baldoni's legal team told the BBC the allegations are \"categorically false\" and said they hired a crisis manager because Ms Lively had threatened to derail the film unless her demands were met.\n\nResponding to the legal complaint, Mr Baldoni's lawyer, Bryan Freedman, said on Saturday: \"It is shameful that Ms Lively and her representatives would make such serious and categorically false accusations against Mr Baldoni, Wayfarer Studios and its representatives.\"\n\nMr Freedman accused Ms Lively of making numerous demands and threats, including \"threatening to not show up to set, threatening to not promote the film\", which would end up \"ultimately leading to its demise during release, if her demands were not met\".\n\nSupport for Lively\n\nHollywood stars including America Ferrera, Amber Tamblyn and Alexis Bledel have publicly backed Blake Lively after she filed her complaint.\n\nFerrera, Tamblyn and Bledel, who starred with Lively in 2005 film The Sisterhood of the Traveling Pants, issued a joint statement on Instagram, on Sunday saying they \"stand with her in solidarity\".\n\n\"Throughout the filming of It Ends with Us, we saw her summon the courage to ask for a safe workplace for herself and colleagues on set, and we are appalled to read the evidence of a premeditated and vindictive effort that ensued to discredit her voice,\" they wrote.\n\nColleen Hoover, the author of It Ends With Us, also showed her support, describing Ms Lively as \"honest, kind, supportive and patient\".\n\nBaldoni's award rescinded\n\nIn early December Baldoni was awarded a women's solidarity honour by Vital Voices, a global non-profit organisation that focuses on empowering women.\n\nThe organisation has rescinded the award after the legal complaint filed by Lively alleged \"abhorrent conduct\" by the actor, his studio and a crisis public relations team that it said was \"contrary to the values\" it held.\n\nAnd since the legal complaint, Baldoni's podcast co-host Liz Plank announced she was leaving The Man Enough show.\n\nThe podcast bills itself as creating \"a safe environment\" for exploring issues such as how \"masculinity\" shows up in relationships, as well as \"sex, success\" and \"mental health\".\n\nBaldoni sues New York Times for libel\n\nOn 31 December Baldoni's lawyers filed a $250m libel lawsuit against New York Times over its reporting of Lively's allegations against him.\n\nThe paper published an article on 21 December entitled: \"'We Can Bury Anyone': Inside a Hollywood Smear Machine.\"\n\nBaldoni and nine other plaintiffs including publcist Melissa Nathan accuse the paper of libel and false-light invasion of privacy.\n\nThe lawsuit says the paper \"'cherry-picked' and altered communications stripped of necessary context and deliberately spliced to mislead\".\n\nA New York Times spokesperson said the story was \"meticulously and responsibly reported\" and it plans to \"vigorously defend\" itself.\n\nBaldoni files $400m lawsuit against Lively\n\nOn 16 January, Baldoni filed a lawsuit against Lively and her husband Ryan Ryenolds.\n\nHe's suing them for $400m (£326m) damages on claims of civil extortion, defamation and invasion of privacy.\n\nHis lawyer Bryan Freedman said the actress and her partners had disseminated \"grossly edited, unsubstantiated, new and doctored information to the media\".\n\nHe also said Lively and her team had \"attempted to bulldoze reputations and livelihoods for heinously selfish reasons\".\n\nIn response, Lively's legal team described the lawsuit as \"another chapter in the abuser playbook\".\n\nOut-takes and voicemail released\n\nOn 21 January, Baldoni released three out-takes of a romantic scene from the film as evidence that Lively's claims of sexual harassment are unfounded.\n\nThe video's caption says the footage shows both actors \"clearly behaving well within the scope of the scene and with mutual respect and professionalism\".\n\nHowever, Lively's lawyers said the footage showed him \"repeatedly leaning in toward Ms Lively and attempting to kiss her\".\n\nThey added that every moment was \"improvised by Mr Baldoni with no discussion or consent in advance, and no intimacy co-ordinator present\".\n\n\"Any woman who has been inappropriately touched in the workplace will recognise Ms Lively's discomfort,\" they said.\n\nThe following week, a voicemail of Baldoni apologising to Lively during an exchange about a script rewrite in April 2023 was also released.\n\nA judge has set a date for their case to trial - 9 March 2026.\n\nBaldoni publishes website with timeline of events\n\nBaldoni has published a website called Lawsuit Info with his amended complaint and a timeline of events related to his lawsuits against Lively and New York Times.\n\nPublished on 1 February it contains two legal documents: Baldoni's latest court filings against Lively and Reynolds, and a 168-page document entitled \"timeline of relevant events\" related to the dispute and the production of the film.\n\nThe latter includes alleged text message exchanges between him and Lively.\n\nBaldoni's lawyer, Bryan Freedman, told BBC News that Baldoni amended his lawsuit due \"to the overwhelming amount of new proof that has come to light\".\n\nLively's representatives are yet to comment, but a New York Times spokesperson told BBC News that Baldoni's legal filings were \"rife with inaccuracies\" about the newspaper, \"including, for example, the bogus claim that The Times had early access to Ms Lively's state civil rights complaint\".\n\nFirst court hearing\n\nOn 3 February, a pretrial meeting was held at a federal court in Manhattan.\n\nThe hour-and-a-half hearing became heated as lawyers for each side claimed the other was badmouthing their client outside of court.\n\nJudge Liman said both sides have \"given the public plenty to feast upon\" and added that if the case ended up being \"litigated in the press\", he could be forced to make the March 2026 trial date earlier, so jurors do not become prejudiced against either of the defendants.\n\nHe also said he is barring the lawyers from making statements publicly that could sway the outcome of a trial."
  },
  {
    "title": "Critics Choice Awards: Blake Lively and Justin Baldoni thanked for 'distraction' by host Chelsea Handler",
    "url": "https://www.bbc.com/news/articles/cvgejerj1nvo",
    "formatted_content": "TV host Chelsea Handler \"thanked\" actors Blake Lively and Justin Baldoni at Friday night's Critics Choice Awards during her opening monologue.\n\nThe comedian said that people in Los Angeles and across the country had been \"through a lot lately\", and that it was important in such times to have a \"distraction\".\n\nHandler's remarks were met with laughter by the audience but on social media she was criticised for \"trivialising\" the feud.\n\nLively, 37, sued Baldoni, 41, in December, accusing him of sexual harassment and a smear campaign. Baldoni is counter-suing Lively and her husband, the actor Ryan Reynolds, on claims of civil extortion, defamation and invasion of privacy.\n\nBaldoni is also suing the New York Times for libel. Both parties strongly deny the claims.\n\nHandler began the ceremony, which was held in Santa Monica, by praising the first responders who had tackled the recent deadly wildfires in LA.\n\n\"I want to acknowledge that we've been through a lot lately, not just here in Los Angeles, but our entire country waking up every day, not knowing what news we are going to hear that will disappoint or horrify us,\" she said.\n\n\"So, it is important in times like these to have a distraction. And that's why I want to personally extend my gratitude to Justin Baldoni and Blake Lively.\n\n\"Thank you for providing us with that distraction. I'm grateful... I think everybody in this room, no matter whose side you're on, we can all agree to accept that there's probably not going to be a sequel.\"\n\n\"It ends with us, guys,\" Handler concluded, in a reference to the 2024 film It Ends With Us in which Lively and Baldoni co-starred.\n\nNeither Baldoni or Lively were present at the awards on Friday night.\n\nVideo footage posted online shows the monologue as well received by the audience.\n\nBut on social media, one X user said Handler was \"trivialising\" the feud while another said the jokes were \"in poor taste\".\n\nBig wins for Demi Moore and Anora\n\nMeanwhile, Demi Moore took another leap ahead in the Oscars race, winning best actress at Friday's ceremony.\n\nThe 62-year-old, who also scooped up the award at last month's Golden Globes, has enjoyed a remarkable career resurgence thanks to her role in body horror The Substance.\n\n\"This has been such a wild ride,\" said Moore.\n\nShe thanked critics for celebrating \"this genre of horror films, that are overlooked and not seen for the profundity that they can hold\".\n\nMoore's win came at the expense of Emilia Perez rival Karla Sofia Gascon, whose past tweets caused a significant fallout.\n\nBut the Spanish-language musical did manage to pick up several awards on the night, including best supporting actress for Zoe Saldana.\n\nAnora, a film about a stripper and occasional sex worker who marries the spoiled son of a Russian oligarch, bagged the prize of best picture at the end of the night, having missed out in earlier categories.\n\nAnora's triumph shakes up the race for the most sought-after award at the Oscars next month.\n\nOther wins on the night included Adrian Brody, who won best actor for his role in historical epic The Brutalist, and Jon M. Chu who won best director for Wicked.\n\nConclave won best adapted screenplay."
  },
  {
    "title": "Dark arts in Hollywood - how the publicity smear machine changed",
    "url": "https://www.bbc.com/news/articles/cwyj3vnkyn8o",
    "formatted_content": "The lawsuits between actors Blake Lively and Justin Baldoni have shed light on a secretive group of people in Hollywood who operate behind the scenes to keep a lid on fallouts and scandals. But in recent years their role has shifted - and their challenges multiplied\n\nListen to Steven read this article.\n\n\"She's a phony, but I guess the public likes that…\" This is the line that actress Joan Crawford is said to have declared about film star Bette Davis.\n\nThe back-and-forth sniping between the pair played out in public in the 1930s and 40s. \"Bette is a survivor... She survived herself,\" Crawford also apparently remarked.\n\nTheir tempestuous relationship was so notorious that in 2017 it was made into an Emmy award-winning TV series, Feud.\n\nHollywood rivalries are of course nothing new – yet conflicts today rarely play out so publicly. That might be why the dispute between actors Blake Lively and Justin Baldoni, which spilled out into the open in December 2024, is still in the headlines three months on.\n\nThe subsequent legal battle brought to light a fallout during production of the film It Ends With Us. After the promotional and cinematic run had ended, the pair – who didn't appear on the red carpet together at the premiere in New York – filed lawsuits against each other.\n\nLively has accused Baldoni and others of carrying out a smear campaign against her after she complained about alleged sexual harassment on set. Baldoni, meanwhile, has accused Lively, her husband Ryan Reynolds and their publicist of carrying out a smear campaign against him, and claims that she tried to take over control of the film. Both sides deny all allegations.\n\nWhat emerged as this all played out is that crisis PR managers had been employed. Legal representatives for Lively obtained numerous text messages between Baldoni's publicist Jennifer Abel and the crisis team he retained, led by Melissa Nathan, whose previous clients include Johnny Depp and Drake. Ms Nathan was alleged to have texted Ms Abel, \"You know we can bury anyone.\"\n\nLively has now reportedly taken on the CIA's former deputy chief of staff Nick Shapiro to advise on her legal communications strategy.\n\nWhile the outcomes of the lawsuits remain to be seen, the feud has cast the spotlight on an industry that would ordinarily remain largely invisible: that is, the publicity machine at work behind the scenes in Hollywood.\n\n\"On every set, there are fights, liaisons… there are all sorts of things that go on,\" explains Richard Rushfield, founder and columnist at Hollywood newsletter The Ankler. \"Hollywood is a world full of very messy people coming together for these giant projects, where they put together teams quickly to make these things and disband immediately after.\n\n\"Between all that a lot of stuff goes on, and they deal with it quietly – they're very obsessive about controlling the narrative. When this stuff explodes into the public, beyond control, it makes everyone very nervous.\"\n\nBut the world of the Hollywood PR has shifted in recent years, partly because of the growth of social media, which has changed the relationship between celebrities and fans, bringing them into direct contact and removing some of the mystique.\n\nSo, what does that mean for the people whose job it is to keep a lid on the industry's messy reality?\n\nFrom Tom Hardy to Sarah Jessica Parker\n\nFew fallouts have spilled out into the open in recent years – and those that did were picked over simply because they're so rare. Actor Dwayne Johnson revealed \"a fundamental difference in philosophies on how we approach moviemaking and collaborating\" with his Fast & Furious co-star Vin Diesel, in a 2018 interview.\n\nThe stars of another action film, Mad Max: Fury Road, Charlize Theron and Tom Hardy, are reported to have filmed many of their scenes separately.\n\nAnd then there were the alleged tensions between Kim Cattrall and Sarah Jessica Parker, who were co-stars of Sex and the City, which ran for six years. In 2018, after Parker offered condolences for Cattrall's brother's death, Cattrall responded on social media, calling Parker a \"hypocrite\" and stating, \"You are not my family. You are not my friend.\"\n\nBut behind the scenes, hundreds of other spats will never see the light of day. \"Some of a publicist's best work may never be seen,\" says Daniel Bee, a publicist and brand consultant based in Los Angeles, \"because it stopped something that was wrong, or re-crafted something to a different narrative, or pointed the light in a different direction.\n\n\"The most interesting stuff I've ever done as a publicist is the stuff nobody will ever know about.\"\n\n'Powerful forces at play'\n\nSince Daniel Bee started out as an entertainment publicist in 1997, he has observed a shift in the wider industry. \"I started my career in the British media, there were 11 national newspapers competing with each other. It was a bear pit, hard work, and it was getting to know individuals via relationships.\n\n\"Now, you're up against an anonymous algorithm and accounts where you don't know who you're up against. It's harder to control than ever before.\"\n\nCertainly, social media has posed challenges for those attempting to control narratives around major films and their stars – while also heralding new forms of \"dark arts\" through which publicists can attempt to shape opinion.\n\n\"There has always been an army of advisors and consultants doing PR voodoo,\" says Eriq Gardner, entertainment law expert and founding partner of Puck News. \"While I'd love to say the public is media-literate and savvy enough to read between the lines to see the spin, the truth is there are a lot of powerful forces at play and sometimes a large amount of misinformation.\"\n\nSo-called PR voodoo is different now that a celebrity – or their fans – can access an audience of millions with a click.\n\nWhile the publicists of previous eras might only have had to worry about print and broadcast platforms, smartphones and social media mean today's digital landscape is a wild west where anyone can shape their own narrative. A badly judged post or comment can damage an actor's career.\n\nBut the flipside is a whole new medium in which PRs can practise their \"voodoo\".\n\nAstroturfing and ways to 'cause mischief'\n\nOne of the tactics is \"astroturfing\" – or disguising an orchestrated campaign as a spontaneous up-swelling of public opinion.\n\nThis works by manipulating public opinion and creating a false impression of grassroots support (hence the name) or opposition, often coordinated through social media accounts in a way that seems organic.\n\nThe practice isn't new, but has been given new life with the advent of social media algorithms.\n\n\"It's deliberately planting disinformation, or twisted versions of the truth, in certain sections of social media,\" says Carla Speight, founder of the PR Mastery app. \"The aim is the halfway point of influential where they will get a bit of traction, but so that it's not too obvious – you wouldn't hire a Kardashian to do it.\n\n\"It's built up in layers,\" she continues. \"It's like playing a very sinister game of chess. You're putting all the pieces in the right places, just the right amount of mixed-up information, and then you just watch it explode.\"\n\nAlthough the posts might appear to be genuine public opinion, in fact it's a faked crowd – whether that's made up of bots or real people, who can be paid to coordinate their posts.\n\n\"All it takes is one or two people to create a meme and put it with the right people,\" says Ms Speight. \"It needs to appear as a trend, and then it's gone. Something is dripped here, something else over there, and when it's done well… it causes a bit of mischief.\"\n\nReinventing an age-old tactic?\n\nBut all of this is simply a new platform for an age-old trend that has been going on long before the advent of social media, according to Mr Bee. \"Undetected smear campaigns have always been a thing,\" he points out.\n\n\"Previously it would have been a publicist whispering to a diarist of a national newspaper. The issue with digital media is it's anonymous and untraceable.\"\n\nWhat has changed, he continues, is that audiences have become savvier. \"Whereas before, a quite subservient audience would just take what was given to them in the media, with natural scepticism, curiosity, and a greater level of information, I think people use more critical thinking.\"\n\nEriq Gardner is less convinced: \"I'm not sure the public approaches what they read with enough scepticism.\"\n\nAnd yet those in the industry are often alert to it. According to Ms Speight, \"Usually, there's a distinct sort of tell, and it may be the PR thing where we have 'spidey senses' and we can sort of see it, but you're asking, 'Where has that come from? Who started that?' And when there's never a specific place to point it to, that's usually a tell-tale sign.\"\n\nThe Hollywood ecosystem\n\nWhat's clear, though, is that, with studios providing some publications with significant advertising revenue, as well as supplying talent for special events and front covers, revelations often emerge elsewhere in the media.\n\n\"When [scandals] come out, it's usually from places outside of Hollywood,\" argues Mr Rushfield. \"The Harvey Weinstein story was broken by The New York Times and the New Yorker.\"\n\nIt was The New York Times that first reported Lively's legal complaint in December. \"It's one of the few places that can afford to do that, and then everyone else jumped in so nobody was sticking their neck out.\" Baldoni filed a $250 million lawsuit against the New York Times in December, although a federal judge indicated this week that it might be dismissed.\n\nEven when bigger outlets break news about Hollywood disputes, the growing dominance of social media means that stories might not have the same cut-through they had previously.\n\nDoreen St Felix, a writer who was previously an editor on Lena Dunham's newsletter, recently wrote in The New Yorker that stories of harassment and abuse, for example, now receive a \"curdled, cynical, and exhausted reception\" – this, less than a decade after the emergence of the MeToo movement.\n\nShe went on to claim that: \"The late 2010s genre of #MeToo reportage cannot thrive on today's volatile internet. Information is misinformation and vice versa. Victims are offenders and offenders are victims.\"\n\nSometimes, however, the best way for publicists to prevent stories being amplified is by bypassing social media entirely when reacting to a scandal.\n\n\"If you give it to the press first, they don't quote as many of the comments on social media,\" says Ms Speight. \"You control the narrative completely, because the comments come afterwards.\"\n\nMr Rushfield points out that very little of the revelations in the entertainment press comes out because someone \"uncovered\" something. \"Almost everything you read is there because somebody placed it there – somebody is dictating a story.\"\n\nWhat viewers want\n\nNone of this industry would exist if the appetite weren't there and if the viewing public didn't want to unpick details about their lives – and rifts. And yet attitudes towards celebrity have undoubtedly changed since the advent of social media.\n\n\"It's now a two-way communication, which it never was before,\" points out Mr Bee. \"It was generally celebrities, or lawyer or government or whatever, just saying something that gets reported, and that message is conveyed. Now, you have to be prepared for a two-way conversation.\"\n\nBut he thinks there are different attitudes to the media today than in the era of celebrity gossip magazines. Nodding to the UK, he continues: \"We had the Leveson Inquiry, we're about to get an ITV drama about phone hacking – it's as if the curtain has been lifted.\"\n\nAs for the Lively and Baldoni lawsuits, it's not clear how these will play out – but the very fact that it has so unusually spilled into the public domain is a reminder of how well-oiled the Hollywood publicity machine is the rest of the time. And that is unlikely to change soon.\n\nBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. And we showcase thought-provoking content from across BBC Sounds and iPlayer too. You can send us your feedback on the InDepth section by clicking on the button below."
  },
  {
    "title": "Why is Blake Lively making claims of a smear campaign against her? | Entertainment News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2024/12/24/why-is-blake-lively-making-claims-of-a-smear-campaign-against-her",
    "formatted_content": "Hollywood star Blake Lively has filed a legal complaint against her It Ends With Us director and co-star Justin Baldoni, accusing him of “repeated sexual harassment” on set and of an intensive smear campaign against her after the movie’s release.\nLively filed the complaint, which precedes a lawsuit, on Friday with the California Civil Rights Department, according to reports by The Associated Press news agency. Baldoni, his publicists and senior executives of Wayfarer, Baldoni’s studio behind the 2024 movie, have all been named as defendants in the complaint.\n“I hope that my legal action helps pull back the curtain on these sinister retaliatory tactics to harm people who speak up about misconduct and helps protect others who may be targeted,” Lively said in a statement to journalists.\nBaldoni, who is known for speaking up about “toxic masculinity” and for supporting women, has not personally responded to the claims. His legal team, however, has called them “completely false”.\nHere’s what we know about the dispute:\n\n## What was the film It Ends With Us about?\n\nThe August 2024 drama is based on author Colleen Hoover’s bestselling 2016 novel of the same name. Set in Boston, Massachusetts, the film follows the tale of florist Lily Bloom, played by Lively. Lily was raised by an abusive father who often hit her mother and ends up falling for and marrying neurosurgeon Ryle Kincaid, played by Baldoni.\nWhen her first love, Atlas, played by Brandon Sklenar, re-enters her life, Lily begins to see Ryle’s abusive side. She eventually finds the courage to leave the marriage, strengthened by the need to protect her baby girl and promising that the cycle of violence would end with her.\nLively co-produced the film while Baldoni directed it. The movie was met with mixed reviews as some critics accused the makers of romanticising domestic violence. Still, it was a box office hit, raking in $351m worldwide while costing $25m to make. Other big Hollywood names in the movie include Jenny Slate and comedian Hasan Minhaj.\n\n## What happened on the film set?\n\nDuring the film’s shoot from April 2023 to early 2024, Lively made complaints that Baldoni and Wayfarer CEO Jamey Heath were violating physical boundaries and were directing sexual, inappropriate comments at her, according to the legal complaint, which was obtained by The New York Times.\nAccording to the complaint, Lively expressed concerns about Baldoni before shooting began and said she objected to sex scenes he wanted to add and that she felt were unnecessary.\nLater on, she said, Baldoni spoke to her about his sex life, pressured her about her religious beliefs and called her fitness trainer regarding her post-pregnancy weight behind her back. The actress gave birth to her fourth child in February 2023.\nIn November 2023, Lively approached Wayfarer, demanding safeguards be implemented on the film set.\nDuring a meeting with Baldoni, Heath and other producers, she complained that Baldoni had improvised unwanted kissing on set and discussed his sex life, revealing details of encounters when he may not have received consent.\nHeath, Lively alleged, showed her a video of his naked wife and watched the star in her trailer while she undressed. Both men, she added, entered her trailer unannounced while she was undressed, including while she was breastfeeding.\nWayfarer agreed that both men would not be allowed into Lively’s trailer and they would no longer show or talk to Lively about nude videos or images of women or sexual experiences, genitalia or pornography. Baldoni was barred from improvising sex scenes, asking about Lively’s weight, pressing her on her religious beliefs or mentioning her late father. The studio also brought on an intimacy coordinator to monitor Baldoni and Lively’s scenes.\nAccording to The New York Times, Lively later told people whom she worked with that the men’s behaviour had changed.\n\n## Why does Lively say she was subject to a smear campaign?\n\nHowever, Lively also alleged in Friday’s legal complaint that Baldoni and Wayfarer targeted her after the film’s release in a “sophisticated and well-financed” plan to damage her reputation in retaliation for speaking up on set. Wayfarer co-founder Steve Sarowitz was also named in the complaint.\nThe actress backed up her complaint with thousands of pages of text messages and emails between Baldoni and his team that she obtained through a subpoena, according to The New York Times report.\nLively said in the complaint that Baldoni had hired publicists to plant theories about her online and place news stories criticising her. Baldoni’s team “created, planted, amplified, and boosted content designed to eviscerate Ms Lively’s credibility”, the complaint read. “They engaged in the same techniques to bolster Mr Baldoni’s credibility and suppress any negative content about him.”\nAccording to the text messages included with the complaint, Wayfarer and Baldoni hired Melissa Nathan, a public relations crisis manager with high-profile clients, including actor Johnny Depp and the rapper Drake.\nIn their initial communication, Baldoni told Nathan he wanted a stronger PR plan than the one she had presented. “He wants to feel like she can be buried,” Jennifer Abel, Baldoni’s publicist, later texted Nathan, according to the records in the legal complaint.\nLater, the PR team agreed to work on an “untraceable” social media strategy that would work to “change narrative” around Lively, painting her as a bully on set and portraying Baldoni as her victim. The team also worked to bury stories that hinted at Baldoni’s alleged inappropriate behaviour on set, according to the text documents.\n\n## Was Lively’s reputation damaged in any way?\n\nLively did experience negative comments online after the movie’s release although it is unclear how much of that was engineered or boosted by external forces. A marketing firm Lively hired produced a report in August that concluded she was likely the subject of a “multichannel online attack”.\nCritics accused her of being “tone-deaf” because in several appearances, she wore floral colours in line with the style of her character in the film. Many also accused her of failing to promote advocacy against domestic violence in the media campaign for the movie.\nSocial media users began reposting instances of Lively being rude or ungracious in the past. In one instance, Norwegian entertainment reporter Kjerssti Flaa reuploaded a 2016 interview she conducted with Lively on YouTube. In the clip, Lively had snapped at the reporter for commenting on the actor’s baby bump. Flaa has since said her actions were not part of an orchestrated campaign.\n\n## What does Baldoni say about the dispute?\n\nBaldoni has not responded personally to the allegations. Bryan Freedman, an attorney representing him, Wayfarer and its top executives, has pushed back against Lively’s claims, saying they are “completely false, outrageous and intentionally salacious”.\nFreedman said Lively had threatened not to appear on set or promote the film if her requests were not attended to. Wayfarer, he added, had hired a crisis manager to “proactively” address what he described as “multiple demands and threats”.\nLively’s complaint alleges that Baldoni played a key role in the PR campaign against her, encouraging his team and flagging sample social media posts for it to use.\nAt times, however, the texts reviewed by The New York Times showed he also voiced concerns about articles critical of Lively. “How can we say somehow that we are not doing any of this – it looks like we are trying to take her down,” he said in one text.\nBaldoni was missing from several appearances during the film’s media campaign and was never photographed with Lively.\nOn Monday, global nonprofit Vital Voices, which focuses on empowering women, rescinded a December 9 award it had presented Baldoni for his solidarity with women. Baldoni’s podcast co-host Liz Plank also announced on Tuesday she is leaving his Man Enough show.\n\n## What are other stars saying?\n\nAfter the film’s release, internet sleuths noticed very quickly that the It Ends With Us author, Colleen Hoover, was not following Baldoni on Instagram. Furthermore, in a statement posted on the social media site on Saturday, Hoover described Lively as “honest, kind, supportive, and patient”. She stopped short of commenting directly about the allegations against Baldoni.\nCo-star Sklenar defended Lively in an Instagram post, saying it was “disheartening to see the amount of negativity being projected” on the women in the movie, adding that the negative coverage was distracting from the film’s message.\nAmerica Ferrera, Amber Tamblyn and Alexis Bledel who co-started with Lively in the 2005 film The Sisterhood of the Travelling Pants have, meanwhile, also backed her in a joint statement issued on Instagram on Sunday.\n“Throughout the filming of ‘It Ends with Us’, we saw her summon the courage to ask for a safe workplace for herself and colleagues on set, and we are appalled to read the evidence of a premeditated and vindictive effort that ensued to discredit her voice,” the statement read."
  },
  {
    "title": "Blake Lively and Justin Baldoni get March 2026 trial date for her 'It Ends With Us' lawsuit | AP News",
    "url": "https://apnews.com/article/justin-baldoni-blake-lively-9f40635a679b8e505fd403a337e1ad85",
    "formatted_content": "## ___\n\nNEW YORK (AP) — A New York judge set a March 2026 trial date on Monday and moved an initial conference from mid-February to next week as the public feud between Blake Lively and her “It Ends With Us” costar and director Justin Baldoni continued to grow and accelerate.\n\nAnd in a new and separate front in the series of legal battles surrounding the film that became a surprise hit last summer, Lively in a Texas court filed a request for a deposition of a man she says was central to turning online sentiment against her during its release and promotion.\n\nThe New York federal judge, Lewis J. Liman, told both sides in an order late Monday to prepare for a March 9, 2026, trial.\n\nHe also moved an initial conference from mid-February to next week and told lawyers to be prepared to address complaints about pretrial publicity and attorney conduct.\n\nLiman took the actions after Lively’s lawyers claimed in a filing on Monday that an attorney for Baldoni was trying to taint potential jurors over lawsuits the actors have filed against each other.\n\nThe lawyers said Baldoni’s attorney was trying to wreck Lively’s career and turn potential New York jurors against her by creating a website to release selected documents and communications between Lively and Baldoni.\n\nThe lawyers said attorney Bryan Freedman, representing Baldoni, was “engaging in this extrajudicial campaign to influence these proceedings and the public perception of legal filings to this Court, and there already is a serious risk that his misconduct is tainting the jury pool.”\n\nThey added: “The endless stream of defamatory and extrajudicial media statements must end.”\n\nFreedman said in a statement in response to Monday’s assertions that the “irony is not lost on anyone that Ms. Lively is so petrified of the truth that she has moved to gag it.”\n\n“We will always respect the court; however, we will never be bullied by those suggesting we cannot defend our clients with pure, unedited facts,” the lawyer said. “All we want is for people to see the actual text messages that directly contradict her allegations, video footage that clearly shows there was no sexual harassment and all the other powerful evidence that directly contradicts any false allegations.”\n\nIn a letter to the judge on Thursday, Baldoni attorney Kevin Fritz accused Lively of a publicity campaign that left Baldoni and other defendants the “objects of public scorn and contempt.”\n\nHe said the actions had damaged those she sued so that they were “exiled from polite society and suffered damages totaling hundreds of millions of dollars due to Ms. Lively’s scorched-earth media campaign.”\n\nIn the separate filing in Hays County, Texas, a precursor to another potential lawsuit, Lively asks for an order for a deposition from Jed Wallace, a crisis management specialist she alleges was behind much of the social media manipulation surrounding the film that turned public sentiment against her through posts on Reddit and TikTok.\n\nWallace and his Texas-based firm Street Relations were brought on as subcontractors by publicists working with Baldoni and his production company, the filing said.\n\n“He weaponized a digital army around the country, including in New York and Los Angeles, to create, seed, manipulate, and advance disparaging content that appeared to be authentic on social media platforms and internet chat forums,” the filing alleges.\n\nWallace is identified in Lively’s federal lawsuit, but he is not a defendant.\n\nFreedman, who the filing says is Wallace’s lawyer, did not respond to a request for comment on the issue.\n\nLively sued Baldoni, his production company and others in New York in late December for sexual harassment and attacks on her reputation and asked for unspecified damages. Baldoni sued earlier this month, accusing Lively and her husband, “Deadpool” actor Ryan Reynolds, of defamation and extortion and seeking at least $400 million in damages.\n\nThe judge said Monday that he’ll likely combine the lawsuits for trial.\n\n“It Ends With Us,” an adaptation of Colleen Hoover’s bestselling 2016 novel that begins as a romance but takes a dark turn into domestic violence, was released in August, exceeding box office expectations with a $50 million debut. But the movie’s release was shrouded by speculation over discord between Lively and Baldoni.\n\nLively came to fame through the 2005 film “The Sisterhood of the Traveling Pants,” and bolstered her stardom on the TV series “Gossip Girl” from 2007 to 2012. She has since starred in films including “The Town” and “The Shallows.”\n\nBaldoni starred in the TV comedy “Jane the Virgin,” directed the 2019 film “Five Feet Apart” and wrote “Man Enough,” a book pushing back against traditional notions of masculinity.\n\nAP Entertainment Writer Andrew Dalton reported from Los Angeles."
  },
  {
    "title": "Blake Lively demandada por especialista en crisis de Texas en nuevo caso de ‘It Ends With Us’ | AP News",
    "url": "https://apnews.com/article/blake-lively-justin-baldoni-70acb534fa6621e2e5f465aed9584f95",
    "formatted_content": "## ___\n\nUn especialista de gestión de crisis de Texas demandó a Blake Lively por difamación después de que la actriz lo involucrara en su disputa legal con el coprotagonista y director Justin Baldoni por su película, “It Ends With Us”.\n\nJed Wallace y su empresa, Street Relations, presentaron la demanda de 7 millones de dólares en el tribunal federal de Texas el martes. Alega que él no tuvo nada que ver con ninguna campaña para dañar la reputación de Lively, como ella alegó en una presentación judicial.\n\nWallace no está entre los demandados en el caso federal de Lively contra Baldoni, su compañía de producción y publicistas, en la que ella alega acoso sexual y otro tipo de acoso durante la producción y una campaña para difamarla después de esta. El especialista en crisis está nombrado en los documentos judiciales y en la historia del New York Times publicada el día que comenzó la serie de batallas legales en diciembre, cuando Lively presentó una queja.\n\nLos abogados de Lively dijeron en un comunicado que la demanda de Wallace “no es solo un truco publicitario”.\n\n“Es una represalia transparente en respuesta a las acusaciones contenidas dentro de una queja de acoso sexual y represalias que la Sra. Lively presentó ante el Departamento de Derechos Civiles de California”, dijo el comunicado. “Aunque esta demanda será desestimada, nos complace que el Sr. Wallace finalmente haya salido de las sombras, y que él también será responsabilizado en el tribunal federal”.\n\nEn una presentación la semana pasada en el condado de Hays, Texas, que busca una deposición de Wallace, Lively alega que fue utilizada por publicistas que trabajaban con Baldoni para armar “un ejército digital en todo el país, incluyendo en Nueva York y Los Ángeles, para crear, sembrar, manipular e impulsar contenido despectivo que parecía auténtico en plataformas de redes sociales y foros de chat en internet”.\n\nLa demanda de Wallace dice que ni él ni su empresa “tuvieron nada que ver con el presunto acoso sexual, la represalia, la falta de investigación o el apoyo y fomento del presunto acoso o la presunta represalia”.\n\nDice que la presentación de la actriz en Texas “admitió que Lively no tiene hechos que respalden las acusaciones que hizo contra Wallace y Street”, razón por la cual ahora busca investigar el alcance de su conducta.\n\nDespués de que Lively demandó a Baldoni, el actor presentó su propia demanda federal contra ella y su esposo, el astro de “Deadpool”, Ryan Reynolds, acusándolos de difamación y extorsión y buscando al menos 400 millones de dólares en daños.\n\nBaldoni ya había demandado al New York Times por difamación, y su expublicista presentó una demanda apoyando a Lively.\n\n“It Ends With Us”, una adaptación de la popular novela de 2016 de Colleen Hoover que comienza como un romance, pero toma un giro oscuro hacia la violencia doméstica, se estrenó en agosto, superando sus expectativas de taquilla con un total doméstico de casi 150 millones de dólares. El éxito fue seguido por el escándalo sobre su producción y promoción.\n\nEsta historia fue traducida del inglés por un editor de AP con la ayuda de una herramienta de inteligencia artificial generativa."
  },
  {
    "title": "Blake Lively's lawyers seek tight hold over release of information in lawsuit against Justin Baldoni",
    "url": "https://apnews.com/article/justin-baldoni-blake-lively-6aa00d577e4e5a93f5747830cecbfaee",
    "formatted_content": "NEW YORK (AP) — A lawyer for actor Blake Lively asked a federal judge Thursday to impose strict rules to prevent anyone associated with Justin Baldoni getting personal or intimate information about her or other celebrities while potential evidence is shared among attorneys as her sexual harassment claims against her costar in “It Ends With Us” proceeds toward trial.\n\nMeryl Governski, representing Lively, told Judge Lewis J. Liman in a telephone conference that some materials must be shared only between lawyers to protect her client and others. The judge did not immediately rule.\n\nLively sued Baldoni, his production company and others in New York in late December for sexual harassment and attacks on her reputation and sought unspecified damages. Baldoni later countersued, accusing Lively and her husband, “Deadpool” actor Ryan Reynolds, of defamation and extortion and seeking at least $400 million in damages.\n\nGovernski said some defendants in Lively’s lawsuit filed in late December against Baldoni, his production company and others seemed to be operating on an unlimited budget as they “try to ruin the lives of Ms. Lively and her family.”\n\n“There is an insatiable appetite for any information about this case, no matter how benign it is,” Governski said. “The defendants have bragged in text messages about being able to publish information without fingerprints.”\n\nShe said one category of information that needs to be kept between lawyers related to medical information, including mental health, and that “personal and intimate conversations with unrelated third parties” must be kept out of the public eye because — while the public relations value would be high — the evidentiary value would be “virtually nonexistent.”\n\nGovernski said there were “dozens and dozens of third parties” that would be identified by name in discovery materials, and “we think there is a significant chance of irreparable harm if marginally relevant information with high-profile individuals who are unrelated to the case fall into the wrong hands.”\n\nBryan Freedman, representing Baldoni and his production company, scoffed at Governski’s statements, saying the judge’s proposed order to keep potential evidence in the case secret while it is shared between attorneys and their clients was sufficient.\n\nFreedman said the case was similar to others, despite the fame of its litigants, and he should be able to discuss potential evidence with his clients to properly defend them.\n\n“Frankly we see no difference because someone is a celebrity” as to how the case should proceed, he said.\n\nFreedman said Lively’s lawyers could request that certain sensitive materials, such as medical information related to her claims that she suffered emotional distress, be kept between lawyers when the issue arises.\n\n“If they need greater protection and need our clients not to see something, they could make a specific showing,” he said.\n\nThe judge said he expects to rule soon. He noted there was a “presumption of public access” to the courts, and he cited the public’s right to know how the court’s resources are being used.\n\nHe has already warned lawyers to obey court rules about making public statements that could endanger a fair trial and suggested he could order a trial scheduled for March 9, 2026, to occur sooner if lawyers continued making fiery public comments.\n\n“It Ends With Us,” an adaptation of Colleen Hoover’s bestselling 2016 novel that begins as a romance but takes a dark turn into domestic violence, was released in August, exceeding box office expectations with a $50 million debut. But the movie’s release was shrouded by speculation over discord between Lively and Baldoni.\n\nLively became widely known after she appeared in the 2005 film “The Sisterhood of the Traveling Pants.” She bolstered her stardom on the TV series “Gossip Girl” from 2007 to 2012 before starring in films including “The Town” and “The Shallows.”\n\nBaldoni starred in the TV comedy “Jane the Virgin,” directed the 2019 film “Five Feet Apart” and wrote “Man Enough,” a book pushing back against traditional notions of masculinity."
  },
  {
    "title": "Blake Lively accuses 'It Ends With Us' costar of abusing the courts with countersuit | AP News",
    "url": "https://apnews.com/article/justin-baldoni-blake-lively-8672023a7db5906974d1416870e87d57",
    "formatted_content": "NEW YORK (AP) — Actor Blake Lively asked a judge on Thursday to dismiss a countersuit filed against her by her “It Ends With Us” costar Justin Baldoni, calling his claims “vengeful and rambling” after she sued for sexual harassment and retaliation.\n\nLively’s lawyers wrote in papers filed in Manhattan federal court that Baldoni and his production company’s claims that he and his companies were defamed were a “profound abuse of the legal process.”\n\n“The law prohibits weaponizing defamation lawsuits, like this one, to retaliate against individuals who have filed legal claims or have publicly spoken out about sexual harassment and retaliation,” the lawyers said.\n\nLively sought unspecified damages when she sued Baldoni in late December for alleged sexual harassment and retaliation. He countersued for $400 million, accusing Lively and her husband, “Deadpool” actor Ryan Reynolds, of defamation and extortion.\n\nOn Wednesday, lawyers for Reynolds filed papers in the countersuit urging that he be dismissed as a defendant from the countersuit to Lively’s claims that Baldoni and related parties launched a social media campaign to “destroy” her after she privately called out alleged sexual harassment and inappropriate conduct against her and others on the movie set.\n\n“So what does Ryan Reynolds have to do with that, legally speaking, other than being a supportive spouse who has witnessed firsthand the emotional, reputational and financial devastation Ms. Lively has suffered?” they wrote.\n\nIn recent court papers, Baldoni’s attorneys wrote that slanderous statements and actions by Lively and related parties had ruined their clients.\n\n“Their reputations are destroyed, their businesses lie in tatters, and their own Film was taken from them,” they said in court papers.\n\nBoth sides have accused the other of trying to ruin them.\n\n“It Ends With Us,” an adaptation of Colleen Hoover’s bestselling 2016 novel that begins as a romance but takes a dark turn into domestic violence, was released in August, exceeding box office expectations with a $50 million debut. But the movie’s release was shrouded by speculation over discord between Lively and Baldoni.\n\nLively became widely known after she appeared in the 2005 film “The Sisterhood of the Traveling Pants.” She bolstered her stardom on the TV series “Gossip Girl” from 2007 to 2012 before starring in films including “The Town” and “The Shallows.”\n\nBaldoni starred in the TV comedy “Jane the Virgin,” directed the 2019 film “Five Feet Apart” and wrote “Man Enough,” a book pushing back against traditional notions of masculinity."
  }
]